package.path = tostring(tostring(获取脚本目录())..'\\?.lua');---准备require
json=0--初始化一下
json=require("json")

function 兑换信标寻路()
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{5659.09,4527.26,3604.58},
		{5055.71,3928.77,3356.91},
		{4505.84,3215.46,3128.37},
		{4099.98,2420.45,3104.89},
		{3457.36,1832.31,3097},
		{2638.03,1549.3,3100.19},
		{1906.47,995.17,3093},
		{1474.24,196.481,3093},
		{1112.74,59.4768,3093},
	}
	坐标数量=#坐标表
	避难所寻路(1112.74,59.4768,3093,坐标数量,坐标表)
end
function 等待兑换信标()
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		延迟(1000)
		if 取顶层窗口名()== "NewStore" then 
			延迟(1000)
			按键加强("spacebar")--按空格关闭所有界面		
			延迟(1000)	
		end
		if 取顶层窗口名()~= "NewStore" then 
			输出信息("退出换装")
			break
		end		
	end	
end	
function 兑换信标(信标)
	兑换信标寻路()
	打开NPC()
	延迟(2000)
	对话选项("黑市")	
	延迟(1500)
	选商店左侧分组(3)
	延迟(1500)
	选择商品(信标)
	延迟(1500)
	购买商品(1)
	等待兑换信标()
end

function 取过图状态()
	if 取顶层窗口名()== "Loading" then 
		输出信息("正在过图")
		return 0
	else
		输出信息("没在过图")
		return 1
	end
end
function 更新技能1()
	延迟(3000)	
	按键(0x4B) --技能更换按键K
	延迟(2000)
	更新技能商店()
	延迟(3000)		
	打开技能背包(1,2)
	延迟(1000)	
	打开购买技能详情("机械改造")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(1000)	
	购买技能()--测试可用
	延迟(1000)
	安装技能("机械改造")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(2000)
	打开技能背包(1,3)
	延迟(1000)	
	打开购买技能详情("召唤物伤害")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(1000)	
	购买技能()--测试可用
	延迟(1000)
	安装技能("召唤物伤害")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)			
end	
function 更新技能2()
	延迟(3000)	
	按键(0x4B) --技能更换按键K
	延迟(2000)
	更新技能商店()
	延迟(3000)		
	打开技能背包(3,2)
	延迟(1000)	
	打开购买技能详情("机械改造")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(1000)	
	购买技能()--测试可用
	延迟(1000)
	安装技能("机械改造")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(2000)	
	打开技能背包(3,3)
	延迟(1000)	
	打开购买技能详情("召唤物伤害")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(1000)	
	购买技能()--测试可用
	延迟(1000)
	安装技能("召唤物伤害")--//一个参数，技能名，，前提是用脚本打开了技能背包
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end	
function 更新技能3()
	延迟(3000)	
	按键(0x4B) --技能更换按键K
	延迟(2000)
	更新技能商店()
	延迟(3000)		
	打开技能背包(4,2)
	延迟(1000)	
	打开购买技能详情("机械改造")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(1000)	
	购买技能()--测试可用
	延迟(1000)
	安装技能("机械改造")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(2000)	
	打开技能背包(4,3)
	延迟(1000)	
	打开购买技能详情("召唤物伤害")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(1000)	
	购买技能()--测试可用
	延迟(1000)
	安装技能("召唤物伤害")--//一个参数，技能名，，前提是用脚本打开了技能背包
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end	
function 更新技能4()
	延迟(3000)	
	按键(0x4B) --技能更换按键K
	延迟(2000)
	更新技能商店()
	延迟(3000)		
	打开技能背包(2,2)
	延迟(1000)	
	打开购买技能详情("瞬时回复")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(1000)	
	购买技能()--测试可用
	延迟(1000)
	安装技能("瞬时回复")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(2000)	
	打开技能背包(2,3)
	延迟(1000)	
	打开购买技能详情("加速冷却")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(1000)	
	购买技能()--测试可用
	延迟(1000)
	安装技能("加速冷却")--//一个参数，技能名，，前提是用脚本打开了技能背包
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 等待换装()
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		延迟(1000)
		if 取顶层窗口名()== "Bag" then 
			延迟(1000)
			按键加强("spacebar")--按空格关闭所有界面		
			延迟(1000)	
		end
		if 取顶层窗口名()~= "Bag" then 
			输出信息("退出换装")
			break
		end		
	end	
end	
function 快速换装()		
	延迟(3000)
	鉴定所有物品("装备页")
	延迟(2000)
	更新装备()
	延迟(2000)
	回收()	
	延迟(2000)
	等待换装()
end
function 回收()	
	取背包分页("装备页")
	local num=取元素数量("背包物品")
	输出信息(num)
	local i=0;
	while true do
		if i < num then
			local name,部位,装备等级,背包格子号,背包页号=取容器元素信息("背包",i)
			输出信息(name)
			输出信息(部位)
			输出信息(装备等级)
			输出信息(背包格子号)
			输出信息(背包页号)
			回收装备("装备页",背包格子号)
			--延迟(500)
			鼠标左键点击()
			输出信息("=====================")
		else
			break
		end
		i=i+1;
	end	
end		
	function 更新装备()
		取背包分页("装备页")
		local num=取元素数量("背包物品")
		输出信息(num)
		local i=0;
		while true do
			if Level == 1 then
				break
			end	
			if i < num then
				local name,部位,装备等级,背包格子号,背包页号=取容器元素信息("背包",i)
				输出信息(name)
				输出信息(部位)
				输出信息(装备等级)
				输出信息(背包格子号)
				输出信息(背包页号)
				if 部位=='头部' or 部位=='颈部' or 部位=='胸部' or 部位=='手部' or 部位=='手指' or 部位=='腰部' or 部位=='脚部' then
					打开装备详情(背包格子号)
					延迟(2000)
					if 取装备差距() >0 then
						点安装备按钮()
						延迟(2000)
						输出信息("13222222223333")
					end
				end
				输出信息("11111111111")
				if 部位=='单手' then
					输出信息("换单手武器")
					打开装备详情(背包格子号)
					延迟(2000)
					local 主手生存数值,主手伤害数值,副手生存数值,副手伤害数值=取装备差距()
					if 主手伤害数值 >0 then
						点安装备按钮()
						延迟(2000)
						更换武器(背包格子号,2)
						延迟(2000)
					end
					
					if 副手伤害数值 >0 then
						点安装备按钮()
						延迟(2000)
						更换武器(背包格子号,3)
						延迟(2000)
					end
					
				end
				if 部位=='双手' then
					输出信息("换双手武器")
					local 主手伤害数值=取装备差距()
					if 主手伤害数值 >0 then
						点安装备按钮()
						延迟(2000)
					end
				end
				输出信息("=====================")
			else
				break
			end
			i=i+1;
		end	
	end
function 获取距离3D(x1,y1,z1,x2,y2,z2)
	local lDis = 0.0
	lDis = math.sqrt((x1-x2)*(x1-x2)+(y1-y2)*(y1-y2) + (z1-z2)*(z1-z2))
	return lDis
end


function 测试(x,y,z,dis)
	移动Call(x,y,z,150)
	延迟(200)
	local xue,dengji,lan,rolex,roley,rolez=取角色信息();
	local roledis=获取距离3D(rolex,roley,rolez,x,y,z)
	if roledis<=dis then
		输出信息("1111111");
		return
	end
	--加血
	记忆点复活()
	按键加强("q")
	测试(x,y,z,dis)
	
end		
function 建立导航坐标系(坐标数量,坐标表)
	local i = 0;--记录循环的次数

	while i < 坐标数量  do
		i = i + 1;
		输出信息("主循环次数："..i);
		加入导航坐标系(坐标表[i][1],坐标表[i][2],坐标表[i][3])	
	end
end
function 导航寻路(x,y,z,l,b)
	初始化导航坐标系()
	建立导航坐标系(l,b)
	--自建导航寻路(-548.527,-11717.2,606,300,2,1500)
	自建导航路线(x,y,z,1700)--4个参数，目标点坐标、搜索密度
	local 元素数量=取元素数量("自建导航")	
	输出信息(元素数量)
	for i=0,(元素数量-1) do
		local 路线坐标X,路线坐标Y,路线坐标Z=取导航坐标("自建导航",i)
		输出信息("*************************")
		输出信息(路线坐标X)
		输出信息(路线坐标Y)
		输出信息(路线坐标Z)
		--按键加强("a")	
		--鼠标解锁()
		local jieguo=实时移动(路线坐标X,路线坐标Y,路线坐标Z,300)
		--按键加强("a")	
		跳过动画()
		--使用技能("旋风斩")
		if 取血比例() < 79 then
			按键加强("q")	
		end
		鼠标右键点击()
		延迟(800)
		按键加强("w")	
		延迟(800)
		按键加强("e")	
		按键加强("r")			
		if jieguo==3 then
			记忆点复活()
			延迟(5000)
			导航寻路(x,y,z,l,b)
			return 3 
		end				
		输出信息("=====================")
	end
end		
function 避难所寻路(x,y,z,l,b)
	初始化导航坐标系()
	建立导航坐标系(l,b)
	--自建导航寻路(-548.527,-11717.2,606,300,2,1500)
	自建导航路线(x,y,z,1700)--4个参数，目标点坐标、搜索密度
	local 元素数量=取元素数量("自建导航")	
	输出信息(元素数量)
	for i=0,(元素数量-1) do
		local 路线坐标X,路线坐标Y,路线坐标Z=取导航坐标("自建导航",i)
		输出信息("*************************")
		输出信息(路线坐标X)
		输出信息(路线坐标Y)
		输出信息(路线坐标Z)
		--按键加强("a")	
		--鼠标解锁()
		local jieguo=实时移动(路线坐标X,路线坐标Y,路线坐标Z,300)	
		按键加强("q")
		if jieguo==3 then
			记忆点复活()
			延迟(5000)
			导航寻路(x,y,z,l,b)
			return 3 
		end				
		输出信息("=====================")
	end
end		
function 技能加点()
	打印游戏右上角加点信息()
	延迟(100)
	local 计次=0
	while  true do
		计次=计次+1
		if 计次 < 2 then
			点击右上角加点("召唤物伤害")
			延迟(100)											
		else
			break	
		end		
	end	
end	
function 等待加点()
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		延迟(1000)
		if 取顶层窗口名()== "Talent" then 
			延迟(1000)
			按键加强("spacebar")--按空格关闭所有界面		
			延迟(1000)	
		end
		if 取顶层窗口名()~= "Talent" then 
			输出信息("退出加点")
			break
		end		
	end	
end	
function 加点()
    打印游戏右上角加点信息()
    延迟(800)
	local 计次=0
	while  true do
		计次=计次+1
		if 计次 < 2 then
			点击右上角加点("召唤物伤害")
			延迟(500)
			点击右上角加点("召唤机械警卫")
			延迟(500)
			点击右上角加点("复合药剂")
			延迟(500)
			点击右上角加点("应急回复")
			延迟(500)	
			点击右上角加点("狂热之军")
			延迟(500)		
			点击右上角加点("机械改造")
			延迟(500)	
			点击右上角加点("黑暗之门")
			延迟(500)	
			点击右上角加点("加速冷却")
			延迟(500)		
			点击右上角加点("持续时间缩短")
			延迟(500)	
			点击右上角加点("持续时间延长")
			延迟(500)	
			点击右上角加点("痛楚加剧")
			延迟(500)																				
		else
			break	
		end		
	end		
    local _, playerLevel, _, _, _, _ = 取角色信息()
    输出信息(playerLevel)
    
    if playerLevel ~= prevLevel then  -- 对比当前等级与上一次等级是否一致
        if playerLevel <= 25 then
            playerLevel25()
        elseif playerLevel <= 45 then
            playerLevel25or45()
        else
            playerLevel45()
        end
        prevLevel = playerLevel  -- 更新上一次检查时的等级
    end
	等待加点()
end
function playerLevel25()
		延迟(2000)
		按键(0x50) --天赋加点打开P
		延迟(2000)
		激活天赋(1,6)
		延迟(1000)
		天赋加点(1,6,600103)
		天赋加点(1,6,600103)	
		天赋加点(1,6,600103)	
		天赋加点(1,6,600203)	
		天赋加点(1,6,600202)
		天赋加点(1,6,600202)
		天赋加点(1,6,600202)
		天赋加点(1,6,600302)	
		天赋加点(1,6,600301)
		天赋加点(1,6,600301)
		天赋加点(1,6,600301)	
		天赋加点(1,6,600401)
		天赋加点(1,6,600404)
		天赋加点(1,6,600404)
		天赋加点(1,6,600404)		
		天赋加点(1,6,600503)	
		天赋加点(1,6,600601)
		天赋加点(1,6,600601)	
		天赋加点(1,6,600601)
		天赋加点(1,6,600701)	
		天赋技能选择(6,1,1,600011)
		天赋技能选择(6,1,2,600023)		
end

function playerLevel25or45()
		延迟(2000)
		按键(0x50) --天赋加点打开P
		延迟(2000)	
		延迟(2000)
		激活天赋(2,61)
		延迟(1000)
		天赋加点(2,61,610101)
		天赋加点(2,61,610101)
		天赋加点(2,61,610101)
		天赋加点(2,61,610105)
		天赋加点(2,61,610105)
		天赋加点(2,61,610105)	
		天赋加点(2,61,610201)
		天赋加点(2,61,610205)
		天赋加点(2,61,610202)		
		天赋加点(2,61,610202)
		天赋加点(2,61,610202)	
		天赋加点(2,61,610301)	
		天赋加点(2,61,610301)
		天赋加点(2,61,610301)
		天赋加点(2,61,610302)		
		天赋加点(2,61,610401)
		天赋加点(2,61,610402)
		天赋加点(2,61,610402)
		天赋加点(2,61,610402)
		天赋加点(2,61,610501)		
		天赋加点(2,61,610604)
		天赋加点(2,61,610604)
		天赋加点(2,61,610604)
		天赋加点(2,61,610704)
		天赋加点(2,61,610703)		
		天赋加点(2,61,610703)		
		天赋加点(2,61,610703)		
		天赋加点(2,61,610702)		
		天赋加点(2,61,610702)		
		天赋加点(2,61,610702)			
		天赋加点(2,61,610801)
		天赋加点(2,61,610801)		
		天赋加点(2,61,610801)			
		天赋加点(2,61,610802)
		天赋加点(2,61,610803)		
		天赋加点(2,61,610901)	
		天赋加点(2,61,610902)
		天赋技能选择(61,2,1,610011)
		天赋技能选择(61,2,2,610021)	
end

function playerLevel45()
		延迟(2000)
		按键(0x50) --天赋加点打开P
		延迟(2000)		
		延迟(2000)
		激活天赋(3,63)
		延迟(1000)
		天赋加点(3,63,630101)
		天赋加点(3,63,630101)
		天赋加点(3,63,630103)
		天赋加点(3,63,630103)
		天赋加点(3,63,630103)
		天赋加点(3,63,630101)	
		天赋加点(3,63,630201)
		天赋加点(3,63,630202)
		天赋加点(3,63,630202)
		天赋加点(3,63,630202)
		天赋加点(3,63,630203)
		天赋加点(3,63,630302)			
		天赋加点(3,63,630402)
		天赋加点(3,63,630402)
		天赋加点(3,63,630402)
		天赋加点(3,63,630404)
		天赋加点(3,63,630404)
		天赋加点(3,63,630404)		
		天赋加点(3,63,630501)
		天赋加点(3,63,630501)
		天赋加点(3,63,630501)
		天赋加点(3,63,630502)
		天赋加点(3,63,630504)
		天赋加点(3,63,630601)		
		天赋加点(3,63,630604)
		天赋加点(3,63,630604)
		天赋加点(3,63,630604)
		天赋加点(3,63,630702)
		天赋加点(3,63,630702)
		天赋加点(3,63,630704)	
		天赋加点(3,63,630703)
		天赋加点(3,63,630703)
		天赋加点(3,63,630703)
		天赋加点(3,63,630801)
		天赋加点(3,63,630801)
		天赋加点(3,63,630801)	
		天赋加点(3,63,630802)
		天赋加点(3,63,630803)
		天赋加点(3,63,630901)
		天赋加点(3,63,630902)	
		天赋技能选择(63,3,1,630011)					
end
local prevLevel = 0  -- 添加一个变量保存上一次检查时的等级


function BOSS寻路(x,y,z)
	local jieguo=实时移动(x,y,z,400)
	if jieguo==3 then
		延迟(3500)
		记忆点复活()
		--死亡结果=1
		return 3 
	end		
	if 取血比例() < 79 then
		按键加强("q")	
	end
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")	
	按键加强("r")		
	return 0	
end	
function 导航寻路1(x,y,z)
	创建导航路线(x,y,z)
	延迟(100)
	画出导航路线()
	local 元素数量=取元素数量("导航路线")	
	输出信息(元素数量)
	for i=0,(元素数量-1) do
		local 路线坐标X,路线坐标Y,路线坐标Z=取导航坐标("导航路线",i)
		输出信息("*************************")
		输出信息(i)
		输出信息(路线坐标X)
		输出信息(路线坐标Y)
		输出信息(路线坐标Z)
		local jieguo=平面实时移动(路线坐标X,路线坐标Y,路线坐标Z,400)
		跳过动画()
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end
		鼠标右键点击()
		延迟(1000)
		按键加强("w")			
		if jieguo==3 then
			记忆点复活()
			导航寻路(x,y,z)
			return 3 
		end			
		输出信息("=====================")
	end
end
function 快捷寻路(x,y,z)
	local jieguo=平面实时移动(x,y,z,400)
	if jieguo==3 then
		记忆点复活()
		--死亡结果=1
		return 3 
	end		
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")		
end

function 等待过图()

	local state = 0;--记录循环的次数
	while 0~= 取过图状态()  do --等待过图
		state = state + 1;
		if state >= 10 then 
			输出信息("等待进入过图状态超过10秒，跳出循环")
			break;
		end
		延迟(500);
	end
	while 1 ~= 取过图状态()  do --等待过图
		延迟(1000);
	end
	输出信息("过图完成，已到游戏中")
end
	
任务流程={
    {地图名="崩毁的精神幻境"},
}
function 将lua表以json的形式写入文件(filePath,luaTable) 
	if json==0 then
		json = require("json")
	end
    local newJsonString = json.encode(luaTable)
    file = io.open(filePath, "w") -- 只写，删除原来的内容
    if not file then
        return false
    end
    io.output(file)
    io.write(newJsonString)
    io.close(file)
    return true
end

function 写JSON配置()

	local ming=取角色名()
	--输出信息(ming)
	local 文件名1=(ming..'.lua')
	--输出信息(文件名1)
	local 路径1=tostring(获取脚本目录())
	local 完整路径=路径1..文件名1
	输出信息(完整路径)
	local 写入结果 = 将lua表以json的形式写入文件(完整路径,任务流程)--这里创建了lua表，写入一个初始地图名
	if 写入结果 then
		输出信息("写JSON配置成功！")
	else
		输出信息("写JSON配置失败！")
	end
end

function 修改任务流程的JSON配置(filePath, 地图名)--以角色名为路径改写已有的json配置
    -- 判断是否为合法的JSON文件
    local pattern = "[^\\]+%.lua$"
    if not string.match(filePath, pattern) then
        return false
    end
    -- 读取文件中的JSON字符串
    local file = io.open(filePath, "r") -- 只读
    if not file then
        return false
    end
    local jsonString = file:read("*all")
    file:close()

    -- 解析JSON字符串为LUA表并修改时间
	if json==0 then
		 json = require("json")
	end
    local luaTable = json.decode(jsonString)
    local isModified = false
    for i, v in ipairs(luaTable) do
		v.地图名=地图名
		isModified = true
    end
    -- 判断是否已经修改过
    if not isModified then
        return false
    end
    -- 将修改后的LUA表转换成JSON字符串并保存到文件中
    local newJsonString = json.encode(luaTable)
    file = io.open(filePath, "w") -- 只写，删除原来的内容
    if not file then
        return false
    end
    io.output(file)
    io.write(newJsonString)
    io.close(file)
    return true
end

function 改写JSON配置(地图名)

	local ming=取角色名()
	--输出信息(ming)
	local 文件名1=(ming..'.lua')
	--输出信息(文件名1)
	local 路径1=tostring(获取脚本目录())
	local 完整路径=路径1..文件名1
	输出信息(完整路径)
	local 写入结果 = 修改任务流程的JSON配置(完整路径,地图名)--这里创建了lua表，写入一个初始地图名
	if 写入结果 then
		输出信息("改写JSON配置成功！")
	else
		输出信息("改写JSON配置失败！")
	end
end

function 读任务流程的JSON配置(filePath)--以角色名为路径读已有的json配置
    -- 判断是否为合法的JSON文件
    local pattern = "[^\\]+%.lua$"
    if not string.match(filePath, pattern) then
        return false
    end
    -- 读取文件中的JSON字符串
    local file = io.open(filePath, "r") -- 只读
    if not file then
        return false
    end
    local jsonString = file:read("*all")
    file:close()

    -- 解析JSON字符串为LUA表并修改时间
	if json==0 then
		 json = require("json")
	end
    local luaTable = json.decode(jsonString)
    local isModified = false
    for i, v in ipairs(luaTable) do
		return v.地图名
    end
    return "k"
end

function 取配置中的地图名()

	local ming=取角色名()
	--输出信息(ming)
	local 文件名1=(ming..'.lua')
	--输出信息(文件名1)
	local 路径1=tostring(获取脚本目录())
	local 完整路径=路径1..文件名1
	---输出信息(完整路径)
	local 地图名 = 读任务流程的JSON配置(完整路径)--这里创建了lua表，写入一个初始地图名
	输出信息(地图名)
	return 地图名
end


function 开始()

	while  true do	
		延迟(2000)
		if 取地图名() == "崩毁的精神幻境" then
			写JSON配置()--这里是第一步，所以自动填写地图名和角色名即可，不需要参数
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("开始脚本退出挂机流程")
			return
		end	
	end
	
	平面实时移动(-151.303,1689.32,-38.4541,400)
	平面实时移动(-533.698,3254.74,-38.8457,400)
	平面实时移动(-1226.02,4521.77,-78.1146,400)
	平面实时移动(-1982.5,6017.68,-54.1462,400)
	延迟(4000)
	ishave,x,y,z=范围怪判断(1,0,0,0,1000)
	if ishave==1 then
		if 取宠物数量() < 2 then
			使用技能("召唤机械警卫")
			停止技能("召唤机械警卫")
		end
	end
	平面实时移动(-1329.14,6419.43,-74.7681,400)
	ishave,x,y,z=范围怪判断(1,0,0,0,1000)
	if ishave==1 then
		if 取宠物数量() < 2 then
			使用技能("召唤机械警卫")
			停止技能("召唤机械警卫")
		end
	end
	延迟(4000)
	按键(0x44)
	延迟(2000)
	按键(0x44)
	延迟(1000)
	按键(0x4B) --技能更换按键K
	延迟(1000)
	打开技能背包(1,2)
	安装技能("召唤物伤害")--//一个参数，技能名，，前提是用脚本打开了技能背包
	延迟(1000)
	按键(0x4B) --技能更换按键K
	平面实时移动(16.0791,6672.85,-104.473,400)
	平面实时移动(1548.59,6464.78,-75.201,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(2560,6976,-76,400)
	ishave,x,y,z=范围怪判断(1,0,0,0,2000)
	if ishave==1 then
		if 取宠物数量() < 2 then
			使用技能("召唤机械警卫")
			停止技能("召唤机械警卫")
		end
	end
	平面实时移动(3685.16,6458.74,-115.047,400)
	ishave,x,y,z=范围怪判断(1,0,0,0,2000)
	if ishave==1 then
		if 取宠物数量() < 2 then
			使用技能("召唤机械警卫")
			停止技能("召唤机械警卫")
		end
	end
	平面实时移动(3940.41,7769.2,-73.98,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(4177.56,8988,-34.2515,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(3968,9920,30,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(4480.88,9483.36,23.2998,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(3764.82,9463.71,-8.69281,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(3506.84,10393.2,-22.9874,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(3032.43,10916.5,-28.8065,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(2436.94,12185.8,2.30901,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(1824,12864,4,400)
	ishave,x,y,z=范围怪判断(1,0,0,0,2000)
	if ishave==1 then
		if 取宠物数量() < 2 then
			使用技能("召唤机械警卫")
			停止技能("召唤机械警卫")
		end
	end
	平面实时移动(1363.81,13729,-10.0154,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(1161.63,14663.3,-6.45337,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(2204.32,14426.4,-4.14195,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(1344,14656,-8,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(1218.03,13833.8,-10.5219,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(1487.93,13225.8,4.99579,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(1088,14016,-14,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(1360,14944,-8,400)
	平面实时移动(595.304,13286.8,-30.225,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-525.67,12977.7,-58.8244,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-1592.6,13048.2,-0.488159,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-2780.08,13025.2,-35.5504,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-3971.62,12998.2,54.6423,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4537.14,12523.1,-1.91681,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4165.97,12163.6,17.1973,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4687.7,11680.7,-17.002,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4960,12352,-1,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5899.81,12222.7,-3,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5336,11533.9,-12.3485,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4464,11296,-14,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5168,12704,-15,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4241.74,12638.3,12.9453,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4220.33,11589.6,-0.972839,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5574.55,12125.4,0.040802,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5430.48,13954.1,-65.9909,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5120,15360,-48,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4640,15808,-22,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5217.49,17006.5,-62.1831,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")	
	平面实时移动(-4984.26,18217.3,-78.6758,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4238.51,17827.4,-15.7282,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5396.5,17730.5,-27.7968,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5136,18976,-102,400)
	跳过动画()
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-4554.96,17863.1,-61.8235,400)
	跳过动画()
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5248,19520,-116,400)
	跳过动画()
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5812.63,20969.7,-56.3468,400)
	跳过动画()
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-5938,22308,8.12503,400)
	跳过动画()
	平面实时移动(-6919.08,22446.8,8.21152,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-6005.45,21906.4,6,400)
	跳过动画()
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	
	平面实时移动(-5281.25,22567.9,-8.33791,400)
	跳过动画()
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-6174.42,23220.8,8,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	平面实时移动(-6848,22656,-1,400)
	使用技能("召唤机械警卫")
	停止技能("召唤机械警卫")
	延迟(25000)
	跳过动画()
	延迟(3000)	
	等待过图()	
	延迟(4000)	
	

end	
function 前往避难所()
	while  true do	
		延迟(2000)
		if 取地图名() == "余烬之息" then
			改写JSON配置("余烬之息")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("前往避难所脚本退出挂机流程")
			return
		end	
	end	
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-14850,-3850,2122.94},
		{-13546.9,-3891.18,2118.2},
		{-12144.7,-4444.71,2113.78},
		{-11079.7,-5315.02,2360.27},
		{-9746.82,-5343.32,2505.93},
		{-8263.22,-5186.07,2613},
		{-6993.61,-4582.71,2598.36},
		{-5622.67,-4095.53,2611},
		{-4292.42,-3643,2611},
		{-3221.79,-2638.2,2613},
		{-1916.5,-2167.04,2868},
		{-517.699,-1788.28,3091},
		{821.342,-2521.54,3102.9},
		{1934.33,-1593.73,3091.45},
		{3484.77,-1664,3091},
		{4703.4,-1002.51,3091},
		{5376,-832,3095},

	}
	坐标数量=#坐标表	
	延迟(5000)
	平面实时移动(-14442,-3862.17,2123.31,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(7000)
	导航寻路(5376,-832,3095,坐标数量,坐标表)
	延迟(3000)
	while  true do	
		NPC,x,y,z=范围怪判断2(1,0,0,0,"丽芙",2,2000)
		if NPC==1 then
			break
		end	
		实时移动(4920.87,-810.881,3091,400)
		跳过动画()
		ishave,x,y,z=范围怪判断(1,0,0,0,1000)
		if ishave==1 then
			if 取宠物数量() < 2 then
				使用技能("召唤机械警卫")
				停止技能("召唤机械警卫")
			end
		end
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end
		实时移动(4524.51,-1858.93,3091,400)
		跳过动画()
		ishave,x,y,z=范围怪判断(1,0,0,0,1000)
		if ishave==1 then
			if 取宠物数量() < 2 then
				使用技能("召唤机械警卫")
				停止技能("召唤机械警卫")
			end
		end
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end
		实时移动(5078.09,-862.379,3092,400)
		跳过动画()
		ishave,x,y,z=范围怪判断(1,0,0,0,1000)
		if ishave==1 then
			if 取宠物数量() < 2 then
				使用技能("召唤机械警卫")
				停止技能("召唤机械警卫")
			end
		end
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end
		实时移动(5337.33,315.782,3091,400)
		跳过动画()
		ishave,x,y,z=范围怪判断(1,0,0,0,1000)
		if ishave==1 then
			if 取宠物数量() < 2 then
				使用技能("召唤机械警卫")
				停止技能("召唤机械警卫")
			end
		end
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end	
		实时移动(4993.07,-1156.79,3091,400)
		--跳过动画()
		ishave,x,y,z=范围怪判断(1,0,0,0,1000)
		if ishave==1 then
			if 取宠物数量() < 2 then
				使用技能("召唤机械警卫")
				停止技能("召唤机械警卫")
			end
		end
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end
		实时移动(4762.59,-2013.45,3091,400)
		--跳过动画()
		ishave,x,y,z=范围怪判断(1,0,0,0,1000)
		if ishave==1 then
			if 取宠物数量() < 2 then
				使用技能("召唤机械警卫")
				停止技能("召唤机械警卫")
			end
		end
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end
		实时移动(4762.59,-2013.45,3091,400)
		--跳过动画()
		ishave,x,y,z=范围怪判断(1,0,0,0,1000)
		if ishave==1 then
			if 取宠物数量() < 2 then
				使用技能("召唤机械警卫")
				停止技能("召唤机械警卫")
			end
		end
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end
		实时移动(4917.38,-837.38,3091,400)
		--跳过动画()
		ishave,x,y,z=范围怪判断(1,0,0,0,1000)
		if ishave==1 then
			if 取宠物数量() < 2 then
				使用技能("召唤机械警卫")
				停止技能("召唤机械警卫")
			end
		end
		if 取血比例() < 79 then
			使用技能("复合药剂")
		end
		平面实时移动(5065.89,-696.224,3091.88,400)
		跳过动画()
		if 取停止挂机命令()==1 then
			return
		end
	end	
	--动画
	延迟(2000)
	跳过动画()
	延迟(3000)	
	NPC,x,y,z=范围怪判断2(1,0,0,0,"丽芙",2,5000)
	延迟(2000)
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(3000)
	更新技能商店()
	延迟(3000)	
	按键(0x4B) --技能更换按键K
	延迟(2000)
	更新技能商店()
	延迟(3000)		
	打开技能背包(3,1)
	延迟(5000)	
	打开购买技能详情("召唤机械警卫")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(3000)	
	购买技能()--测试可用
	延迟(3000)
	安装技能("召唤机械警卫")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(2000)
	按键(0x4B) --技能更换按键K
	延迟(2000)
	加点()
	平面实时移动(5864.92,-1182.68,3094.04,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	延迟(2000)
	等待过图()		
	延迟(2000)
	跳过动画()
	延迟(3000)	
	while  true do	
		延迟(2000)
		if 取地图名() == "远古通道" then
			改写JSON配置("远古通道")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("觉醒者-脚本退出挂机流程")
			return
		end	
	end	
end		
function 觉醒者()

	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-9067.24,-14552,606},
		{-7599.31,-14543.3,606},
		{-6254.97,-14657.7,606},
		{-4956.8,-14421.7,606},
		{-3894.37,-14110.5,606},
		{-2890.31,-13610.9,606},
		{-2117.25,-12742.7,606},
		{-1207.34,-12191.1,606},
		{-581.426,-11008.2,606},
		{-88.642,-9870.97,606},
		{603.006,-8588.84,606},
		{1472.92,-7810.5,611},
		{2499.68,-7486.48,606},
		{3510.31,-6787.7,610.361},
		{4596.93,-5869.7,606},
		{5169.96,-4786.65,604},
		{5689.74,-3494.07,614.399},
		{5897.83,-2273.76,606},
		{5451.96,-1226.64,608},
		{5761.89,-187.964,602.815},
		{5616,1056,596},
		{4911.79,2151.81,595.122},
		{4271.95,3087.37,604},
		{3272.12,3639.83,606},
		{2509.15,3838.05,606},
		{1417.48,4157.76,607.296},
		{444.647,4248.2,609},
		{-296.67,3936.62,609},
		{-1328.59,3974.21,603.324},
		{-1884.95,4876.19,601},
		{-1898.93,6125.79,602},
		{-1966.88,7487.38,596},
		{-2034.9,8849.09,596},
		{-1576.13,10008.4,600},
	}
	坐标数量=#坐标表
	导航寻路(-1576.13,10008.4,600,坐标数量,坐标表)
	平面实时移动(-644.267,11471.1,598,400)
	平面实时移动(-643.476,11296.7,599,400)
	平面实时移动(168.236,11547.8,656.02,400)
	平面实时移动(236.347,10574.9,816.673,400)
	平面实时移动(-630.096,11301,599,400)		
	function 觉醒者BOSS(模式)

		if 模式==1 then
			延迟(7000)
			平面实时移动(-1563.3,9911.52,599.147,400)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
		end		

		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,15000)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			输出信息("11111111111")
			local jieguo=BOSS寻路(-644.531,11488,598)
			if jieguo==3 then
				觉醒者BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(119.304,11150,692.69)
			if jieguo==3 then
				觉醒者BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-177.32,10492.5,772.431)
			if jieguo==3 then
				觉醒者BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-772.388,10826.3,605.677)
			if jieguo==3 then
				觉醒者BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-510.928,11503.3,608.839)
			if jieguo==3 then
				觉醒者BOSS(1)
				return
			end	
		end	
	end	
	觉醒者BOSS(0)
	平面实时移动(119.81,12912,588.5,400)
	平面实时移动(1316.62,13940.5,591.82,400)
	平面实时移动(1618.16,14984.7,596,400)
	平面实时移动(1769.82,16463.4,596,400)
	平面实时移动(2171.38,17946.9,596,400)
	平面实时移动(2213.21,19242.1,596,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	等待过图()	
	延迟(2000)	
	加点()
end
function 上古战场()
	while  true do	
		延迟(2000)
		if 取地图名() == "上古战场" then
			改写JSON配置("上古战场")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("上古战场-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-12101,6273.3,571},
		{-11953.2,5056.8,571},
		{-11384.2,4335,571},
		{-10358.7,3742.37,574.764},
		{-8817,3590.87,576},
		{-7545.64,3489.97,578.27},
		{-6268.69,3910.93,566},
		{-5210.74,4078.42,566},
		{-4028.17,3791.9,566},
		{-3669.79,2811.34,566},
		{-3104,1920,566},
		{-4167.8,1384.48,566},
		{-5325.41,1604.58,567.491},
		{-5792,2304,571},
		{-6304.4,3422.29,566},
		{-2646.94,4368.64,566},
		{-1756.91,3442.28,566},
		{-1652.36,2672.79,566},
		{-400.793,2893.21,566},
		{947.636,2791.6,566},
		{2024.51,2273.81,566},
		{3347.68,2472.51,566},
		{4649.57,2897.1,566},
		{3391.74,2244.94,566},
		{2853.55,1584.68,566},
		{3265.38,2231.66,566},
		{2711.16,1047.18,566},
		{2716.15,-158.29,566},
		{2237.48,-1161.83,566},
		{1305.09,-1504.4,566},
		{835.936,-1914.44,566},
		{-38.9242,-1809.73,566},
		{-141.522,-1193.86,566},
		{1081.26,-2550.95,610},
		{1197.42,-2959.35,609.24},--2坐标
		{884.949,-1793.34,566},
		{1136,-2784,607},
		{1369.6,-3815.17,616},
		{1653.39,-4858.61,606},
		{2006.9,-5703.21,568.079},
		{2962.85,-5586.29,566},
		{3973.15,-5014.64,566},
		{4970.85,-5420.15,566},
		{5909.94,-6207.4,566},
		{6840.91,-6824.27,566},
		{7921.1,-7003.11,566},
		{9063.27,-7066.03,566},
		{10313.1,-7293.49,566},
		{11372.1,-7298.05,566},
	}
	坐标数量=#坐标表
	导航寻路(3265.38,2231.66,566,坐标数量,坐标表)
	平面实时移动(3661.4,2604.12,566,300)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")		
	平面实时移动(4608.49,3216.97,568,400)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")		
	平面实时移动(4876.49,2609.53,566,400)
	延迟(7000)
	实时移动(5280,2496,566,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	延迟(2000)
	按键(0x44) --按键D
	延迟(3000)
	延迟(2000)
	跳过对话()
	延迟(5000)
	平面实时移动(3661.4,2604.12,566,300)
	导航寻路(1197.42,-2959.35,609.24,坐标数量,坐标表)
	平面实时移动(876.533,-1738.73,566,400)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")		
	平面实时移动(137.005,-1741.89,566,400)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")		
	平面实时移动(700.716,-1095.7,566,400)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")		
	平面实时移动(-79.8122,-1625.16,566,400)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")		
	平面实时移动(1008,-1568,566,400)
	延迟(10000)
	导航寻路(11372.1,-7298.05,566,坐标数量,坐标表)
	延迟(3000)
	function 上古BOSS(模式)
		if 模式==1 then
			延迟(7000)
			平面实时移动(10416.3,-7337.57,566,400)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,15000)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			输出信息("11111111111")
			local jieguo=BOSS寻路(12403,-7157.48,594.276)
			if jieguo==3 then
				上古BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(13396.6,-6815.34,611.99)
			if jieguo==3 then
				上古BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(13032.6,-7465.04,606.629)
			if jieguo==3 then
				上古BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(12066,-7279.85,567)
			if jieguo==3 then
				上古BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(12783.5,-7084.62,608)
			if jieguo==3 then
				上古BOSS(1)
				return
			end			
		end	
	end	
	上古BOSS(0)
	加点()
	ishave,x,y,z=范围怪判断2(1,0,0,0,"科里",2,7000)
	平面实时移动(x,y,z,400)		
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)
	领取任务奖励(1)
	延迟(2000)
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	延迟(1000)
	按键(0x4B) --技能更换按键K
	延迟(1000)
	打开技能背包(2,2)
	安装技能("应急回复")--//一个参数，技能名，，前提是用脚本打开了技能背包
	延迟(1000)
	按键(0x4B) --技能更换按键K	
--打完BOSS遍历 科里对话选着 选着应急回复
	平面实时移动(12408.4,-7171.69,594.058,400)
	平面实时移动(13488.3,-7291.88,600.405,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	等待过图()
	跳过动画()		
end
function 巨墙尽头()
	while  true do	
		延迟(2000)
		if 取地图名() == "对龙巨墙" then
			改写JSON配置("对龙巨墙")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("对龙巨墙-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-1182.31,-25221,92.8683},
		{-822.546,-24239.1,91},
		{-240.654,-23206,91},
		{3.95775,-22176.9,91},
		{313.429,-21219,91},
		{543.042,-19949.5,95.2103},
		{1111.4,-19217.5,91},
		{972.645,-18277.8,91},
		{136.094,-18902.8,91.6772},
		{555.961,-17751.2,95},
		{440.101,-16844.8,91},
		{1272.84,-16048.4,91},
		{2090.26,-15267.7,91.1142},
		{2803.98,-14535,95},
		{2963.66,-13421.8,91},
		{1932.26,-14410.7,94.7172},
		{1056,-14080,91},
		{176.326,-14610.5,94},
		{522.309,-15463.3,94},
		{3006.44,-13055.3,91},
		{3076.37,-12181.3,92},
		{3018.04,-11242.6,91.1861},
		{3020.57,-10318.1,92.3928},
		{2607.34,-9397.83,95.6821},
		{1947.56,-8474.87,86},
		{924.783,-8354.91,86.6005},
		{679.793,-7293.71,86.7207},
		{1407.81,-6711.09,86},
		{2203.42,-7215.02,86},---1
		{2145.4,-6092.05,86},
		{2282.13,-4927.11,86},
		{2244.78,-4019.19,86},
		{3012,-3070.74,82.9606},
		{3671.57,-2179.52,88.9449},
		{4420.46,-1117.72,90},
		{4640.2,-221.969,86},
		{5810.72,74.3799,86},
		{6914.59,549.218,86.9185},
		{7817.4,1410.55,88},
		{7711.28,2721.58,88.4978},
		{7682.87,3578.78,89},
		{7652.5,4635.33,90},
		{7228.74,5849.62,87.1994},
		{6785.16,7044.52,86},
		{7275.22,8245.93,86},
		{7584,9536,86},
		{8432,10336,86},
		{8955.46,11114.6,86},
		{8576.93,11968.8,86},
		{7704.64,13208.1,89.1234},
		{8608.57,13984.2,86},
		{9515.79,13652.4,86},
		{9943.77,12754,86},----2
		{9385.31,12201,86},
		{10357.9,12945.5,86},
		{11218.2,13491.8,86},
		{12136.3,13682.6,86},
		{13030.6,13923.1,86},

	}
	坐标数量=#坐标表
	导航寻路(2203.42,-7215.02,86,坐标数量,坐标表)
	function 炮台1(模式)
		if 模式==1 then
			延迟(5000)
			导航寻路(2203.42,-7215.02,86,坐标数量,坐标表)
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,4000)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			输出信息("11111111111")	
			local jieguo=BOSS寻路(866.276,-8509.14,87)
			if jieguo==3 then
				炮台1(1)
				return
			end				
			local jieguo=BOSS寻路(649.038,-7441.61,87.4425)
			if jieguo==3 then
				炮台1(1)
				return
			end				
			local jieguo=BOSS寻路(1436.43,-6598.22,86)
			if jieguo==3 then
				炮台1(1)
				return
			end				
			local jieguo=BOSS寻路(2034.13,-7558.32,86)
			if jieguo==3 then
				炮台1(1)
				return
			end				
			local jieguo=BOSS寻路(2048,-8640,86)
			if jieguo==3 then
				炮台1(1)
				return
			end								
		end	
	end	
	炮台1(0)
	导航寻路(9943.77,12754,86,坐标数量,坐标表)
	function 炮台2(模式)
		if 模式==1 then
			延迟(5000)
			导航寻路(9943.77,12754,86,坐标数量,坐标表)
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,4000)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			输出信息("11111111111")
			local jieguo=BOSS寻路(8122.02,12269.3,86)
			if jieguo==3 then
				炮台2(1)
				return
			end			
			local jieguo=BOSS寻路(7891.82,13320.7,87)
			if jieguo==3 then
				炮台2(1)
				return
			end			
			local jieguo=BOSS寻路(8532.34,13969.2,86)
			if jieguo==3 then
				炮台2(1)
				return
			end			
			local jieguo=BOSS寻路(9702.99,13202.6,86)
			if jieguo==3 then
				炮台2(1)
				return
			end			
			local jieguo=BOSS寻路(9318.56,12268.2,86)
			if jieguo==3 then
				炮台2(1)
				return
			end			
		end	
	end	
	炮台2(0)
	导航寻路(13030.6,13923.1,86,坐标数量,坐标表)
	实时移动(12977,13855.4,86,400)
	实时移动(14271,13966.6,86,400)
	实时移动(15558,13938.3,86,400)
	实时移动(17438.6,14019.7,90,400)
	实时移动(18856.7,14484.7,107,400)
	实时移动(19554.1,15948.6,92.9545,400)
	实时移动(19514.2,17056,105.681,400)
	实时移动(19473.7,18297.5,101.246,400)
	实时移动(18561.2,18849.8,107.52,400)
	实时移动(17391.8,18946.9,101.908,400)
	实时移动(16429.8,18993.7,102.339,400)
	实时移动(16210.1,18532.7,119.147,400)
	延迟(3000)
	按键(0x44) --按键D
	延迟(4000)	
	if 取血比例() < 80 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")	
	--实时移动(496,4128,2446,400)	
	实时移动(-1088,3008,2446,400)
	if 取血比例() < 80 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")	
	实时移动(-1671.19,4361.1,2454.22,400)
	if 取血比例() < 80 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")	
	实时移动(-693.934,4440.91,2446,400)
	if 取血比例() < 80 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(1000)
	按键加强("w")	
	function 巨墙BOSS(模式)
		if 模式==1 then
			延迟(7000)
			实时移动(16256,18560,119,400)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,15000)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			local jieguo=BOSS寻路(-1361.32,3504.73,2449)
			if jieguo==3 then
				巨墙BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-320.307,3275.71,2446)
			if jieguo==3 then
				巨墙BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-825.498,4694.52,2446)
			if jieguo==3 then
				巨墙BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-1443.33,4268.48,2450)
			if jieguo==3 then
				巨墙BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-7.98657,3484,2446)
			if jieguo==3 then
				巨墙BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-224,4352,2446)
			if jieguo==3 then
				巨墙BOSS(1)
				return
			end					
		end	
	end	
	巨墙BOSS(0)
	延迟(2000)	
	跳过动画()
	延迟(4000)
	加点()
	ishave,x,y,z=范围怪判断2(1,0,0,0,"阿瑞娅",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	平面实时移动(865.24,5059.03,2447.05,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(3000)
	更新技能商店()
	延迟(3000)	
	按键(0x4B) --技能更换按键K
	延迟(2000)
	更新技能商店()
	延迟(3000)		
	打开技能背包(4,1)
	延迟(5000)	
	打开购买技能详情("召唤机械警卫")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(3000)	
	购买技能()--测试可用
	延迟(3000)
	安装技能("召唤机械警卫")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(2000)
	按键(0x4B) --技能更换按键K
	延迟(2000)	
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	平面实时移动(1241.78,-849.804,3093,400)
	平面实时移动(2032,-96,3093,400)
	平面实时移动(2396.17,861.231,3093,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("从长计议")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	平面实时移动(1753.57,-448.986,3093,400)
	平面实时移动(1385.03,-1738.94,3098.45,400)
	平面实时移动(1831.83,-2981.77,3233.78,400)	
	平面实时移动(2256,-3488,3252,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	打开世界关卡("龙骨山脊")
	延迟(2000)
	进入世界关卡()	
	延迟(2000)
	等待过图()
	延迟(2000)	
end
function 龙骨山脊()
	while  true do	
		延迟(2000)
		if 取地图名() == "龙骨山脊" then
			改写JSON配置("龙骨山脊")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("龙骨山脊-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{1844.28,6265.03,1191},
		{1939.9,7195.86,1191},
		{1961.16,8229.58,1191},
		{877.811,8303.07,1191},
		{170.691,8313.41,1191},
		{-512,9088,1191},
		{-1153.25,9749.82,1191},
		{-1839.07,10378.2,1191},
		{-2641.28,10352.8,1195},
		{-3407.16,10042,1191},
		{-4238.88,9380.6,1192},
		{-5227.73,9985.68,1462.07},
		{-6045.16,9682.66,1501},
		{-6733.24,9078.39,1501},
		{-7315.01,9357.1,1501},
		{-8068.16,9507.4,1501},
		{-8687.33,8635.63,1498.38},
		{-9328,8224,1496},
		{-9914.08,7530.05,1580.85},
		{-10904.7,6919.07,1751.89},
		{-11168,6080,1756},
		{-10639.6,5216.84,1748.05},
		{-9908.94,4410.24,1554.64},
		{-9194.81,3646.72,1497},
		{-8692.2,3016.08,1503.24},
		{-7951.23,2274.46,1506.95},
		{-7006.51,1627.53,1496},
		{-6342.83,815.896,1496},
		{-6294.59,-45.6508,1497.43},
		{-6553.26,-1009.47,1506},
		{-6522.63,-1970.81,1496},
		{-5949.72,-2678.05,1496},
		{-5668.15,-3535.01,1496},
		{-5536.67,-4312.81,1496},
		{-6167.61,-5070.68,1516},
		{-6905.14,-5699.02,1496.95},
	}
	坐标数量=#坐标表
	导航寻路(1844.28,6265.03,1191,坐标数量,坐标表)	
	实时移动(3136,4288,1191,400)
	实时移动(2660.68,4844.06,1191,400)
	实时移动(2282.86,3771,1191,400)		
	function 龙骨BOSS(模式)
		if 模式==1 then
			延迟(7000)
			实时移动(1832.42,6221.63,1191,400)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,15000)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			local jieguo=BOSS寻路(3349.9,4972.74,1191)
			if jieguo==3 then
				龙骨BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(2755.93,4261.23,1191)
			if jieguo==3 then
				龙骨BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(2148.67,4715.75,1191)
			if jieguo==3 then
				龙骨BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(3339.91,3978.45,1191)
			if jieguo==3 then
				龙骨BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(3558.78,5209.09,1191)	
			if jieguo==3 then
				龙骨BOSS(1)
				return
			end							
		end	
	end	
	龙骨BOSS(0)	
	加点()
	平面实时移动(4279.64,4464.98,1191,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	等待过图()	
	延迟(2000)
end
function 龙骨平原()
	while  true do	
		延迟(2000)
		if 取地图名() == "龙骨平原" then
			改写JSON配置("龙骨平原")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("龙骨平原-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{8386.91,23649.2,5214},
		{8077.67,22826.8,5214},
		{7986.4,21963.3,5214},
		{7897.14,21090.3,5214},
		{8696.95,20413.2,5214},
		{9131.09,19382.5,5214},
		{10272,18752,5214},
		{11296,18240,5214},
		{12032,17792,5214},
		{12736,17216,5214},
		{12774,16314.8,5214},
		{12280.6,15170.6,5214},
		{11789.8,14172.7,5214},
		{10992,13664,5214},
		{10343.2,12913.7,5214},
		{9687.77,12156,5214},
		{8876.69,11849,5214},
		{8189.96,11901.8,5214},
		{7586.38,11428.5,5214},
		{7190.33,10482,5214},
		{6466.6,9753.08,5214},
		{5741.11,9105.62,5214},
		{5015.59,8458.14,5214},
		{4307.21,7825.39,5214},
		{3870.16,6814.5,5214},
		{3778.69,5797.26,5214},
		{3685.72,4763.24,5214},
		{3383.7,3796.26,5214},
		{2968.54,2816.33,5214},
		{2332.07,1954.91,5214},


	}
	坐标数量=#坐标表
	导航寻路(8386.91,23649.2,5214,坐标数量,坐标表)	
	实时移动(9500,24530,5214,400)
	实时移动(9585,25456.9,5216.47,400)
	实时移动(10067.1,25952.7,5221.09,400)	
	function 高原BOSS(模式)
		if 模式==1 then
			延迟(7000)
			实时移动(8145.18,23298.3,5214,400)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,15000)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			local jieguo=BOSS寻路(9280,25152,5214)
			if jieguo==3 then
				高原BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9843.96,25873.6,5216.78)
			if jieguo==3 then
				高原BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(10000,24800,5214)
			if jieguo==3 then
				高原BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9680,25760,5214)
			if jieguo==3 then
				高原BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9775.57,26615,5229.35)
			if jieguo==3 then
				高原BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9722.15,25696.6,5215)
			if jieguo==3 then
				高原BOSS(1)
				return
			end									
		end	
	end	
	高原BOSS(0)	
	加点()
	延迟(5000)	
	ishave,x,y,z=范围怪判断2(1,0,0,0,"科里",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(3000)	
	领取任务奖励(1)	
	延迟(1000)		
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	平面实时移动(10288,26848,5230,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
end	
function 失落矿洞()
	while  true do	
		延迟(2000)
		if 取地图名() == "失落矿洞" then
			改写JSON配置("失落矿洞")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("失落矿洞-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{11568,2272,-2028},
		{10812.6,1408.82,-1757.83},
		{10378.9,705.194,-1678},
		{9744.73,228.6,-1675},
		{9358.87,-189.747,-1673},
		{8872.42,-709.391,-1672.35},
		{8267.78,-1057.24,-1671.02},
		{7694.42,-1370.69,-1600.38},
		{7244.87,-1941.35,-1513},
		{6699.75,-2306.26,-1504.93},
		{6212.17,-3022.98,-1502.77},
		{5491.37,-3116.65,-1502.7},
		{4780.97,-2837.15,-1352.25},
		{4253.34,-2429.17,-1202.73},
		{3712.98,-2028.26,-1048},
		{3086.51,-1591.17,-1048},
		{2436.14,-1146.93,-1048},
		{1885.05,-661.472,-1048},
		{1800.08,264.935,-1010.6},
		{2450.34,1058.76,-833},
		{2992.5,728.472,-832},
		{3529.1,1506.24,-649.957},
		{3955.03,2320.13,-578},
		{4387.24,3066.49,-578},
		{4316.79,3713.04,-575},
		{3800.39,4319.04,-574.891},
		{3334.03,5050.55,-426.982},
		{2761.41,5490.44,-277.459},
		{2147.77,5998.72,-203},
		{1399.67,6630.94,-203},
		{596.75,6425.71,-203},
		{-129.593,5876.48,-186.64},
		{-635.354,5188.91,-176},
		{-1012.8,4394.13,-163.858},
		{-1544.34,3560.73,-138.273},
		{-2122.54,2889.44,-143},
		{-2933.49,2507.13,-143},
		{-3629.11,2177.06,-141},
		{-4211.67,1947.47,-143},
		{-4859.16,1478.27,-143},
		{-5314.7,780.24,-143},
		{-5687.28,126.729,-143},
		{-6012.24,-797.768,-143},
		{-6145.65,-1332.01,-143},
		{-5327.72,-1663.37,-21.9431},
		{-4411.46,-2122.74,220},
		{-4132.32,-2929.45,217},
		{-4550.53,-3764.23,217},
		{-4948.03,-4720.56,266.357},
		{-5276.21,-5710.01,559.834},
		{-5464.81,-6548.1,572},
		{-4706.17,-7132.08,572},
		{-3930.67,-7590.76,572},
		{-3263.9,-7943.95,572},
	}
	坐标数量=#坐标表
	导航寻路(11568,2272,-2028,坐标数量,坐标表)	
	实时移动(12827.3,4168.61,-2095.73,400)
	实时移动(13377.1,4797.48,-2099,400)
	实时移动(12672,4672,-2095,400)
	function 地魔BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(11568,2272,-2028,坐标数量,坐标表)	
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,15000)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			local jieguo=BOSS寻路(12720,3872,-2097)
			if jieguo==3 then
				地魔BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(12983,4619.81,-2094.72)
			if jieguo==3 then
				地魔BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(13810.9,4330.91,-2096)
			if jieguo==3 then
				地魔BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(13945.6,5542.5,-2106.2)
			if jieguo==3 then
				地魔BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(13387.1,4883.74,-2100.62)
			if jieguo==3 then
				地魔BOSS(1)
				return
			end												
		end	
	end	
	地魔BOSS(0)	
	加点()
	延迟(5000)		
	实时移动(13651.6,5799.21,-2115.23,400)
	实时移动(13143.5,6255.21,-2081.24,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
end	
function 国王甬道()
	while  true do	
		延迟(2000)
		if 取地图名() == "国王甬道" then
			改写JSON配置("国王甬道")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("国王甬道-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-5610.39,7388.8,-341},
		{-6056.31,6995.42,-346},
		{-6587.78,6598.66,-346},
		{-7410.53,6774.55,-346},
		{-6963.28,5708.42,-346},
		{-6154.97,5223.1,-346},
		{-5446.9,4780.27,-344},
		{-4821.4,4388.94,-218.46},
		{-4064.22,3838.33,-191},
		{-3445.57,3154,-191},
		{-3085.7,2496.4,-191},
		{-2978.47,1688,-191},
		{-3791.67,1149.33,-229.063},
		{-4582.67,873.972,-476.553},
		{-4984.8,15.1602,-481},
		{-5489.06,-942.024,-657.091},
		{-6269.67,-1073.52,-821},
		{-7087.51,-889.415,-832.939},
		{-7751.1,-830.463,-985.75},
		{-8174.96,-1357.91,-1116},
		{-7892.14,-2126.3,-1116},
		{-7472,-2976,-1116},
		{-6856.51,-3715.31,-1116},
		{-6057.63,-4154.12,-1131.91},
		{-5428.39,-4486.35,-1357.88},
		{-4659.54,-4909.15,-1401},
		{-3841.35,-5318.84,-1401},
		{-3157.18,-5705.43,-1401},
		{-2102.05,-6262.38,-1401},
		{-1051.13,-6134.72,-1401},
		{-318.61,-5481.18,-1517.31},
		{171.571,-4397.83,-1666},
		{1184.23,-3790.37,-1666},
		{1895.68,-3460.19,-1666},
		{2681.85,-2925.7,-1696},--1
		{2681.85,-2925.7,-2809},
		{3396.47,-2555.32,-2987.21},
		{4008.03,-2024.76,-3150.3},
		{4544,-1408,-3346},
		{4806.69,-649.549,-3346},
		{5634.11,-1212.04,-3339.06},

	}
	坐标数量=#坐标表
	导航寻路(2681.85,-2925.7,-1696,坐标数量,坐标表)	
	延迟(3000)
	按键(0x44) --按键D
	延迟(5000)	
	导航寻路(5634.11,-1212.04,-3339.06,坐标数量,坐标表)	
	实时移动(6182.96,-2103.25,-3106,400)
	实时移动(7203.22,-2337.56,-3106,400)
	实时移动(8292.99,-2635.12,-3106,400)
	function 机甲BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(5634.11,-1212.04,-3339.06,坐标数量,坐标表)	
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,2900)
			if NPC==0 then
				break
			end	
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "卡兹萨恩之心" then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end				
			local jieguo=BOSS寻路(7617,-2318,-3106)
			if jieguo==3 then
				机甲BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(6814.84,-2085.96,-3106)
			if jieguo==3 then
				机甲BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(7882.44,-2713.26,-3106)
			if jieguo==3 then
				机甲BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8226.92,-1976.92,-3104.22)
			if jieguo==3 then
				机甲BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(7312,-2784,-3106)
			if jieguo==3 then
				机甲BOSS(1)
				return
			end		
			local jieguo=BOSS寻路(7966.54,-3293.58,-3106)
			if jieguo==3 then
				机甲BOSS(1)
				return
			end												
		end	
	end	
	机甲BOSS(0)	
	加点()
	延迟(5000)	
	机甲BOSS(0)	
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	实时移动(8422.8,-2180.73,-3106,400)
	实时移动(9100.34,-1808.11,-3111,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
end	
function 卡兹萨恩之心()--关注一下这个函数的地图名
	while  true do	
		延迟(2000)
		if 取地图名() == "卡兹萨恩之心" then
			改写JSON配置("卡兹萨恩之心")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("卡兹萨恩之心-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-4454.55,-13221.5,1557},
		{-4652.37,-12791,1557},
		{-4851.15,-12118.7,1557},
		{-4990.46,-11247.6,1557},
		{-4619.13,-10314.5,1557},
		{-4200.14,-9479.54,1557},
		{-3676.99,-8798.61,1557},
		{-3145.02,-7983.91,1557},
		{-2412.32,-7369.83,1855.69},
		{-1886.15,-6451.26,1862},
		{-1321.49,-5438.23,1862},
		{-2095.8,-4837.32,1552},
		{-1683.18,-4237.76,1552},
		{-2454.13,-3815.71,1350.22},
		{-3208.62,-3289.65,1347},
		{-3847.38,-2606.01,1347},
		{-3408,-1696,1325},
		{-3008,-960,1167},
		{-2410.38,-398.112,1167},
		{-1827.47,481.313,1167},
		{-1279.59,1088.09,1167},
		{-756.433,1900.22,1167},
		{-1180.48,2860.16,1167},
		{-421.899,3333.08,1167},
		{-1258.43,3723.92,1165.49},
		{-1659.4,4170.97,1146},--1
		{-1659.4,4170.97,-379},
		{-1424,4896,-417},
		{-786.998,5458.69,-417},
		{-448,6528,-415},
		{29.1968,7427.5,-417},
		{1222.03,7896.97,-417},
		{1992.09,8530.15,-417},
		{1942.73,9690.19,-417},
		{2092.23,10878.9,-417},
		{2381.37,11662.2,-417},--2
		{3066.81,12406.9,-417},
		{3726.01,12992.1,-279.801},
		{4349.35,13654.2,-40.6306},
		{4515.69,13988,57.8167},--3

	}
	坐标数量=#坐标表
	function 小BOSS2(模式)	
		if 模式==1 then
			延迟(5000)
			导航寻路(2381.37,11662.2,-417,坐标数量,坐标表)
			延迟(3000)
		end		
		local 计次=0
		while  true do			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end	
			计次=计次+1
			if 计次 < 3 then						
				local jieguo=BOSS寻路(3041.98,11787.7,-417)
				if jieguo==3 then
					小BOSS2(1)
					return
				end			
				local jieguo=BOSS寻路(2368,11968,-417)
				if jieguo==3 then
					小BOSS2(1)
					return
				end			
				local jieguo=BOSS寻路(2417.08,11153.3,-417)
				if jieguo==3 then
					小BOSS2(1)
					return
				end			
				local jieguo=BOSS寻路(1821.99,11620.8,-417)
				if jieguo==3 then
					小BOSS2(1)
					return
				end			
				local jieguo=BOSS寻路(2561.55,12169,-417)	
				if jieguo==3 then
					小BOSS2(1)
					return
				end	
			else
				break
			end					
		end													
	end	

	function 小BOSS(模式)
		local 计次=0
		if 模式==1 then
			延迟(5000)
			导航寻路(2381.37,11662.2,-417,坐标数量,坐标表)
			延迟(3000)
		end		
		while  true do			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end	
			计次=计次+1
			if 计次 < 3 then				
				local jieguo=BOSS寻路(-959.186,3191.59,1167)
				if jieguo==3 then
					小BOSS(1)
					return
				end				
				local jieguo=BOSS寻路(-588.753,2784.42,1167)
				if jieguo==3 then
					小BOSS(1)
					return
				end				
				local jieguo=BOSS寻路(-599.136,3814.96,1167)
				if jieguo==3 then
					小BOSS(1)
					return
				end				
				local jieguo=BOSS寻路(-1008,3232,1167)
				if jieguo==3 then
					小BOSS(1)
					return
				end									
			else
				break				
			end													
		end	
	end	
	导航寻路(-421.899,3333.08,1167,坐标数量,坐标表)
	小BOSS()	
	导航寻路(-1659.4,4170.97,1146,坐标数量,坐标表)		
	延迟(3000)
	按键(0x44) --按键D
	延迟(5000)	
	导航寻路(2381.37,11662.2,-417,坐标数量,坐标表)	
	小BOSS2()
	导航寻路(4515.69,13988,57.8167,坐标数量,坐标表)
	实时移动(4664.7,14008.7,84.9469,400)
	跳过动画()
	实时移动(7363.41,17169.2,812,400)
	跳过动画()
	实时移动(7157.67,17385.7,812,400)
	跳过动画()
	实时移动(7408,16864,812,400)
	跳过动画()
	实时移动(6704,17376,812,400)	
	function 矮人王BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(4515.69,13988,57.8167,坐标数量,坐标表)	
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,4900)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end				
		
			local jieguo=BOSS寻路(7451.2,17193.2,812)
			if jieguo==3 then
				矮人王BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8204.67,16536,812)
			if jieguo==3 then
				矮人王BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8538.8,17245.2,812)
			if jieguo==3 then
				矮人王BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(7794.96,17736.3,812)
			if jieguo==3 then
				矮人王BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(6881.31,17288.3,812)
			if jieguo==3 then
				矮人王BOSS(1)
				return
			end												
		end	
	end	
	矮人王BOSS(0)	
	跳过动画()
	加点()
	延迟(5000)	
	ishave,x,y,z=范围怪判断2(1,0,0,0,"科里",2,7000)
	平面实时移动(x,y,z,400)		
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(10000)
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	实时移动(8002.41,17790.7,812,400)
	实时移动(8752.95,18701.2,812,400)
	实时移动(9625.35,19570.3,812,400)
	实时移动(10299.5,20433.2,812,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
end	
function 荒芜山道()
	while  true do	
		延迟(2000)
		if 取地图名() == "荒芜山道" then
			改写JSON配置("荒芜山道")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("荒芜山道-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{15526.1,20037.6,5453},
		{15799.3,19290,5453},
		{16647.8,18727.9,5453},
		{17402.3,18451.9,5453},
		{17975.3,17480.3,5453},
		{18340.2,16534.8,5453},
		{18702.6,15578.1,5453},
		{19060.7,14631.8,5453},
		{19433,13782.8,5453},
		{19809.3,12924.9,5453},
		{20181.3,12042.9,5453},
		{20635.4,11212.5,5453},
		{21488,10528,5453},
		{22350.6,10626.2,5453},
		{23194.3,10894.7,5453},
		{23869.4,11141.2,5453},
		{24283.3,11233.1,5453},
	}
	坐标数量=#坐标表
	延迟(3000)	
	按键(0x4B) --技能更换按键K
	延迟(2000)
	更新技能商店()
	延迟(3000)		
	打开技能背包(5,1)
	延迟(5000)	
	打开购买技能详情("黑暗之门")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(3000)	
	购买技能()--测试可用
	延迟(3000)
	安装技能("黑暗之门")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(2000)
	按键(0x4B) --技能更换按键K
	延迟(2000)	
	导航寻路(24283.3,11233.1,5453,坐标数量,坐标表)
	实时移动(25150,12320,5453,400)
	实时移动(25213.2,12896.5,5453,400)
	实时移动(25904.2,12543.2,5453,400)		
	function 长角BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(24283.3,11233.1,5453,坐标数量,坐标表)	
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,4900)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end				
			local jieguo=BOSS寻路(25904.2,12543.2,5453)
			if jieguo==3 then
				长角BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(25290,12813.6,5453)
			if jieguo==3 then
				长角BOSS(1)
				return
			end	
			local jieguo=BOSS寻路(25092.2,11988.8,5453)
			if jieguo==3 then
				长角BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(25894.6,13261,5453)
			if jieguo==3 then
				长角BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(25388.5,13064.4,5453)
			if jieguo==3 then
				长角BOSS(1)
				return
			end												
		end	
	end	
	长角BOSS(0)	
	跳过动画()
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	延迟(5000)	
	ishave,x,y,z=范围怪判断2(1,0,0,0,"苏玛",2,7000)
	平面实时移动(x,y,z,400)		
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)
	延迟(2000)
	领取任务奖励(1)
	延迟(7000)	
	实时移动(26823.4,13886.8,5430.23,400)
	实时移动(27036.9,14180.6,5247.6,400)
	实时移动(27424,14720,5188,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(4000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
end	
function 马内拉雨林()
	while  true do	
		延迟(2000)
		if 取地图名() == "马内拉雨林" then
			改写JSON配置("马内拉雨林")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("马内拉雨林-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{1817.98,2383.75,920},
		{2157.12,2835.03,920},
		{2448.57,3452.65,920},
		{3220.07,3714.45,920},
		{3808,4416,920},
		{4371.21,5043.29,920},
		{4792.55,5666.26,920},
		{5527.02,6395.91,920},
		{6697.12,6576.76,920},
		{7552,7424,920},
		{8582.79,7941.02,920},
		{9787.91,8589.98,920},
		{11045.6,9169.04,920},
		{11819.8,8886.98,920},
		{12611.5,8576.42,920},
		{13389.8,8930.61,924},
		{13754.7,9644.7,1010},
		{14279.6,10457.7,961.804},
		{14336,11200,920},
		{15240.8,11870.6,920},
		{15854.9,12743.6,920},
		{15825,13686.8,920},
		{16013.5,14752.3,920},
		{16460,15731.3,920},
		{16878,16678.4,920},
		{16656.3,17272.3,920},
		{15873.4,16845.2,920},
		{15205.5,17496.6,920},
		{15976.3,16950.4,920},
		{16844.4,17207.6,920},
		{17349.6,17753.9,920},
		{17692.3,18597,920},
	}
	坐标数量=#坐标表
	延迟(3000)	
	按键(0x4B) --技能更换按键K
	延迟(2000)
	更新技能商店()
	延迟(3000)		
	打开技能背包(3,2)
	延迟(5000)	
	打开购买技能详情("狂热之军")--测试可用- 当前接口必须打开【技能背包】后使用
	延迟(3000)	
	购买技能()--测试可用
	延迟(3000)
	安装技能("狂热之军")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	延迟(2000)
	按键(0x4B) --技能更换按键K
	延迟(2000)	
	导航寻路(17692.3,18597,920,坐标数量,坐标表)
	实时移动(18464,19584,920,400)
	实时移动(18587.3,20479.6,920,400)
	实时移动(19300.2,20666.9,920,400)

	function 蠕虫BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(17692.3,18597,920,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,4900)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end						
			local jieguo=BOSS寻路(18880,20608,920)
			if jieguo==3 then
				蠕虫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(19288.1,19810.8,920)
			if jieguo==3 then
				蠕虫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(18522.2,20566.5,920)
			if jieguo==3 then
				蠕虫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(18928,21408,920)
			if jieguo==3 then
				蠕虫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(19315.8,20544,920)
			if jieguo==3 then
				蠕虫BOSS(1)
				return
			end															
		end	
	end	
	蠕虫BOSS(0)	
	跳过动画()
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	延迟(5000)		
	实时移动(19361.9,21087.1,920,400)
	实时移动(19841.2,21478.5,920,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(7000)
	实时移动(20825.8,21879.6,920,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
end	
function 溪地虫谷()
	while  true do	
		延迟(2000)
		if 取地图名() == "溪地虫谷" then
			改写JSON配置("溪地虫谷")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("溪地虫谷-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{1663.08,1600.19,1011},
		{2440.6,2087.43,1011},
		{3041,2609.19,1011},
		{3202.75,3655.84,1011},
		{2934.09,4376.31,1011},
		{2715.38,5108.17,1011},
		{3442.02,5689.99,1011},
		{4348.51,5694.55,1011},
		{5110.4,5697.66,1011},
		{5939.88,5665.32,1011},--111
		{5795.91,6306.51,1011},
		{5554.37,6953.09,1011},
		{5403.44,7774.89,1011},
		{6429.68,8758.67,1011},
		{7395.64,8480.31,1011},
		{8294.02,7932.29,1011},
		{8572.97,7133.86,1011},
		{8808.18,6489.11,1011},
		{9216,6016,1011},
		{10028.4,5585.2,1011},
		{10720,5184,1011},
		{11612.9,5076.53,1011},
		{12547,4955.04,1011},
		{13536,5632,1011},
		{14464,5376,1011},
		{15269.5,4962.94,1011},
		{15696,5792,1011},
		{16496,6368,1011},
		{17347.1,6565.8,1011},
		{18037.9,7252.53,1011},
		{18569.4,7860.52,1011},
		{19091.2,8605.47,1011},
		{19276.9,14262.7,1011},
		{19487,9503.29,1011},
		{19876.3,10148.8,1011},
		{20246.8,10859.7,1011},
		{19690.9,11570.2,1011},
		{19132.3,12079.9,1011},
		{18960.8,12755.4,1011},
		{19197.2,13579.8,1011},
		{19280,14496,1011},
		{18686,14684.3,1011},
		{18149.2,14435.4,1011},
		{17634.8,14137,1011},
		{17104,14048,1011},
		{16565.5,14317.3,1011},
		{15982.3,14825.8,1011},
		{15960.6,15636.2,1011},
		{16627.9,16540,1011},
		{17374.5,17082.6,1011},
		{17528.1,17922.4,1011},
		{17164.8,18714.1,1011},
		{17767.3,19674.1,1011},
		{18384.3,20593.1,1011},
		{18759.7,21345.8,1011},
		{18688,22080,1011},
		{18965.1,23006.4,1011},
		{18508,23557.6,1011},
		{18044.7,24116,1011},
		{17488,24480,1011},
		{16769.3,24673.6,1011},
		{16134.2,24757.8,1011},
		{15506.1,24457.4,1011},
		{14965.2,23902.8,1011},
		{14391.3,23294,1011},
		{13776,23072,1011},
		{14198.8,23818.3,1011},
		{14646.8,23651.3,1011},
		{14894.9,23373.8,1011},
		{15790.4,21802.6,1011},
		{15595.1,22696.5,1011},
		{15210.4,23412.3,1011},
		{15668.6,24490.2,1011},
		{16655.9,24713,1011},
		{17461.7,24513,1011},
		{17984,24128,1011},
		{18520.5,23789.2,1011},
		{18974.6,23151,1011},
		{18973,22360.8,1011},
		{18741.2,21462.6,1011},
		{18863.5,20582,1011},
		{18270.8,20176.6,1011},
		{17716.9,19333.3,1011},
		{17709.5,18447.3,1011},
		{18238.5,17903.9,1011},
		{19017.5,17599.6,1011},
		{19902.6,18014.5,1011},
		{20712.2,18651,1011},
		{21819.7,19058.4,1011},
		{22706.1,19442.8,1011},

	}
	坐标数量=#坐标表
	导航寻路(5939.88,5665.32,1011,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	导航寻路(19276.9,14262.7,1011,坐标数量,坐标表)
	导航寻路(14894.9,23373.8,1011,坐标数量,坐标表)
	实时移动(15599.9,22676.4,1011,400)
	实时移动(15759.6,22094.1,1011,400)
	实时移动(15872,21504,1011,400)
	function 毒尾蝶BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(14894.9,23373.8,1011,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		local 计次=0	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,4900)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end	
			local nihao =已接任务ID判断(0x10f7c7)---参数为任务ID，成功返回1 --在控制台脚本工具中查看任务ID
			if nihao == 1 then
				break
			end	
			计次=计次+1
			if 计次 < 11 then								
			local jieguo=BOSS寻路(15842,22478,1011)
			if jieguo==3 then
				毒尾蝶BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(15916.5,21854.7,1011)
			if jieguo==3 then
				毒尾蝶BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(15567.5,21312.5,1011)
			if jieguo==3 then
				毒尾蝶BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(15765,22136.5,1011)
			if jieguo==3 then
				毒尾蝶BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(16403.4,22601.6,1011)
			if jieguo==3 then
				毒尾蝶BOSS(1)
				return
			end	
			else
				break	
			end																	
		end	
	end	
	毒尾蝶BOSS(0)	
	跳过动画()
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	延迟(5000)		
	导航寻路(22706.1,19442.8,1011,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
end
function 阴翳之地()
	while  true do	
		延迟(2000)
		if 取地图名() == "阴翳之地" then
			改写JSON配置("阴翳之地")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("阴翳之地-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{2256,2528,1636},
		{2957.41,2849.42,1636},
		{3657.41,2849.42,1636},
		{4248.53,2418.3,1636},
		{5068.52,2418.3,1636},
		{5643.07,2163.74,1636},
		{6422.06,2004.75,1636},
		{7403.47,2146.17,1636},
		{8309.06,2301.72,1636},
		{8854.83,2414.86,1636},
		{9404.65,2567.37,1636},
		{9863.56,2886.28,1636},
		{10373.3,3096.05,1636},
		{10840.1,3422.78,1636},
		{13501.4,6418.3,1636},
		{13952.5,6775.21,1636},
		{14244.5,7267.25,1636},
		{15028.6,7551.33,1636},
		{15491.1,7893.85,1673.51},
		{15727.5,8391.97,1721},
		{16141.3,8805.74,1721},
		{16572.7,9237.16,1640.17},
		{17220.4,9548.9,1636},
		{17445.2,9729.69,1636},
		{17912.6,10317.1,1636},
		{18398.4,10588.1,1636},
		{18996.8,10588.1,1636},
		{19481.3,10310.5,1636},
		{20254.9,10008.3,1640},
		{20482.4,9909.32,1656.32},--1
		{19957.3,10294.4,1636},
		{19667.4,10333.6,1636},
		{18892.2,10619.5,1636},
		{18807.1,11184.7,1636},
		{18673.8,11668.8,1636},
		{18541.8,12166.7,1636},
		{18442.8,12731,1636},
		{18315.5,13578.5,1636},
		{18202.4,14132.2,1636},
		{18185.1,14729.5,1636},
		{17944.4,15230.2,1636},
		{17947.8,16067.4,1636},
		{17947.8,16380.9,1636},
		{18032.7,16931.6,1636},
		{18032.7,17530.3,1636},
		{17770,18015.7,1636},
		{17495.3,18504.1,1636},
		{17426,19285.9,1636},
		{17382.2,19866.5,1636},
		{16924.9,20150.2,1636},
		{15618.9,20394.2,1636},
		{15161.6,20388.9,1636},
		{15059.5,19820.8,1636},
		{14930.6,18977.9,1636},
		{16504.7,18781.5,1636},
		{15778.7,18721.4,1636},
		{16274.5,18692.1,1636},
		{16929.5,19087.1,1636},
		{17086,20133.3,1636},
		{17355.7,20283.9,1636},
		{17728.9,20196.6,1636},
		{17866,18765.9,1636},
		{17599.4,18459.2,1636},
		{18127.8,18039.8,1636},
		{18734.6,18362.3,1636},
		{19286,18733.7,1636},
		{19706.9,19274.6,1636},
		{20003.9,19591.6,1640.89},
		{20197.2,19712.7,1659.47},--2
		{19676.7,19162.3,1636},
		{19483.1,18708.8,1636},
		{19017.8,18403.4,1636},
		{17893.8,18195.2,1636},
		{17344.7,18280.1,1636},
		{17056,18288.9,1636},
		{16562.6,18181.1,1636},
		{16057.1,17929.8,1636},
		{15456.7,17926.5,1636},
		{14964.1,17689.1,1636},
		{14288.4,17153.4,1636},
		{14170.6,16890.5,1636},
		{13698.5,16716.6,1636},
		{13420.9,16787.3,1636},
		{13095.8,16832.5,1636},
		{12592.9,16933.9,1636},
		{11880.7,17264.7,1636},
		{11208.7,17647,1636},
		{11149.1,17912.6,1636},
		{11149.1,18336.6,1636},
		{11149.1,18927.7,1636},
		{11149.1,19217.5,1636},
		{11389.5,20226.9,1653.18},--3
		{10944,19648,1636},
		{10944,19156.2,1636},
		{10944,18678.2,1636},
		{10944,18091.9,1636},
		{10944,17192.1,1636},
		{10944,16488,1636.63},
		{10324,16505.2,1640},
		{9781.29,15859.1,1711},
		{9508.68,15789.9,1712},
		{8859.38,15180.6,1692.55},
		{8422.03,14778.6,1645},
		{8078.66,14119.8,1641.96},
		{7590.91,13852.1,1641},
		{6892.83,13369,1641},
		{6178.81,12940,1641},
		{5541.91,12303.1,1641},
		{5056.46,12223.4,1641},
		{4599.05,12720.3,1641},
		{4270.71,12722.8,1641},
		{3519.88,12584.1,1641},
		{2816.76,12270.7,1641},
		{2423.07,11537,1641},
		{2278.96,10995.2,1641},
		{2278.96,10030.1,1641},
		{2462.8,9375.35,1641},
		{2462.81,8775.95,1641},
		{2462.81,7985.66,1641},
		{2462.81,7097.46,1641},
		{2462.81,6511.12,1641},
		{2345.76,6234.07,1641},
		{1975.12,5640.52,1641},
		{2105.36,4913.19,1641},
		{2374.01,4264.54,1637.58},
		{2801.35,3617.21,1636},
		{3585.65,3815.53,1636},
		{4326.29,4536.16,1433.14},
		{4922.26,4952.14,1242.09},
		{5332.38,5462.25,1231},
		{5704.51,5834.38,1231},
		{6165.54,6155.42,1231},
		{6425.33,6515.21,1231},

	}
	坐标数量=#坐标表
	function 判断周围怪()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,1800)
			if NPC==0 then
				break
			end	
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end	
			计次=计次+1
			if 计次 < 10 then			
				if 取血比例() < 79 then
					使用技能("复合药剂")
				end
				鼠标右键点击()
				延迟(800)
				按键加强("w")	
				延迟(800)
				按键加强("e")	
			else
				break				
			end				
		end	
	end		
	导航寻路(20482.4,9909.32,1656.32,坐标数量,坐标表)
	判断周围怪()
	延迟(2000)
	按键(0x44) --按键D要判断完成任务
	延迟(4000)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)			
	导航寻路(20197.2,19712.7,1659.47,坐标数量,坐标表)
	判断周围怪()
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)		
	导航寻路(11389.5,20226.9,1653.18,坐标数量,坐标表)
	判断周围怪()
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)		
	导航寻路(6425.33,6515.21,1231,坐标数量,坐标表)
	实时移动(7499.89,7509.77,1231,400)
	实时移动(7798.38,8457.6,1231,400)
	实时移动(8790,9289.05,1231,400)
	function 丽芙BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(6425.33,6515.21,1231,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end											
			local jieguo=BOSS寻路(8790,9289.05,1231)
			if jieguo==3 then
				丽芙BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(8752,8480,1231)
			if jieguo==3 then
				丽芙BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(9340.36,9886.18,1231)
			if jieguo==3 then
				丽芙BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(8240.88,9005.2,1231)
			if jieguo==3 then
				丽芙BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(8520,8111.38,1231)
			if jieguo==3 then
				丽芙BOSS(1)
				return
			end																				
		end	
	end	
	丽芙BOSS(0)	
	跳过动画()
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	延迟(5000)		
	实时移动(10028.5,9825.11,1231,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(10000)
	ishave,x,y,z=范围怪判断2(1,0,0,0,"阿瑞娅",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	实时移动(10437.6,10462.2,1280,400)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)	
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
	ishave,x,y,z=范围怪判断2(1,0,0,0,"阿瑞娅",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	ishave,x,y,z=范围怪判断2(1,0,0,0,"莫琳娜",2,7000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("长夜终尽")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)
	延迟(2000)
	按键(0x4B) --技能更换按键K
	延迟(1000)
	打开技能背包(4,2)
	安装技能("机械改造")--//一个参数，技能名，，前提是用脚本打开了技能背包
	延迟(1000)
	按键(0x4B) --技能更换按键K		
	实时移动(2070.08,-1060.41,3093,400)
	实时移动(1917.29,-224.948,3093,400)
	实时移动(1624.03,868.31,3093,400)
	实时移动(694.362,1557.98,3085.83,400)
	实时移动(302.42,2329.91,2932.18,400)
	实时移动(-168.298,2940.63,2858,400)
	实时移动(-1000.66,3035.44,2858.46,400)
	跳过动画()
	实时移动(-2500.75,3035.44,2862.07,400)
	跳过动画()
	实时移动(-3615.44,3225.45,2881.06,400)
	跳过动画()
	实时移动(-3728.58,3778.58,2864.92,400)
	跳过动画()
	延迟(5000)
	ishave,x,y,z=范围怪判断2(1,0,0,0,"罗梅尔",2,7000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	实时移动(-3341.65,3104.33,2874.95,400)
	实时移动(-2123.7,3061.9,2861.32,400)
	实时移动(-1079.24,3061.9,2858.68,400)
	实时移动(216.305,3217.46,2858,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	跳过动画()	
	延迟(3000)		
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
end	
function 荣耀广场()
	while  true do	
		延迟(2000)
		if 取地图名() == "荣耀广场" then
			改写JSON配置("荣耀广场")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("荣耀广场-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-11733.3,-344.064,-670},
		{-11265.2,-566.477,-670},
		{-10520.8,-517.687,-670},
		{-9688.07,-533.95,-670},
		{-9342.63,-533.95,-670},
		{-8936.41,-826.574,-670},
		{-8140.2,-1406.59,-670},
		{-7666.41,-1843.58,-670},
		{-6940.58,-2569.41,-670},
		{-6737.88,-2772.11,-670},
		{-6330.71,-3332.39,-670},--1
		{-6692.36,-2874.82,-670},
		{-6724.88,-2258.41,-670},
		{-6741.15,-1299.94,-670},
		{-6741.15,-632.4,-670},
		{-6741.15,45.1241,-670},
		{-6741.15,692.718,-670},
		{-6741.15,1333.25,-670},
		{-6726.64,2018.19,-670},
		{-6627.3,2668.7,-670},
		{-6627.3,3357.97,-670},
		{-6565.53,4019.51,-670},
		{-6422.76,4277.35,-670},--2
		{-7162.18,4785.94,-670},
		{-6194.69,5073.67,-670},
		{-5433.64,5059.59,-670},
		{-4866.97,4758.87,-669.45},
		{-4286.44,4490.38,-560.95},
		{-3676.9,4255.75,-381},
		{-3154.14,4230.17,-381},
		{-2616.01,3858.65,-381},
		{-2129.56,3372.2,-381},
		{-2090.93,2268.61,-381},
		{-1777.67,2138.5,-355.625},
		{-1160.93,1959.6,-128.332},
		{-562.387,1903.93,1.80354},
		{-594.913,1157.91,213.815},
		{21.7745,598.287,214},
		{398.881,221.18,214},
		{1043.54,-62.2846,214},
		{1492.16,-119.56,214},
		{2283.69,63.72,214},
		{2822.32,6.44484,214},--3
		{2160.25,201.604,214},
		{2092.54,1029.55,214.913},
		{2934.24,1119.28,431.118},
		{3441.66,1005.44,479.002},
		{4232.53,924.124,609},
		{4757.13,399.524,609},
		{5374.19,198.641,655.406},
		{5990.09,122.274,840.904},
		{6539.11,122.274,1025.03},
		{7359.58,128.508,1110.99},
		{7755.41,55.0998,1181.99},
		{8430.36,38.8365,1323.91},--4
		{7452.05,120.153,1112.88},
		{6351.83,152.679,963.056},
		{5513.47,185.206,687.854},
		{5043.62,274.603,609},
		{4101.39,940.838,609},
		{3246.76,1128.48,472.094},
		{2066.68,1209.79,214},
		{1728.3,1634.95,214},
		{1663.24,2259.56,214},
		{1565.66,3073.43,214},
		{1403.03,3892.19,214},
		{1386.77,4460.45,217},
		{1337.98,5107.24,345.017},
		{1354.24,5640.66,492.726},
		{878.606,6116.29,499},
		{793.919,6728.1,499},
		{703.71,7625.17,499},
		{1224.14,8375.6,499},
	}
	坐标数量=#坐标表
	导航寻路(-6330.71,-3332.39,-670,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	导航寻路(-6422.76,4277.35,-670,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	导航寻路(-6422.76,4277.35,-670,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	导航寻路(2822.32,6.44484,214,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	导航寻路(2822.32,6.44484,214,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(4000)		
	导航寻路(8430.36,38.8365,1323.91,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	导航寻路(1224.14,8375.6,499,坐标数量,坐标表)
	加点()		
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)
	实时移动(-7071.06,-3215.06,507,400)
	实时移动(-6908.05,-2250.51,507,400)
	实时移动(-6341.21,-1956.22,507,400)
	实时移动(-5373.95,-1791.69,507,400)
	实时移动(-4687.05,-1791.69,507,400)
	实时移动(-3352.44,-1677.85,507,400)
	实时移动(-2661.94,-1677.85,507,400)
	实时移动(-2252.77,-988.237,507,400)
	实时移动(-2147.06,-338.042,507,400)
	实时移动(-1531.66,-134.748,566.252,400)
	实时移动(-851.587,-134.748,807,400)
	实时移动(180.237,-134.748,807,400)
	实时移动(870.733,-134.748,807,400)
	实时移动(1899.65,-134.748,1102.86,400)
	实时移动(2942.31,-134.748,1107,400)
	实时移动(3531.81,27.8845,1107,400)	
	延迟(4000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	实时移动(2237.68,87.839,1107,400)
	实时移动(1595.73,-42.2671,1008.7,400)
	实时移动(905.267,-42.2672,807,400)
	实时移动(288.556,169.156,807,400)
	实时移动(38.7262,735.975,807,400)
	实时移动(38.7262,1376.9,807,400)
	实时移动(-123.907,2346.72,807,400)
	实时移动(-286.539,2660.82,807,400)	
	延迟(4000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("导师馈赠")
	延迟(2000)
	跳过对话()
	延迟(2000)
	领取任务奖励(1)
	延迟(2000)
	实时移动(-156.433,2188.01,807,400)
	实时移动(38.7261,1237.35,807,400)
	实时移动(-123.907,276.603,807,400)
	实时移动(-275.384,-2.52951,807,400)
	实时移动(-902.172,-160.055,807,400)
	实时移动(-2063.58,-387.741,507,400)
	实时移动(-2191.85,-1113.96,507,400)
	实时移动(-3485.14,-1798.9,507,400)
	实时移动(-4314.65,-1717.58,507,400)
	实时移动(-5452.86,-1685.05,507,400)
	实时移动(-6496.56,-1961.53,507,400)
	实时移动(-7000.72,-2613.22,507,400)
	实时移动(-7000.72,-4017.84,507,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)	
	导航寻路(8430.36,38.8365,1323.91,坐标数量,坐标表)
	实时移动(8880,96,1330,400)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(3000)		
end	
function 教堂前厅()
	while  true do	
		延迟(2000)
		if 取地图名() == "教堂前厅" then
			改写JSON配置("教堂前厅")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("教堂前厅-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{2871.5,15968.4,519},
		{3410.41,15854.5,519},
		{3790.17,15854.5,519},
		{4423.72,15854.5,519},
		{5112.97,15854.5,519},
		{6089.87,15854.5,519},
		{6450.97,15854.5,519},
		{7446.73,15854.5,519},
		{8133.02,15854.5,521.43},
		{8498.32,16353.5,524},
		{8997.43,16806.7,526.104},
		{9421.91,17323.1,523.652},
		{9942.58,17705.8,523.899},
		{10261.7,17796.1,555.291},
		{10618.7,17796.1,685.326},
		{11286.7,17796.1,1019.37},
		{11753.9,17861.2,1104.17},
		{12095,18363.2,1114},
		{12274.3,18906.3,1114},
		{12419.5,19239.7,1114},
		{12666.9,19763.1,1114},
		{12899.9,19996.1,1115.06},
		{13501.8,20069.9,1280.43},
		{13846.6,20069.9,1460.7},
		{14451.5,20121.2,1684.22},
		{14933.6,19639.1,1714},
		{15408,19029.2,1714},
		{15408,17996.6,1714},
		{15294.1,17350.6,1714},
		{15126.2,16413.2,1714},
		{14849.7,15825.5,1714},--1
		{15915.6,15893.1,1714},
		{15478.7,15779.2,1714},
		{16669.9,15841,1714},
		{17180.2,15513.4,1714},
		{17755.3,15529.7,1714},
		{18497.2,15627.3,1714},
		{19153.7,15724.9,1714},
		{19937.3,15887.5,1714},
		{20846.6,15838.7,1714},--2
	}
	坐标数量=#坐标表
	function 马德兰(模式)
		local 计次=0
		if 模式==1 then
			延迟(5000)
			导航寻路(14849.7,15825.5,1714,坐标数量,坐标表)
			延迟(3000)
		end		
		while  true do			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end	
			local nihao =已接任务ID判断(0x111ed4)---参数为任务ID，成功返回1 --在控制台脚本工具中查看任务ID
			if nihao == 1 then
				break
			end	
			计次=计次+1
			if 计次 < 5 then					
				local jieguo=BOSS寻路(14526.3,14976.5,1714)
				if jieguo==3 then
					马德兰(1)
					return
				end				
				local jieguo=BOSS寻路(15358.1,15071.8,1714)
				if jieguo==3 then
					马德兰(1)
					return
				end				
				local jieguo=BOSS寻路(14604.5,16087.4,1714)
				if jieguo==3 then
					马德兰(1)
					return
				end				
				local jieguo=BOSS寻路(15314.9,16296,1714)
				if jieguo==3 then
					马德兰(1)
					return
				end				
				local jieguo=BOSS寻路(14902.4,15727.7,1714)	
				if jieguo==3 then
					马德兰(1)
					return
				end											
			else
				break				
			end													
		end	
	end	
	function 圣洁BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(20846.6,15838.7,1714,坐标数量,坐标表)	
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,4900)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "火种圣殿" then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end					
			local jieguo=BOSS寻路(20400,15776,1714)
			if jieguo==3 then
				圣洁BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(20808.1,16547.6,1714)
			if jieguo==3 then
				圣洁BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(21058.4,15886.7,1714)
			if jieguo==3 then
				圣洁BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(20357,15544.1,1714)
			if jieguo==3 then
				圣洁BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(19761.3,16273.7,1714)
			if jieguo==3 then
				圣洁BOSS(1)
				return
			end												
		end	
	end	
	导航寻路(14849.7,15825.5,1714,坐标数量,坐标表)
	马德兰(0)
	ishave,x,y,z=范围怪判断2(1,0,0,0,"马德兰",2,5000)	
	实时移动(x,y,z,300)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)		
	导航寻路(20846.6,15838.7,1714,坐标数量,坐标表)
	实时移动(20597.6,16021.5,1714,400)
	实时移动(21440,16192,1714,400)		
	圣洁BOSS(0)
	跳过动画()
	加点()	
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	实时移动(21440,16192,1714,400)
	实时移动(22376.3,16009,1752.2,400)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()
	延迟(2000)		
end	
function 火种圣殿()
	while  true do	
		延迟(2000)
		if 取地图名() == "火种圣殿" then
			改写JSON配置("火种圣殿")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("火种圣殿-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-9910.39,9548.87,4},
		{-10227.3,9369.97,4},
		{-10572.3,9369.97,4},
		{-11270.4,9369.97,4},
		{-11603.8,9369.97,4},
		{-11910.3,9273.91,4},
		{-11928.1,8598.97,4},
		{-11928.1,8244.86,4},
		{-11928.1,7899.53,4},
		{-11928.1,7554.43,4},
		{-11928.1,6876.02,4},
		{-11928.1,6519.42,4},
		{-11912.6,6183.05,4},
		{-11733.8,5910.82,4},
		{-11567.5,5629.54,4},
		{-11331.4,5393.43,4},
		{-11031.4,5274.58,4},
		{-10443.1,4998.1,4},
		{-10097.3,4998.1,4},
		{-9751.5,4998.1,4},
		{-9406.64,4998.1,4},
		{-9073.12,4998.1,4},
		{-8386.07,4998.1,4},
		{-8040.85,4998.1,4},
		{-7693.09,4998.1,4},
		{-7003.12,4998.1,4},
		{-6659.1,4998.1,4},
		{-6313.92,4998.1,4},
		{-5629.85,4981.84,4},
		{-5318.65,4900.52,4},
		{-4621.05,4900.52,4},
		{-4286.38,4900.52,4},
		{-3941.3,4900.52,4},
		{-3595.9,4900.52,4},
		{-3247.03,4900.52,4},
		{-2560.07,4900.52,4},
		{-2214.83,4900.52,4},
		{-1520.82,4900.52,4},
		{-1175.34,4900.52,4},
		{-833.586,4900.52,4},
		{-155.814,4900.52,4},
		{201.987,4900.52,4},
		{859.81,4983.94,4},
		{1009.04,5271.17,4},
		{1069.13,5580.57,4},
		{1069.13,5938.58,4},
		{1069.13,6618.29,4},
		{1069.13,6972.61,4},
		{843.442,7212.94,4},
		{458.692,7597.69,4},
		{377.03,7907.8,4},
		{377.03,8262.69,4},
		{377.03,8595.39,4},
		{587.476,8788.92,4},
		{928.737,8788.92,4},
		{1622.04,8788.92,4},
		{1967.38,8788.92,4},
		{2312.59,8788.92,4},
		{3000.4,8788.92,4},
		{3279.25,8654.2,4},
		{3377,8347.5,4},
		{3555.9,7731.59,4},
		{3637.22,7420.93,4},
		{3637.22,7420.93,4},
		{3770.1,7126.53,4},
		{4131.56,6580.95,4},
		{4131.56,6580.95,4},
		{4450.38,6032.81,4},
		{4579.68,5741.84,4},
		{4616.26,5406.58,4},
		{4694.33,5103.83,4},
		{4694.33,4413.17,4},
		{4694.33,4058.53,4},
		{4694.33,3725.19,4},
		{4582.32,3430.19,4},
		{4582.32,3430.19,4},
		{4245.02,3429.89,4},
		{3888.58,3429.89,4},
		{3198.46,3429.89,4},
		{2856.8,3429.89,4},
		{2166.11,3429.89,4},
		{1829.79,3406.51,4},
		{1440.28,2879.13,4},
		{1430.2,2537.28,4},
		{1422.13,1849.89,4},
		{1029.92,1463.09,4},--1
		{1081.71,945.678,4},
		{1092.15,500.459,4},
		{1027.1,354.388,4},
		{913.254,-138.406,4},
		{913.254,-483.429,4},
		{913.254,-816.443,4},
		{913.254,-1173.94,4},
		{913.254,-1510.95,4},
		{1010.83,-2161.23,4},
		{987.263,-2192.38,4},--2
		{299.104,-2273.69,4},
		{225.436,-2347.36,4},
		{-24.1497,-2596.95,4},
		{-236.428,-3039.05,4},
		{-594.219,-3272.57,4},
		{-783.299,-3687.48,4},
		{-1109.93,-3760.56,4},
		{-1348.1,-3998.73,4},
		{-1508.49,-4630.35,4},
		{-1508.49,-4964.05,4},
		{-1508.49,-5654.44,4},
		{-1508.49,-5999.05,4},
		{-1508.49,-6665.74,4},
		{-1508.49,-7021.86,4},
		{-1508.49,-7708.43,4},
		{-1719.77,-8393.49,4},
		{-1622.33,-8686.28,4},
		{-1622.33,-9042.05,4},
		{-1622.33,-9720.65,4},
		{-1622.33,-10066.4,4},
		{-1622.33,-10753.8,4},
		{-1622.33,-11099.1,4},
		{-1622.33,-11782.3,4},
		{-1622.33,-12135.2,4},
		{-1622.33,-12825.6,4},
		{-1622.33,-13171,4},
		{-1622.33,-13852.6,4},
		{-1318.28,-13981.6,4},
		{-987.656,-13991.7,4},
		{-347.447,-14138,4},
		{-50.6049,-14284.4,4},
		{294.319,-14284.4,4},
		{570.933,-14421.8,4},
		{1026.87,-14853.3,4},
		{1026.87,-15187.9,4},
		{-1579.14,-7266.93,4},
	}
	坐标数量=#坐标表
	function 清理小怪(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(1029.92,1463.09,4,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end													
			local jieguo=BOSS寻路(1132.21,-1.80091,4)
			if jieguo==3 then
				清理小怪(1)
				return
			end				
			local jieguo=BOSS寻路(695.411,-1230,4)
			if jieguo==3 then
				清理小怪(1)
				return
			end				
			local jieguo=BOSS寻路(-91.4696,-1509.45,4)
			if jieguo==3 then
				清理小怪(1)
				return
			end				
			local jieguo=BOSS寻路(1787.22,-1226.15,4)
			if jieguo==3 then
				清理小怪(1)
				return
			end				
			local jieguo=BOSS寻路(7.37293,-2485.11,4)
			if jieguo==3 then
				清理小怪(1)
				return
			end				
			local jieguo=BOSS寻路(1876.09,-2211.87,4)
			if jieguo==3 then
				清理小怪(1)
				return
			end																				
		end	
	end	
	导航寻路(1029.92,1463.09,4,坐标数量,坐标表)
	移动Call(1390.6,2110.98,4,400)
	延迟(2500)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")
	延迟(5000)
	跳过动画()
	移动Call(896,1536,4,400)
	延迟(2500)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")
	延迟(5000)
	跳过动画()
	移动Call(1045.09,2224.28,4,400)
	延迟(2500)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")
	移动Call(1190.04,169.805,4,400)
	延迟(2500)
	跳过动画()
	-- 清理小怪(0)
	-- local jieguo=实时移动(1062.47,-446.058,4,400)
	-- if jieguo==3 then
		-- 清理小怪(1)
	-- end	
	-- local jieguo=实时移动(848,-1248,4,400)
	-- if jieguo==3 then
		-- 清理小怪(1)
	-- end	
	-- local jieguo=实时移动(1368.93,-2175.02,4,400)
	-- if jieguo==3 then
		-- 清理小怪(1)
	-- end	
	-- 清理小怪(0)
	移动Call(928,-2240,4,300)
	延迟(4000)
	跳过动画()	
	延迟(2000)	
	导航寻路(-1579.14,-7266.93,4,坐标数量,坐标表)	
	延迟(2000)
	移动Call(-1655.39,-8803.49,4,200)
	延迟(2000)
	移动Call(-1519.17,-9394.87,4,200)
	延迟(4000)	
	移动Call(-1563.96,-9620.97,4,200)
	延迟(2000)	
	移动Call(-1495.96,-8705.21,4,200)
	延迟(2000)
	导航寻路(1026.87,-15187.9,4,坐标数量,坐标表)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("圣洁之火")
	延迟(2000)
	跳过对话()
	延迟(2000)		
	领取任务奖励(1)
	延迟(2000)
	实时移动(1072,-16160,4,400)
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	延迟(8000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end	
function 教区庭院1()----关注一下这个函数的地图名
	while  true do	
		延迟(2000)
		if 取地图名() == "教区庭院" then
			改写JSON配置("教区庭院1")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("教区庭院1-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{11145.7,20336.4,296.803},
		{11275.8,19920.3,165.147},
		{11275.8,19243.2,17.3487},
		{11275.8,18874.7,15},
		{11259.6,18465,15},
		{11389.7,17866.5,15},
		{11389.7,17510.3,15},
		{11389.7,16808.7,15},
		{11389.7,16463.4,15},
		{11597.4,15888.7,15},
		{11783.9,15630,15},
		{11783.9,15286.6,15},
		{11783.9,14613.2,15},
		{11696.4,14288.2,15},
		{11325.8,13756.6,15},
		{11279.8,13434.6,15},
		{11231,12753.8,15},
		{11231,12425.8,15},
		{11231,11735.5,15},
		{11231,11390,15},
		{11231,10700.2,77.8535},
		{11231,10354.4,215.962},
		{11084.6,9720.61,315},
		{10970.8,9423.21,315},
		{10712.6,9279.01,315},
		{10368,9279.01,292.905},
		{10032,9279.01,121.526},
		{9366.54,9279.01,18.7659},
		{8665.38,9279.01,15},
		{8321.56,9279.01,15},
		{7642.53,9279.01,15},
		{7290.31,9279.01,15},
		{6956.82,9279.01,15},
		{6253.52,9279.01,15},
		{5908.41,9279.01,15},
		{5574.54,9279.01,15},
		{4873.94,9279.01,15},
		{4561.48,9200.24,15},
		{4011.58,8857.33,15},
		{3537.06,8417.06,15},
		{3268.1,8205.85,15},
		{2978.31,8100.06,15},
		{2081.86,7766.53,15},
		{1725.28,7766.53,15},
		{1390.88,7766.53,15},
		{1046.28,7766.53,15.9517},
		{871.006,7217.85,45.5453},
		{871.006,6872.19,169.905},
		{871.006,6211.88,315},
		{757.166,5913.48,315},
		{757.163,5572.41,315},
		{757.163,5227.66,315},
		{757.163,4536.97,315},
		{757.163,4192.82,315},
		{757.163,3848.22,315},
		{757.163,3157.44,315},
		{757.163,2810.73,217.199},
		{757.163,2120.21,16},
		{757.163,1786.87,18},
		{757.163,1439.96,18.838},
		{757.163,1099.71,17.3659},
		{757.163,408.769,15},
		{757.163,70.5319,15},
		{757.163,-606.731,15},
		{757.163,-791.02,15},--NPC
		{791.904,3562.54,315},
		{136.75,3627.59,315},--传送门
		{-284.333,3676.38,315},
		{-627.367,3656.39,315},
		{-640.14,3322.8,315},
		{-640.14,2967.03,297.515},
		{-640.14,2621.57,119.709},
		{-526.715,1845.17,15},
		{-180.086,1952.97,15},
		{-571.183,1171.89,15},
		{-494.817,705.581,15},
		{-647.55,-257.047,15},
		{-647.55,-649.012,15},
		{-35.0678,328.129,15},
		{2128.35,6683.46,499},
		{1783.82,6507.21,499},
		{1599.05,6322.44,499},
		{1521.67,5756.21,499},
		{1508.75,5163.86,371.561},
		{1507.53,4563.35,216},
		{1507.53,3995.8,214},
		{1507.53,3695.52,214},
		{1507.53,2800.98,214},
		{1507.53,2230.98,214},
		{1507.53,1670.97,214},
		{1705.52,1180.73,214},
		{1705.52,870.403,214},
		{1705.52,279.857,214},
		{1705.52,-276.206,214},
		{1705.52,-586.987,214},
		{1705.52,-1167.09,214},
		{1705.52,-1767.86,214},
		{1705.52,-2343.26,214},
		{1705.52,-2643.57,214},
		{1705.52,-3244.72,214},
		{1705.52,-3545.18,214},
		{1705.52,-4126.38,214},
		{1705.52,-4722.99,214},
		{1408.53,-5023.94,214},
		{1182.26,-5586.78,214},
	}
	坐标数量=#坐标表
	function 副官BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(136.75,3627.59,315,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			平面实时移动(780.198,1259.87,18.1188,400)
			平面实时移动(721.496,159.628,15,400)
			平面实时移动(255.789,-1274.71,15,400)		
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																
			local jieguo=BOSS寻路(-611.919,-1281.28,15)
			if jieguo==3 then
				副官BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-848.609,-37.5962,15)
			if jieguo==3 then
				副官BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-124.535,432.361,15)
			if jieguo==3 then
				副官BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(752,-416,15)
			if jieguo==3 then
				副官BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(381.772,-1284.72,15)
			if jieguo==3 then
				副官BOSS(1)
				return
			end																				
		end	
	end	
	导航寻路(757.163,-791.02,15,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)		
	平面实时移动(780.198,1259.87,18.1188,400)
	延迟(2000)	
	副官BOSS(0)
	延迟(2000)	
	平面实时移动(721.496,159.628,15,400)
	副官BOSS(0)
	平面实时移动(255.789,-1274.71,15,400)	
	副官BOSS(0)
	实时移动(381.772,-1284.72,15,400)
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	实时移动(-460.477,-1225.16,15,400)
	实时移动(-1490.13,-1212.94,15,400)
	实时移动(-2761.95,-1166.35,15,400)
	实时移动(-4470.81,-1001.43,15,400)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()
	导航寻路(1182.26,-5586.78,214,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()		
end	
function 信徒街巷()
	while  true do	
		延迟(2000)
		if 取地图名() == "信徒街巷" then
			改写JSON配置("信徒街巷")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("信徒街巷-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{2512,10439,1306},
		{2596.85,10175.4,1306},
		{2596.85,9564.73,1306},
		{2596.85,8967.11,1306},
		{2596.85,8376.61,1306},
		{2711.6,8119.42,1306},
		{2766.56,7534.62,1306},
		{2766.56,6936.99,1306},
		{2766.56,6337.16,1306},
		{2935.48,5810.65,1306},
		{3166.21,5664.83,1306},
		{3248.39,4796.11,1306},
		{3227.25,4201,1306},
		{3227.25,3901.37,1306},
		{3474.53,3189.69,1306},
		{3774.48,3189.69,1306},
		{3919.37,2966.74,1306},
		{3919.37,2370.35,1306},
		{3919.37,2070.47,1306},
		{3919.37,1470.03,1306},
		{3919.37,869.917,1306},
		{3652.01,477.585,1306},
		{3395.7,350.307,1306},
		{2882.69,159.891,1306},
		{2776.12,-106.673,1306},--1
		{2677.13,-803.65,1306},
		{2747.84,-1834.35,1306},
		{2276.38,-2305.81,1306},--2
		{1683.17,-2103.05,1306},
		{1013.43,-2187.9,1306},
		{413.636,-2187.9,1306},
		{-186.776,-2187.9,1306},
		{-777.05,-2187.9,1306},
		{-1121.65,-2187.9,1306},
		{-1164.08,-1637.48,1306},
		{-1164.08,-1048.12,1306},
		{-937.84,-862.055,1314.99},
		{-111.277,-763.061,1606},
		{201.844,-774.098,1608.5},
		{467.448,-281.19,1665.41},
		{467.448,319.533,1906},
		{340.17,1038.76,1906},
		{-56.3968,1109.47,1906},
		{-725.717,1194.32,1906},
		{-1321.29,1194.32,1906},
		{-1915.47,1194.32,1906},
		{-2222.55,1194.32,1894.71},
		{-2539.78,1208.46,1738.74},
		{-2866.07,1604.36,1607.89},
		{-2866.07,2214.7,1321.58},
		{-2866.07,2815.72,1307},
		{-3207.41,3056.43,1306},
		{-3786.87,3432.24,1306},
		{-4086.72,3502.94,1306},
		{-4683.94,3502.94,1306},
		{-5277.62,3502.94,1306},
		{-5888.79,3502.94,1306},
		{-6219.98,3795.17,1306},
		{-6681.08,4086.46,1306},
		{-6939.92,4178.92,1306},
		{-7540.3,4178.92,1232.46},
		{-8139.56,4178.92,1006},
		{-8692.51,4277.91,1006},
		{-9434.93,4320.34,1006},
		{-10057.3,4362.76,1006},
		{-10671.5,4376.91,1006},
		{-11185.6,4362.76,1006},
		{-11397.1,4151.29,1006},
		{-11510.9,3607.34,1006},
		{-11510.9,3010.58,1006},
		{-11510.9,2397.16,1010},
		{-11983,1975.05,1194.23},
		{-12474.8,2019.95,1308.26},
		{-12891.7,1617.67,1306},
		{-12806.9,1131.81,1306},
		{-12806.9,532.382,1306},
		{-12806.9,-58.2368,1306},
		{-12806.9,-668.779,1306},
		{-12658.8,-1216,1306},
		{-12221.7,-1159.43,1307.43},
		{-11936.8,-1159.43,1437.71},
		{-11325.3,-1159.43,1606},
		{-11012.3,-1458.42,1606},
		{-10998.2,-2001.05,1606},
		{-10998.2,-2589.37,1606},
		{-10833.3,-3430.53,1606},
		{-11538.6,-3755.8,1606},
		{-12511.7,-3642.66,1606},
		{-12976.4,-3670.95,1417.79},
		{-13428.3,-3642.66,1306},
		{-13820.9,-3173.68,1306},
		{-14190,-2646.04,1306},
		{-14577.9,-2617.76,1119.46},
		{-14785.4,-3314.58,848.709},
		{-14905.6,-3954.73,709.244},
		{-15454.1,-3484.44,706},
		{-15925.8,-3024.43,706},
		{-16272.2,-2678.05,706},
		{-16498.7,-2451.59,706},
		{-16661.7,-1839.42,706},
		{-16675.8,-1488.9,711.887},
		{-16511.2,-773.262,923.205},
		{-16397.3,-434.434,1008.63},
		{-15925.3,519.515,1006},
		{-15656.6,1275.07,1006},
		{-15274.8,1935.48,1006},
		{-15883.9,2964.59,1006},
		{-16393,3753.69,1006},


	}
	坐标数量=#坐标表
	function 哈斯BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-16393,3753.69,1006,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																
			local jieguo=BOSS寻路(-16846,5917.39,1006)
			if jieguo==3 then
				哈斯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-17455.4,5790.01,1006)
			if jieguo==3 then
				哈斯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-17367.7,4868.61,1006)
			if jieguo==3 then
				哈斯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-16080,5408,1006)
			if jieguo==3 then
				哈斯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-16728.4,6473.11,1006)
			if jieguo==3 then
				哈斯BOSS(1)
				return
			end																							
		end	
	end
	导航寻路(2776.12,-106.673,1306,坐标数量,坐标表)
	延迟(5000)
	导航寻路(2276.38,-2305.81,1306,坐标数量,坐标表)
	延迟(5000)
	导航寻路(-777.05,-2187.9,1306,坐标数量,坐标表)	
	导航寻路(-1164.08,-1637.48,1306,坐标数量,坐标表)		
	导航寻路(-16393,3753.69,1006,坐标数量,坐标表)
	实时移动(-16726.1,5161.04,1006,400)
	实时移动(-16846,5917.39,1006,400)
	哈斯BOSS(0)	
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	移动Call(-16376.4,6199.62,1006,400)
	延迟(2000)
	移动Call(-16433.8,7038.04,1006,400)
	延迟(2000)
	移动Call(-16668.1,8999.33,1006,400)	
	延迟(8000)
	跳过动画()	
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end
function 禁忌高墙()
	while  true do	
		延迟(2000)
		if 取地图名() == "禁忌高墙" then
			改写JSON配置("禁忌高墙")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("禁忌高墙-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{19619.3,34689,5157.05},
		{19716.9,35269.6,5313.18},
		{20185.8,35577.5,5313},
		{20862.4,35773.8,5313},
		{21541.4,35773.8,5313},
		{22770,35838.8,5313},
		{23516.6,35659.9,5313},
		{24052.9,35659.9,5313},
		{24004.1,35003.6,5313},
		{24378.2,34307.6,5313},
		{25267.3,34210,5313},
		{26061.6,34161.2,5313},
		{26583.9,34177.5,5313},--1
		{27377.8,34096.1,5444.43},
		{28087.3,33571,5502.77},
		{28504.8,32885.4,5500.83},
		{28912,32340.2,5481.52},--2
		{28898.1,31759.4,5385.84},
		{28881.8,31007.1,5318},
		{28816.8,30252.1,5318},
		{28816.8,29685,5318},
		{29190.8,29057.9,5318},
		{29272.2,28332.6,5318.61},
		{28703,27257.4,5323},
		{28881.8,26290.9,5323},
		{29125.8,25518,5323},
		{29862.3,25241.5,5323},--3
		{30675.6,25127.7,5323},
		{31680.9,25143.9,5516.03},
		{31924.8,24026,5691.22},
		{31876,23287.2,5693},
		{31957.4,22523.8,5637.15},
		{31502,21792.4,5507.52},--4
		{30730.7,21841.2,5335.6},
		{29870.2,21808.7,5328},
		{28971.5,21646,5330.56},
		{28987.8,20640.8,5464.74},--6
		{28971.5,19925,5513.17},
		{28939,19064.5,5601.95},
		{29719.6,18283.9,5613},
		{30337.7,17573.9,5613},
		{31386.6,17329.9,5375},
		{32085,17476.3,5375.28},--7
		{32021,18546.2,5217.56},
		{32973.6,18578.7,5213},
		{34093.8,18562.5,5213},
		{35128.8,18562.5,5213},
		{36025.8,18562.5,5213},
		{36602.3,18262,5213},
		{37293.8,17570.4,5213},
		{38341.6,17342.7,5213},
		{39507.9,17391.5,5217.36},


	}
	坐标数量=#坐标表
	function 守卫军BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(39507.9,17391.5,5217.36,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																
			local jieguo=BOSS寻路(40967.3,16948.7,5363)
			if jieguo==3 then
				守卫军BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(41806.9,17338.4,5363)
			if jieguo==3 then
				守卫军BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(41531.8,18064,5363)
			if jieguo==3 then
				守卫军BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(40826.2,17998.4,5363)
			if jieguo==3 then
				守卫军BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(41458.4,17412.3,5363)
			if jieguo==3 then
				守卫军BOSS(1)
				return
			end																									
		end	
	end
	导航寻路(26583.9,34177.5,5313,坐标数量,坐标表)
	延迟(5000)
	导航寻路(28912,32340.2,5481.52,坐标数量,坐标表)
	延迟(5000)
	导航寻路(29862.3,25241.5,5323,坐标数量,坐标表)	
	延迟(5000)
	导航寻路(31502,21792.4,5507.52,坐标数量,坐标表)
	延迟(5000)
	导航寻路(28987.8,20640.8,5464.74,坐标数量,坐标表)		
	延迟(5000)
	导航寻路(32085,17476.3,5375.28,坐标数量,坐标表)	
	延迟(5000)	
	导航寻路(39507.9,17391.5,5217.36,坐标数量,坐标表)
	实时移动(40262.5,17472.6,5358.62,400)
	实时移动(41075.4,17663.2,5363,400)
	守卫军BOSS(0)	
	领取任务奖励(1)	
	加点()
	领取任务奖励(1)	
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	领取任务奖励(1)	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	实时移动(42343.3,17370.3,5363,400)	
	延迟(2000)	
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end
function 意志高墙()
	while  true do	
		延迟(2000)
		if 取地图名() == "意志高墙" then
			改写JSON配置("意志高墙")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("意志高墙-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-6738.87,2429.09,542.821},
		{-5808.17,2499.8,524.059},
		{-5263.02,2528.09,523},
		{-4511.2,2259.39,523},
		{-4383.92,1327.27,523},
		{-4426.35,685.477,523},
		{-4355.9,-110.451,527.466},
		{-4200.08,-671.12,620},
		{-3549.54,-1341.65,618},
		{-3068.72,-2122.47,618},
		{-2430.14,-2150.76,435.442},
		{-1463.46,-1684.07,433},
		{-298.623,-1599.22,83},
		{203.799,-1556.8,83},
		{541.274,-1528.51,83},
		{1180.14,-1500.23,83},
		{2314.88,-1754.93,83},
		{2852.87,-1556.94,83},
		{3515.28,-1514.51,83},
		{4103.56,-1486.23,83},
		{4952.25,-1698.36,83},--1
		{3973.17,-1486.1,83},
		{3066.9,-1684.09,83},
		{2222.06,-1768.94,83},
		{1261.92,-1698.49,83},
		{724.256,-1020.83,83},
		{724.256,-220.844,143.518},
		{794.966,618.143,290},
		{1494.37,957.55,292.033},
		{2219.21,1042.4,83},
		{2987.49,1070.69,83},
		{3791.33,886.84,83},
		{4599.61,915.124,83},
		{5431.73,759.562,83},
		{5686.29,185.01,83},
		{5742.85,-596.403,83},
		{6167.11,-1477.23,83},
		{5662.85,-2101.48,83},
		{6129.54,-2908.17,83},
		{6857.23,-3275.86,83},
		{7631.36,-3261.71,83},
		{8324.32,-2568.76,83},
		{8918.28,-1974.79,83},
		{9820.7,-1932.37,83},
		{10549,-1904.08,83},
		{11209,-1904.08,104.09},
		{12197.2,-1875.8,183},
		{13192.8,-1974.79,185},
		{14092.8,-1974.79,265.4},
		{15121.1,-1946.51,268},
		{15809.3,-1918.23,268},
		{16600,-2017.22,280.502},

	}
	坐标数量=#坐标表
	function 意志BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(16600,-2017.22,280.502,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																
			local jieguo=BOSS寻路(17987,-2460.46,403)
			if jieguo==3 then
				意志BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(19045,-2645.62,403)
			if jieguo==3 then
				意志BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(19344.6,-1721.84,403)
			if jieguo==3 then
				意志BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(18595.1,-1309.55,403)
			if jieguo==3 then
				意志BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(17696,-1856,406)
			if jieguo==3 then
				意志BOSS(1)
				return
			end																													
		end	
	end
	导航寻路(4952.25,-1698.36,83,坐标数量,坐标表)
	延迟(5000)
	导航寻路(3066.9,-1684.09,83,坐标数量,坐标表)
	延迟(5000)
	导航寻路(1261.92,-1698.49,83,坐标数量,坐标表)	
	延迟(5000)	
	导航寻路(2987.49,1070.69,83,坐标数量,坐标表)		
	导航寻路(16600,-2017.22,280.502,坐标数量,坐标表)
	实时移动(17520,-2060,408,400)
	实时移动(18062.4,-2508.43,403,400)
	意志BOSS(0)	
	意志BOSS(0)
	意志BOSS(0)
	延迟(2000)
	ishave,x,y,z=范围怪判断2(1,0,0,0,"阿瑞娅",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	--领取任务奖励(1)	
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	移动Call(18892.7,-2825.34,403,400)
	延迟(5000)	
	移动Call(19808,-2048,403,400)
	延迟(8000)	
	跳过动画()	
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end
function 群狼街巷()
	while  true do	
		延迟(2000)
		if 取地图名() == "群狼街巷" then
			改写JSON配置("群狼街巷")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("群狼街巷-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{9453.34,15997.6,906},
		{9153.18,15486,906},
		{9250.76,14733.5,906},
		{9250.76,14046.8,906},
		{8816.08,13663,906},
		{8447.19,13679.3,906},
		{7756.62,13679.3,906},
		{7077.38,13679.3,906},
		{6386.16,13679.3,901.063},
		{6029.49,13679.3,720.985},
		{5195.59,13663,606},
		{4591.54,13128,606},
		{3843.23,13046.6,606},
		{3208.28,13359.6,606},
		{2301.76,13392.1,606},
		{1576.45,13473.4,606},
		{868.564,13652.3,606},
		{420.408,13221.6,606},
		{181.939,12086.5,606},
		{51.833,11255.2,606},
		{-224.643,10449.8,606},
		{-1456.8,10507,606},
		{-1635.7,9546.14,606},
		{-1414.02,8504.58,606},
		{-1430.29,7499.33,606},
		{-1316.44,6915.03,606.905},
		{-1348.97,6329.99,609},
		{-1348.97,5638.89,478.443},
		{-1348.97,5301.82,324.784},
		{-672.451,4951.46,306},
		{-200.816,5515.09,306},
		{59.3972,6474.83,13.8055},
		{672.24,6742.8,8},
		{1603.35,7271.73,6},
		{2218.86,7369.31,6},
		{2877.4,7636.85,6},
		{3016.44,8429.41,6},
		{3285.65,9250.89,6},
		{4112.12,9642.01,6},
		{4890.17,9576.96,6},
		{5514.92,9560.7,6},
		{6453,9528.17,6},
		{7228.25,9511.91,6},
		{8010.72,9235.43,6},
		{9041.77,9170.38,306},
		{9041.77,8296.39,306},
		{8976.71,7610.34,306},
		{7746.57,7577.81,35.9338},
		{7632.72,6543.98,6},
		{7600.2,5677.88,9.56616},
		{7657.47,4669.07,10},
		{7695.65,3755.71,6},
		{7733.84,2503.54,6},
		{7652.52,1824.23,6},
		{6592.9,1661.59,6},
		{5659.46,1716.04,6},
		{4795.47,1716.04,6},
		{4196.69,1699.78,6},
		{3730.64,2914.45,6},
		{3120.33,3815.83,6},
		{1873.95,3923.42,6},
		{1006.7,3939.68,6},
		{704.912,3103.32,6},
		{786.228,2004.43,6},
		{220.03,1587.46,6},
		{-464.475,1193.23,6},
		{-480.738,66.3037,6},
		{-366.895,-730.856,6},
		{-415.685,-1377.64,6},

	}
	坐标数量=#坐标表
	function 头狼BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(9453.34,15997.6,906,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																		
			local jieguo=BOSS寻路(11708.9,15592.3,906)
			if jieguo==3 then
				头狼BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(12431.9,16086.7,906)
			if jieguo==3 then
				头狼BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(11833.9,17037.3,906)
			if jieguo==3 then
				头狼BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(11815.9,15436.1,906)
			if jieguo==3 then
				头狼BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(10951.1,16042.6,906)
			if jieguo==3 then
				头狼BOSS(1)
				return
			end																															
		end	
	end
	导航寻路(7746.57,7577.81,35.9338,坐标数量,坐标表)
	导航寻路(9041.77,8296.39,306,坐标数量,坐标表)
	导航寻路(-200.816,5515.09,306,坐标数量,坐标表)
	导航寻路(-1348.97,5301.82,324.784,坐标数量,坐标表)
	导航寻路(9453.34,15997.6,906,坐标数量,坐标表)
	实时移动(10571.9,16097.2,906,400)
	实时移动(11620,15892,906,400)		
	延迟(5000)
	头狼BOSS(0)	
	延迟(2000)
	--领取任务奖励(1)	
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	实时移动(11365.3,16132.3,906,400)
	实时移动(12304,15968,906,400)
	实时移动(13692.2,15197.4,906,400)
	实时移动(14136,14091.7,906,400)
	延迟(2000)	
	跳过动画()	
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end
function 银焰街巷()
	while  true do	
		延迟(2000)
		if 取地图名() == "银焰街巷" then
			改写JSON配置("银焰街巷")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("银焰街巷-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-1853.89,7835.86,906},
		{-1229.05,7751.01,906},
		{-447.641,7609.6,906},
		{-221.361,6803.33,906},
		{-221.361,5698.48,906},
		{4.91079,5262.48,906},
		{103.905,3993.23,906},
		{415.028,3302.11,906},
		{655.442,2701.7,906},
		{396.571,3541.43,906},
		{469.574,4754.42,909.576},
		{1531.4,5023.12,1210},
		{2266.78,4127.73,1206},
		{2464.77,2973.19,1206},
		{2351.63,1802.07,1056.04},
		{2351.63,664.095,906},
		{2450.63,-288.028,906},
		{2577.91,-1145,906},
		{3714.46,-1201.57,906},
		{4675.87,-1258.14,906},
		{5783.14,-1244,863.839},
		{6647.99,-1187.43,710.946},
		{7638.69,-1258.14,712.67},
		{8461.1,-1300.57,906},
		{8531.81,-1851.27,906},
		{9356.07,-2275.53,906},
		{10447.3,-2311.94,906},
		{11438,-2382.65,1036.46},
		{12639.2,-2182.28,1206},
		{13807.5,-2210.57,1206},
		{15041.6,-2224.53,1206},
		{16192.3,-2153.82,1166.23},
		{17163,-2224.53,906},
		{17148.9,-2918.66,794.461},
		{17021.6,-4377.64,606},
		{17080.1,-3761.74,609},
		{17177.3,-2445.3,907.418},
	}
	坐标数量=#坐标表
	function 尔莎BOSS(模式)
		if 模式==1 then
			延迟(7000)
			--导航寻路(17177.3,-2445.3,907.418,坐标数量,坐标表)
			实时移动(14671.1,-4493.99,906,400)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			local nihao =已接任务ID判断(0x119404)---参数为任务ID，成功返回1 --在控制台脚本工具中查看任务ID
			if nihao == 1 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																			
			local jieguo=BOSS寻路(17051,-6649.62,606)
			if jieguo==3 then
				尔莎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17754.8,-6778.57,606)
			if jieguo==3 then
				尔莎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17099.7,-7066.87,606)
			if jieguo==3 then
				尔莎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17077.5,-6247.66,606)
			if jieguo==3 then
				尔莎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16563.7,-6744.13,606)
			if jieguo==3 then
				尔莎BOSS(1)
				return
			end																																
		end	
	end

	导航寻路(17177.3,-2445.3,907.418,坐标数量,坐标表)
	移动Call(17164.4,-4018.31,606,400)
	延迟(5000)
	移动Call(17161.5,-5819.28,606,400)
	延迟(8000)
	跳过动画()
	延迟(2000)
	实时移动(16882.9,-6688.19,606,400)
	延迟(5000)
	尔莎BOSS(0)	
	延迟(2000)
	--领取任务奖励(1)	
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	平面实时移动(18972.1,-6662.82,606,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)	
	平面实时移动(17712,-7136,606,400)
	平面实时移动(17208.1,-8096.71,606,400)
	跳过动画()	
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	平面实时移动(-7243.53,5043.95,507,400)
	平面实时移动(-6458.84,4978.9,507,400)
	平面实时移动(-4579.51,4978.9,782.685,400)
	平面实时移动(-2800.15,4832.53,807,400)
	平面实时移动(-2539.94,5068.1,807,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	平面实时移动(-2641.84,3850.01,807,400)
	平面实时移动(-2528,2484.65,807,400)
	平面实时移动(-74.4396,2078.07,807,400)
	平面实时移动(-106.966,-116.436,807,400)
	平面实时移动(-1894.21,-132.7,507,400)
	平面实时移动(-2447.16,-1547.8,507,400)
	平面实时移动(-2266.27,-1635.04,507,400)
	平面实时移动(-5934.08,-1694.17,507,400)
	平面实时移动(-7049.03,-2556.13,507,400)
	平面实时移动(-7032.77,-3998.37,507,400)
	实时移动(-7158.3,-4042.85,507,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	平面实时移动(2642.73,7094.98,499,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()
end
function 教区庭院()
	while  true do	
		延迟(2000)
		if 取地图名() == "教区庭院" then
			改写JSON配置("教区庭院")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("教区庭院-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{18430.7,8691.92,309},
		{17647.6,9169.24,305},
		{16702.7,9307.49,305},
		{15733.9,9323.75,305},
		{14689.4,9323.75,305},
		{13604.2,9340.01,305},
		{12305.3,9356.28,305},
		{11382.6,9405.07,305},
		{10216.3,9421.33,215.153},
		{9142.05,9437.59,6},
		{8327.54,9470.12,5},
		{7260.02,9502.65,5},
		{6117.92,9600.23,5},
		{4997.67,9583.96,5},
		{4184.51,8770.8,5},
		{3485.18,8071.48,5},
		{2391.71,8064,5},
		{1186.2,8064,5},
		{613.655,6762.35,208.279},
		{646.182,5735.26,305},
		{678.708,4313.22,305},
		{-101.929,3532.58,305},
		{-703.671,2635.79,123.894},
		{-687.408,1431.43,5},
		{-638.618,319.072,5},
		{-671.145,-633.445,5},
		{-1640.4,-958.71,5},
		{-2921.65,-974.973,5},
		{-3943.17,-942.447,5},

	}
	坐标数量=#坐标表
	function 克斯BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(18430.7,8691.92,309,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end		
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end			
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																					
			local jieguo=BOSS寻路(19650,8600,607.438)
			if jieguo==3 then
				克斯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(20179.1,8202.51,605)
			if jieguo==3 then
				克斯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(20806.2,8366.12,605)
			if jieguo==3 then
				克斯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(20610.6,8755.1,605)
			if jieguo==3 then
				克斯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(19666,8964.73,608)	
			if jieguo==3 then
				克斯BOSS(1)
				return
			end																																		
		end	
	end

	导航寻路(18430.7,8691.92,309,坐标数量,坐标表)
	实时移动(19650,8600,607.438,400)
	实时移动(20144,8992,605,400)
	克斯BOSS(0)	
	延迟(2000)
	--领取任务奖励(1)	
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	平面实时移动(21226.6,8654.8,605,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(3000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end
function 圣德兰修道院()
	while  true do	
		延迟(2000)
		if 取地图名() == "圣德兰修道院" then
			改写JSON配置("圣德兰修道院")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("圣德兰修道院-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-5602.86,3166.97,6},
		{-4519.76,2727.87,6},
		{-3270.56,2467.65,6},
		{-2173.31,2483.92,6},
		{-885.318,2483.92,6},
		{-13.1608,2142.39,6},
		{87.8634,2041.64,6},
		{-273.373,985.186,6},
		{-1151.59,106.97,6},
		{-2162.42,-6.87251,6},
		{-3398.92,-41.1736,6},
		{-3423.67,-1083.49,6},
		{-2903.25,-2109.91,6},
		{-2004.82,-2939.34,6},
		{-889.959,-2671.21,6},
		{327.873,-2557.37,6},
		{866.394,-2427.26,6},--1
		{1696,-3008,6},
		{2728.91,-2319.84,6},
		{3454.7,-1630.53,6},
		{4479.28,-605.938,6},

	}
	坐标数量=#坐标表
	function 修道BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(866.394,-2427.26,6,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end	
		local 计次=0	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			计次=计次+1
			if 计次 < 11 then				
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			local nihao =已接任务ID判断(0x119bd3)---参数为任务ID，成功返回1 --在控制台脚本工具中查看任务ID
			if nihao == 0 then
				break
			end																						
			local jieguo=BOSS寻路(4462.05,-215.838,6)
			if jieguo==3 then
				修道BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(4534.94,528.408,6)
			if jieguo==3 then
				修道BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(3949.18,-12.155,6)
			if jieguo==3 then
				修道BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(5156.87,-46.7289,6)
			if jieguo==3 then
				修道BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(4455.05,-138.942,6)
			if jieguo==3 then
				修道BOSS(1)
				return
			end		
			else
				break	
			end																																								
		end	
	end

	导航寻路(87.8634,2041.64,6,坐标数量,坐标表)
	导航寻路(-3398.92,-41.1736,6,坐标数量,坐标表)
	导航寻路(866.394,-2427.26,6,坐标数量,坐标表)
	平面实时移动(1638.67,-2960.63,6,400)
	平面实时移动(2273.26,-2873.46,6,400)		
	移动Call(1715.03,-2997.41,6,400)
	
	延迟(5000)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end	
	移动Call(2454.19,-2609.59,6,400)
	延迟(3000)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end	
	跳过动画()
	移动Call(2641.88,-1864.61,6,400)
	延迟(3000)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end
	跳过动画()
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")	
	移动Call(3295.77,-1451.87,6,400)
	延迟(3000)
	if 取血比例() < 79 then
		使用技能("复合药剂")
	end	
	跳过动画()
	移动Call(4462.05,-215.838,6,400)
	跳过动画()
	延迟(5000)
	跳过动画()
	移动Call(3923.85,172.3,6,400)
	跳过动画()
	延迟(5000)
	跳过动画()	
	修道BOSS(0)	
	延迟(2000)
	领取任务奖励(1)	
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	平面实时移动(4210.28,-1243.43,6,400)
	平面实时移动(4138.19,-1698.13,6,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)
	延迟(2000)	
	延迟(2000)	
	领取任务奖励(1)
	延迟(2000)	
	延迟(2000)	
	领取任务奖励(1)
	延迟(2000)			
	平面实时移动(4441.4,-580.909,6,400)
	平面实时移动(5745.14,111.793,6,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(3000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end
function 遗忘秘殿()
	while  true do	
		延迟(2000)
		if 取地图名() == "遗忘秘殿" then
			改写JSON配置("遗忘秘殿")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("遗忘秘殿-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{2296.39,-18311.7,321},
		{2282.25,-16817.6,321},
		{2253.96,-15469.3,353.144},
		{2324.67,-14333.7,351},--1
		{3592.93,-14271.2,322.93},
		{4924.19,-14256.5,322.119},
		{6256.66,-14189.8,321},
		{7475.93,-14236.7,321},
		{8763.2,-14193,318},
		{10028.4,-14274.4,321},
		{10340.1,-15391.4,323},
		{10337.2,-16475.3,320.704},
		{10240,-17216,321},--2
		{10368,-16128,316},
		{10353.6,-14966.6,321},
		{11376,-14176,321},
		{12832,-14208,318},
		{13850.5,-14216.8,321},--3
		{12581.7,-14190.5,318},
		{11429.8,-14137.5,321},
		{10349,-13928.4,321},
		{10366.1,-12882.4,321},
		{10386.7,-11692.4,321},
		{10368,-11008,321},--4
		{10374.5,-12393.1,321},
		{10490.6,-13565.7,321},
		{8959.02,-11405,321},
		{7797.55,-11973.9,321},
		{6658.44,-12017.3,321},
		{5635.79,-12280.1,321},
		{4890.75,-11397.7,321},
		{3538.1,-11355.2,321},
		{2395.68,-11071.8,321},
		{2534.56,-10032.1,99.5222},
		{2591.39,-8789.95,86},
		{2536.7,-7666.74,86},
		{2483.98,-6621.21,86},
		{2636.85,-5293.86,86},
		{4017.03,-5248.93,86},
		{5253.64,-5241.76,86},
		{6417.72,-5209.77,86},
		{7587.4,-5222,86},
		{8841.1,-5212.67,86},
		{10044.7,-4981.53,86},
		{10096.1,-3740.25,86},
		{9972.96,-2356.03,86},
		{10083.5,-1246.29,86},
		{10077.6,-2563.53,86},


	}
	坐标数量=#坐标表
	function 基尔BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(10077.6,-2563.53,86,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																							
			local jieguo=BOSS寻路(10048.2,-244.946,86)
			if jieguo==3 then
				基尔BOSS(1)
				return
			end	
			local jieguo=BOSS寻路(9280,448,86)
			if jieguo==3 then
				基尔BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9885.64,781.353,86)
			if jieguo==3 then
				基尔BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(10676.7,375.607,86)
			if jieguo==3 then
				基尔BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9674.49,202.545,86)
			if jieguo==3 then
				基尔BOSS(1)
				return
			end																																								
		end	
	end

	导航寻路(2324.67,-14333.7,351,坐标数量,坐标表)
	延迟(5000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)
	导航寻路(2324.67,-14333.7,351,坐标数量,坐标表)
	延迟(5000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	导航寻路(10240,-17216,321,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	导航寻路(13850.5,-14216.8,321,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)		
	导航寻路(10368,-11008,321,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(10000)		
while  true do	
	local nihao =已接任务ID判断(0x119fbf)---参数为任务ID，成功返回1 --在控制台脚本工具中查看任务ID
	if nihao == 0 then
		break
	end
	if 取停止挂机命令()==1 then
		输出信息("脚本退出挂机流程")
		return
	end		
	导航寻路(10240,-17216,321,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	导航寻路(13850.5,-14216.8,321,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)		
	导航寻路(10368,-11008,321,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(10000)	
end			
	导航寻路(10077.6,-2563.53,86,坐标数量,坐标表)
	平面实时移动(10103,-1423.8,86,400)
	平面实时移动(10048.2,-244.946,86,400)
	基尔BOSS(0)	
	延迟(2000)
	领取任务奖励(1)	
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	平面实时移动(9919.96,2011.38,86,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(3000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end
function 觉醒秘殿()
	while  true do	
		延迟(2000)
		if 取地图名() == "觉醒秘殿" then
			改写JSON配置("觉醒秘殿")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("觉醒秘殿-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-3741.91,-9004.55,503},
		{-3691.24,-7664.65,503},
		{-2785.36,-6554.41,503},
		{-1355.13,-6571.46,503},
		{47.5069,-6355.75,503},
		{1398.61,-6129.29,503},
		{2797.39,-6430.45,503},
		{4241.7,-6140.62,503},
		{5677.22,-6323.6,388},
		{6800,-6368,503},
		---遇到BOSS
		{5487.88,-6336,388},
		{3997.16,-6059.6,503},
		{3296,-4928,503},
		{0,0,0},
		{3420,-5860,503},
		{3229.39,-4534.69,503},
		{1872.13,-4563.1,503},
		{1763.44,-3129.91,503},
		{2721.73,-2243.49,503},
		{4008.11,-2878.67,503},
		{5419.27,-2484.25,503},
		{5265.02,-1921.35,503},
		{5030.91,-442.573,503},
		{5085.81,991.664,503},
		{5431.2,2325.01,503},
		{6933.44,2022.57,503},
		{8401.2,2190.25,503},
		{9350.69,3113.27,503},
		{9957.71,4268.76,503},
		{9281.34,5437.32,503},
		{8314.2,6574.97,503},
		{7014.68,7182.02,503},
		{5532.57,7441.8,503},
		{4089.22,7044.91,503},
		{3387.39,7441.27,503},
		{2624,8000,503},
		---遇到BOSS
		{3054.11,6581.04,503},
		{3340.56,5225.05,503},
		{2842.06,3839.81,503},
		{2811.64,2454.89,503},
		{1399.65,2495.18,503},
		{1059.22,1102.98,503},
		{1052.8,-374.446,503},
		{-332.459,-854.716,503},
		{-726.649,457.821,503},
		{-420.727,1873.38,503},
		{-485.572,3359.25,503},
		{-491.919,4930.31,503},
		{-500.182,6323.64,503},
		{-603.283,7766.01,503},
		{-699.301,9270.6,503},
		{-520.232,10576.5,503},
		{-647.583,11976.3,503},
		{-561.281,13468,503},
		{-534.852,14968.3,503},
		{-424.193,16435.3,503},
		{-630.282,17870.7,503},
		{-422.49,19321,503},
		{-486.174,20821.3,503},
		{-482.369,22316.8,503},
		{-482.167,23788.1,503},
		{-486.012,23830.4,503},
		---遇到BOSS
		{-681.034,25276.6,506.895},
		{-415.555,22484.3,503},
		{-415.555,22484.3,503},
		---遇到BOSS
	}
	坐标数量=#坐标表
	function 幻影BOSS(模式)
		if 模式==1 then
			导航寻路(-415.555,22484.3,503,坐标数量,坐标表)
			延迟(7000)
			导航寻路(-415.555,22484.3,503,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																							
			local jieguo=BOSS寻路(-449.999,25016.2,503.756)
			if jieguo==3 then
				幻影BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-1519.57,25081.7,503)
			if jieguo==3 then
				幻影BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(336,24992,503)
			if jieguo==3 then
				幻影BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-879.031,24527.2,503)
			if jieguo==3 then
				幻影BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-606.812,24859.1,503)
			if jieguo==3 then
				幻影BOSS(1)
				return
			end																																										
		end	
	end

	导航寻路(6800,-6368,503,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	导航寻路(2624,8000,503,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	导航寻路(1052.8,-374.446,503,坐标数量,坐标表)
	导航寻路(-332.459,-854.716,503,坐标数量,坐标表)	
	导航寻路(-415.555,22484.3,503,坐标数量,坐标表)
	实时移动(-368,23456,503,400)
	实时移动(-449.999,25016.2,503.756,400)
	幻影BOSS(0)	
	延迟(2000)
	跳过动画()
	延迟(2000)
	实时移动(-448,26240,578,400)
	延迟(2000)
	延迟(5000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	延迟(2000)
	跳过动画()
	延迟(2000)	
	实时移动(-577.462,24826.3,503,400)
	实时移动(1664.89,25567,503,400)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	实时移动(1153.56,25218.9,503,400)
	延迟(5000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)		
	实时移动(1664.89,25567,503,400)		
	延迟(2000)
	按键(0x44) --按键D
	延迟(3000)
	等待过图()	
	延迟(2000)
	跳过动画()	
end
function 升华秘殿()----关注一下这个函数的地图名
	while  true do	
		延迟(2000)
		if 取地图名() == "升华秘殿" then
			改写JSON配置("升华秘殿")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("升华秘殿-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{310.077,-171.769,553.484},
		{372.51,-1495.98,492},
		{402.115,-2821.36,492},
		{222.176,-4334.68,492},
		{274.875,-5663.9,492},
		{-720.358,-6692.24,499.934},
		{-2055.24,-6682.73,507},
		{-3318.33,-6722.5,507},

	}
	坐标数量=#坐标表
	function 狂怒BOSS(模式)
		if 模式==1 then
			导航寻路(310.077,-171.769,553.484,坐标数量,坐标表)
			延迟(7000)
			导航寻路(310.077,-171.769,553.484,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																							
			local jieguo=BOSS寻路(290.003,2660.34,1267)
			if jieguo==3 then
				狂怒BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-476.743,3085.44,1267)
			if jieguo==3 then
				狂怒BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(414.835,3543.07,1267)
			if jieguo==3 then
				狂怒BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(1342.32,3466.38,1267)
			if jieguo==3 then
				狂怒BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(720.096,4356.31,1267)
			if jieguo==3 then
				狂怒BOSS(1)
				return
			end																																										
		end	
	end

	导航寻路(310.077,-171.769,553.484,坐标数量,坐标表)
	移动Call(296.004,899.824,881.761,400)
	延迟(5000)
	跳过动画()
	移动Call(337.358,2300.04,1267,400)
	延迟(5000)
	跳过动画()	
	狂怒BOSS(0)	
	延迟(2000)
	跳过动画()
	延迟(5000)
	狂怒BOSS(0)
	延迟(2000)
	跳过动画()	
	延迟(5000)
	狂怒BOSS(0)
	延迟(2000)
	跳过动画()	
	延迟(5000)
	狂怒BOSS(0)
	延迟(2000)
	跳过动画()	
	延迟(8000)
	ishave,x,y,z=范围怪判断2(1,0,0,0,"阿瑞娅",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	平面实时移动(1056,2880,1267,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)	
	平面实时移动(1056,2880,1267,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	平面实时移动(389.985,4889.02,1267,400)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(3000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	实时移动(1285.47,-1814.59,3097,300)
	实时移动(2300.68,-1797.21,3093,300)
	延迟(2000)
	打开NPC()
	延迟(2000)
	对话选项("圣诫之末")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	平面实时移动(1497.6,-1954.17,3102,400)
	延迟(2000)
	打开NPC()
	延迟(2000)	
	对话选项("沙漠来客")
	延迟(2000)	
	跳过对话()
	延迟(2000)	
	平面实时移动(2127.76,-328.481,3093,400)
	平面实时移动(1424,800,3093,400)
	平面实时移动(580.111,1707.77,3075.45,400)
	平面实时移动(273.822,2507.53,2900.61,400)
	平面实时移动(177.908,3224.98,2858,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(3000)		
	跳过对话()
	延迟(2000)		
	跳过动画()	
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()			
end
function 边陲之地()
	while  true do	
		延迟(2000)
		if 取地图名() == "边陲之地" then
			改写JSON配置("边陲之地")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("边陲之地-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-8664.17,-18755.1,32},
		{-9085,-17421.5,32},
		{-8371.41,-15976.7,32},
		{-8171.98,-14547.9,32},
		{-8722.14,-13156.6,32},
		{-9259.3,-11754.2,32},
		{-9689.44,-10321.3,32},
		{-9595.37,-8829.32,32},
		{-9526.97,-7342.26,32},
		{-9064.39,-5929.78,32},
		{-8825.24,-4460.52,32},
		{-8241.97,-3156.09,32},
		{-7393.9,-1836.5,32},
		{-6417.48,-565.133,32},
		{-5633.38,579.375,32},
		{-4706.78,1731.61,32},
		{-4167.76,3138.73,32},
		{-2994.32,3861.74,32},
		{-2608,3936,32},
		---遇到BOSS
		{-1424,3168,32},
		{-574.217,1978.79,32},
		{783.785,1446.93,32},
		{2226.59,1407.23,32},
		{3593.62,1324.4,32},
		{4579.8,202.118,32},
		{5951.16,-491.909,32},
		{7427.67,-750.269,32},
		{8953.27,-1120.55,32},
		{10208.3,-1759.17,32},
		{11581,-2111.67,32},
		{12688.4,-1346.26,32},
		{14377.7,-1253.48,32},	

	}
	坐标数量=#坐标表
	function 沙巨人BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(14377.7,-1253.48,32,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			实时移动(15856,-1804.18,32,400)
			实时移动(16584.1,-2179.71,32,400)
			实时移动(16768.3,-2781.72,32,400)
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																							
			local jieguo=BOSS寻路(15855,-2278,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16298.6,-2865.19,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16577.5,-2028.46,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(15720.7,-3264.59,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16646,-3234.25,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end																																									
		end	
	end

	导航寻路(-2608,3936,32,坐标数量,坐标表)
	测试(-2688,4032,32,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)		
	跳过动画()	
	延迟(5000)	
	导航寻路(14377.7,-1253.48,32,坐标数量,坐标表)
	实时移动(15008.7,-1896.37,32,400)
	实时移动(15697.7,-2477.98,32,400)
	实时移动(16531.9,-2771.96,32,400)
	实时移动(16403.2,-2119.2,32,400)
	延迟(2000)
	跳过动画()	
	延迟(5000)
	沙巨人BOSS(0)	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	--------------------------------------选着关卡
	延迟(2000)	
	按键加强("t")
	延迟(8000)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)
	if 取地图名() == "避难所-余烬之息" then
		实时移动(1434.71,-2713.52,3162.76,400)
		实时移动(2176,-3520,3251,400)
		延迟(2000)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)		
		打开世界关卡("沉没沙丘")
		延迟(5000)
		进入世界关卡()		
		延迟(2000)	
		延迟(2000)
		等待过图()	
		延迟(2000)
		跳过动画()		
	else
		平面实时移动(118.099,-1277.31,807,400)		
		延迟(2000)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)		
		打开世界关卡("沉没沙丘")
		延迟(5000)
		进入世界关卡()		
		延迟(2000)	
		延迟(2000)
		等待过图()	
		延迟(2000)
		跳过动画()	
	end	
end
function 沉没沙丘()
	while  true do	
		延迟(2000)
		if 取地图名() == "沉没沙丘" then
			改写JSON配置("沉没沙丘")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("沉没沙丘-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-14050,390,2491},
		{-13636.8,-1104.68,2491},
		{-12005.5,-1033.2,2491},
		{-10688.5,-667.924,2491},
		{-9304.52,-55.0162,2491},
		{-9650.8,1273.18,2491},
		{-9556,2771.11,2491},
		{-8241.71,3345.84,2491},
		{-6800,3232,2491},
		{-5419.16,2771.43,2491},
		{-3964.99,3238.55,2491},
		{-2660.71,3124.59,2491},
		{-1258.13,3115.74,2491},
		{284.6,3531.15,2491},
		{1165.76,4639.65,2491},
		{2538.14,3744,2491},
		{3812.05,3185.63,2491},
		{5178.89,2701.36,2491},
		{6475.89,3200.26,2491},
		{7741.18,2802.64,2491},
		{9149.67,2352.02,2491},
		{10321.1,1361.66,2491},
		{10678.4,43.0593,2491},
		{11701,-1155.92,2491},
		{13098.4,-1650.67,2491},
		{13746.1,-2877.88,2491},
		{15192.7,-3104,2491},
		{16651.7,-3775.04,2491},
		{17846.9,-3090.17,2491},
		{18894.1,-2057.16,2491},
		{19331.8,-696.409,2491},
		{19312,608,2491},
		{18877.8,2049.24,2491},
		{18252.6,3467.18,2491},
		{17253.6,4583.1,2491},
		{16638.4,5955.29,2491},
		{17314.1,7097.93,2491},
		{16000.9,6630.57,2491},
		{14786.7,5839.47,2491},
		{13788.7,4843.32,2491},
		{12500.3,3985.41,2491},
		{11646,5069.51,2491},
		{10372.5,5740.54,2491},
		{9859.78,4517.67,2491},
		{9766.95,3051.99,2491},
		{9866.95,1621.11,2491},
		{10521.6,322.317,2491},
		{11418.4,-907.315,2491},
		{11095.3,-2304.25,2491},
		{10796.5,-3661.57,2491},
		{12198.8,-4331.25,2491},
		{13613.3,-3641.88,2491},
		{15165.2,-3540.51,2491},
		{16471.5,-4180.21,2491},
		{16592.5,-4506.21,2491},
		---遇到BOSS
		{16641.7,-5282.81,2491},
		{16887.4,-6296.48,2491},
		---遇到BOSS
		{17311,-7618.07,2491},
		{18080.2,-8854.73,2491},
		{19648,-8704,2575},
		{20974.5,-8870.35,2556},
		{19625.3,-8640.86,2576.42},
		{18562.4,-8352.5,2494.57},
		---遇到BOSS

	}
	坐标数量=#坐标表
	function 沙巨人BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(14377.7,-1253.48,32,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			实时移动(15856,-1804.18,32,400)
			实时移动(16584.1,-2179.71,32,400)
			实时移动(16768.3,-2781.72,32,400)
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																							
			local jieguo=BOSS寻路(15855,-2278,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16298.6,-2865.19,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16577.5,-2028.46,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(15720.7,-3264.59,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16646,-3234.25,32)
			if jieguo==3 then
				沙巨人BOSS(1)
				return
			end																																									
		end	
	end

	导航寻路(16592.5,-4506.21,2491,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)		
	跳过动画()	
	延迟(5000)	
	导航寻路(16887.4,-6296.48,2491,坐标数量,坐标表)
	测试(16884.2,-6204.18,2491,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)			
	导航寻路(18562.4,-8352.5,2494.57,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 坠星集市()
	while  true do	
		延迟(2000)
		if 取地图名() == "坠星集市" then
			改写JSON配置("坠星集市")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("坠星集市-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-6462.8,-6367.08,1916},
		{-5259.5,-6394.91,1904.88},
		{-3684.14,-6400,1781},
		{-2091.14,-6541.9,1781},
		{-1067.09,-5318.78,1781},
		{-666.085,-3993.54,1937.42},
		{-314.21,-2495.47,2005},
		{-114.441,-1464.66,2023.77},
		---遇到BOSS
		{87.95,-80.1,2033.99},
		{831.002,1278,2025.12},
		{-151.921,-122.649,2026},
		{-1085.75,1211.5,2003.07},
		{-1362.73,2345.82,2004.69},
		{-1616,2848,2003},

	}
	坐标数量=#坐标表
	function 小怪(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(87.95,-80.1,2033.99,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																							
			local jieguo=BOSS寻路(614.831,335.809,2049.97)
			if jieguo==3 then
				小怪(1)
				return
			end				
			local jieguo=BOSS寻路(1381,-314.63,2034.6)
			if jieguo==3 then
				小怪(1)
				return
			end				
			local jieguo=BOSS寻路(732.156,-961.506,2024.5)
			if jieguo==3 then
				小怪(1)
				return
			end				
			local jieguo=BOSS寻路(-234.799,-443.657,2018.95)
			if jieguo==3 then
				小怪(1)
				return
			end				
			local jieguo=BOSS寻路(348.686,335.404,2040.21)
			if jieguo==3 then
				小怪(1)
				return
			end																																										
		end	
	end
	function 王命BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-1616,2848,2003,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			实时移动(-1707,3777,2006.02,400)
			实时移动(-2152.38,4789.51,2003,400)
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																								
			local jieguo=BOSS寻路(-2152.38,4789.51,2003)
			if jieguo==3 then
				王命BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-2819.35,4710.83,2004.79)
			if jieguo==3 then
				王命BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-3536.47,4624.03,2005.5)
			if jieguo==3 then
				王命BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-3770.58,5406.34,2007.92)
			if jieguo==3 then
				王命BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-2656,5120,2003)
			if jieguo==3 then
				王命BOSS(1)
				return
			end																																										
		end	
	end

	导航寻路(87.95,-80.1,2033.99,坐标数量,坐标表)
	延迟(6000)		
	跳过动画()	
	延迟(1000)	
	跳过动画()	
	延迟(1000)	
	跳过动画()	
	延迟(1000)	
	小怪(0)
	延迟(7000)	
	ishave,x,y,z=范围怪判断2(1,0,0,0,"艾丝梅拉达",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	跳过对话()
	延迟(2000)
	回收()
	导航寻路(-1616,2848,2003,坐标数量,坐标表)
	实时移动(-1707,3777,2006.02,400)
	实时移动(-2152.38,4789.51,2003,400)
	王命BOSS(0)
	延迟(7000)
	ishave,x,y,z=范围怪判断2(1,0,0,0,"艾丝梅拉达",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)		
	实时移动(-1533.54,5681.15,2016.92,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	实时移动(-2516.54,5739.25,2007,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	实时移动(-3406.76,5815.62,2003,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	实时移动(-4256,5376,2010,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	延迟(3000)
	-- 更新技能商店()
	-- 延迟(3000)	
	-- 按键(0x4B) --技能更换按键K
	-- 延迟(2000)
	-- 更新技能商店()
	-- 延迟(3000)		
	-- 打开技能背包(5,1)
	-- 延迟(5000)	
	-- 打开购买技能详情("旋风斩")--测试可用- 当前接口必须打开【技能背包】后使用
	-- 延迟(3000)	
	-- 购买技能()--测试可用
	-- 延迟(3000)
	-- 安装技能("旋风斩")--//一个参数，技能名，，前提是用脚本打开了技能背包	
	-- 延迟(2000)
	-- 按键(0x4B) --技能更换按键K
	-- 延迟(2000)
	平面实时移动(-3106.25,4934.82,2002,400)
	平面实时移动(-1659.34,3842.04,2008.44,400)
	平面实时移动(-669.629,2618.73,2010.98,400)
	平面实时移动(1090.29,2967.58,2010,400)
	平面实时移动(2323.26,4327.8,2013.57,400)
	平面实时移动(3293.23,5923.11,2001,400)
	平面实时移动(3431.62,7243.46,2001,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 女神裙摆()----关注一下这个函数的地图名
	while  true do	
		延迟(2000)
		if 取地图名() == "女神裙摆" then
			改写JSON配置("女神裙摆")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("女神裙摆-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{9864.92,10460.6,16},
		{8690.99,11235.4,16},
		{7275.2,11022.6,16},
		{7038.65,9531.05,16},
		{6604.84,8295.84,16},
		{6248.09,6867.05,16},
		{6004.6,5318.17,16},
		{6101.73,3823.17,16},
		{5632.22,2337.49,16},
		{5301.36,1028.95,16},
		{3999.62,432.231,16},
		{2673.09,347.681,16},
		{1487.93,-216.768,16},
		{36.6223,59.814,16},
		{-1261.76,359.259,16.1833},
		{-2683.3,415.801,121.353},
		{-4031.92,605.549,121},
		{11335.2,9066.57,16},
		{10356.3,9379.22,16},
		{10550,7828.93,16},
		{11026.8,6738.92,16},
		{12083.5,5514.64,16},
		{12885.3,4469.64,16},
		{12193.7,3238.96,16},
		{11529.2,2080.26,16},
		{11683.7,611.599,16},
		{11614.1,-792.608,16},
		{11483,-2102.86,16},
		{11564.4,-3427.63,16},
		{11675.3,-4734.07,16},
		{12142,-5979.16,16},
		{12765.3,-7138.39,16},
		{13883.6,-7811.6,16},
		{15350.4,-7336.03,16},
		{15557,-5770.03,16},
		{15282.9,-4255.02,16},
		{16515.2,-5185.5,16},
		{18028.4,-5412.86,16},
		{19551.3,-5080.98,16},
		{20846,-4769.49,16},
		{22348.1,-4722.86,16},
		{23641.2,-4224,16},
		{24485.4,-5255.01,16},
		{25453.2,-6427.62,16},
		{26752,-6528,16},
		{26265.1,-6245.93,16},
		{27749,-6654.52,16},
		{26819.3,-6364.97,16},
		{27941,-6699.62,16},

	}
	坐标数量=#坐标表
	function 三只小怪(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(9864.92,10460.6,16,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)		
			平面实时移动(10730,9060,16,400)
			平面实时移动(10851.4,8055.42,16,400)		
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																								
			local jieguo=BOSS寻路(11376,9312,16)
			if jieguo==3 then
				三只小怪(1)
				return
			end			
			local jieguo=BOSS寻路(11997,8353.76,16)
			if jieguo==3 then
				三只小怪(1)
				return
			end			
			local jieguo=BOSS寻路(11298.4,7963.02,16)
			if jieguo==3 then
				三只小怪(1)
				return
			end			
			local jieguo=BOSS寻路(10774.5,9039.14,16)
			if jieguo==3 then
				三只小怪(1)
				return
			end			
			local jieguo=BOSS寻路(11732.9,9349.4,16)
			if jieguo==3 then
				三只小怪(1)
				return
			end																																											
		end	
	end
	function 王命BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-1616,2848,2003,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			实时移动(-1707,3777,2006.02,400)
			实时移动(-2152.38,4789.51,2003,400)
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																								
			local jieguo=BOSS寻路(-2152.38,4789.51,2003)
			if jieguo==3 then
				王命BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-2819.35,4710.83,2004.79)
			if jieguo==3 then
				王命BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-3536.47,4624.03,2005.5)
			if jieguo==3 then
				王命BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-3770.58,5406.34,2007.92)
			if jieguo==3 then
				王命BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-2656,5120,2003)
			if jieguo==3 then
				王命BOSS(1)
				return
			end																																										
		end	
	end

	导航寻路(9864.92,10460.6,16,坐标数量,坐标表)
	平面实时移动(10730,9060,16,400)
	平面实时移动(10851.4,8055.42,16,400)
	平面实时移动(11744.6,8284.33,16,400)
	三只小怪(0)
	延迟(7000)	
	导航寻路(27941,-6699.62,16,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 遮风壁障()
	while  true do	
		延迟(2000)
		if 取地图名() == "遮风壁障" then
			改写JSON配置("遮风壁障")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("遮风壁障-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-12833,-2146,1603},
		{-11371.4,-2657.8,1603},
		{-10135.6,-3102.37,1603},
		{-9288.49,-4113.77,1611.77},
		{-8524.53,-5286.94,1608},
		{-7145.07,-5803.35,1608},
		{-5795.98,-5126.85,1609.77},
		{-4483.63,-4593.47,1603},
		{-3451.59,-3795.44,1603},
		{-2426.2,-2954.82,1603},
		{-1640.37,-1552.74,1606},
		{-510.24,-906.455,1603},
		{578.885,-149.21,1603},
		{1858.16,-410.913,1585.89},
		{3096.99,-1027.84,1629.06},
		{4438.83,-1442.51,1606.96},
		{5923.37,-1341.7,1603},
		{7475.99,-958.168,1603},
		{8637.38,-372.117,1605},
		{9847.3,455.116,1603},
		{10901.1,1225.55,1609.68},
		{11978.8,2452.31,1603.51},
		{12186.8,3972.57,1603},
		{12306.5,5586.97,1606},
		{12402,3269,1612.89},
		{12385.4,3985.11,1603},
		---遇到BOSS
		{-12833,-2146,1603},
		{-11340.5,-2288.35,1603},
		{-9840.87,-1873.25,1609.69},
		{-8680.66,-954.959,1608},
		{-7368.06,-1521.42,1608},
		{-6065.55,-2303.12,1612.06},
		{-5419.09,-3671.09,1605.71},


	}
	坐标数量=#坐标表
	function 寻猎BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(12385.4,3985.11,1603,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																								
			local jieguo=BOSS寻路(12442.9,5996.67,1607)
			if jieguo==3 then
				寻猎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(11560.4,5853.82,1603)
			if jieguo==3 then
				寻猎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(11246.6,6611.2,1603)
			if jieguo==3 then
				寻猎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(11192.8,5609.28,1603)
			if jieguo==3 then
				寻猎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(12252.3,5836.18,1605)
			if jieguo==3 then
				寻猎BOSS(1)
				return
			end																																											
		end	
	end

	导航寻路(-5795.98,-5126.85,1609.77,坐标数量,坐标表)
	测试(-5520,-3808,1608,100)
	测试(-5023.33,-4143.91,1603,100)
	测试(-4511.91,-4487.43,1603,100)
	测试(-3787.7,-4502.41,1603,100)
	测试(-3338.54,-4114.53,1603,100)
	测试(-2926.94,-3703.7,1603,100)
	测试(-2721.65,-3198.03,1603,100)
	测试(-2515.07,-2638.72,1603,100)
	测试(-2349.63,-2107.12,1603,100)
	测试(-1910.05,-1569.88,1603.78,100)
	测试(-1556.75,-1401.9,1605.35,100)
	导航寻路(-1640.37,-1552.74,1606,坐标数量,坐标表)
	回收()
	测试(-1482.64,-1056,1603,100)
	输出信息("111")
	测试(-779.504,-1078.44,1604,100)
	输出信息("222")
	测试(-231.927,-833.188,1603,100)
	输出信息("333")
	测试(320.796,-424.067,1605,100)
	输出信息("444")
	测试(848.576,-435.286,1610.95,100)
	输出信息("555")
	测试(1374.68,-292.111,1631,100)
	输出信息("666")
	测试(1734.27,-662.314,1618.24,100)
	输出信息("777")
	测试(2250.83,-736.541,1605.83,100)
	输出信息("888")
	测试(2907.19,-830.809,1638.91,100)
	输出信息("999")
	测试(3454.1,-1065.17,1623.26,100)
	输出信息("121212")
	测试(3918.82,-1305.8,1604,100)
	导航寻路(12385.4,3985.11,1603,坐标数量,坐标表)
	平面实时移动(12332,4780,1603,400)
	平面实时移动(12095.7,5621.73,1603.83,400)
	寻猎BOSS(0)
	延迟(7000)	
	平面实时移动(11457.5,7284.52,1603,400)
	平面实时移动(12076,9012.29,1603,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 伊吉聚落()
	while  true do	
		延迟(2000)
		if 取地图名() == "伊吉聚落" then
			改写JSON配置("伊吉聚落")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("伊吉聚落-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{4416,5760,859},
		{3414.56,4644.17,845},
		{2083.87,4315.79,848.934},
		{721.458,3821.7,847.214},
		{-488.718,2963.79,846},
		{-1694.93,2075.52,845},
		{-3164.57,1852.25,845},
		{-4573.36,1571.82,845},
		{-5252.01,311.717,852.745},
		{-4767.09,-1044.55,845},
		{-4379.63,-2490.53,853.829},
		{-3589.91,-3627.67,849.315},
		{-2147.59,-4028.62,846.789},
		{-1031.2,-4919.46,845},
		{-1052.73,-6375.84,845},
		{-2166.08,-7206.37,845},
		{-3603.74,-6998.37,851.966},
		{-5062.1,-6808.08,854.938},
		{-6450.72,-7175.51,849},
		{-6614.25,-8656.9,850},
		{-7316.82,-9930.03,851.879},
		{-8660.89,-10379.9,846},
		{-9936.05,-9737.95,845},
	}
	坐标数量=#坐标表
	function 刑讯BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(4416,5760,859,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 11 then																									
			local jieguo=BOSS寻路(5152,6976,845)
			if jieguo==3 then
				刑讯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(5696.51,6236.08,845)
			if jieguo==3 then
				刑讯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(6466.26,6273.2,848.089)
			if jieguo==3 then
				刑讯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(5500.51,6447.4,845)
			if jieguo==3 then
				刑讯BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(5424.3,6013.55,845.077)		
			if jieguo==3 then
				刑讯BOSS(1)
				return
			end	
			else
				break	
			end																																												
		end	
	end

	导航寻路(4416,5760,859,坐标数量,坐标表)
	回收()
	平面实时移动(5300,6200,845,400)
	平面实时移动(5860.93,6858.38,845,400)
	刑讯BOSS(0)
	延迟(5000)	
	跳过动画()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	ishave,x,y,z=范围怪判断2(1,0,0,0,"艾丝梅拉达",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)		
	平面实时移动(6547.68,6778.65,857.532,400)
	平面实时移动(7633.78,8539.51,845,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 雄狮之心()
	while  true do	
		延迟(2000)
		if 取地图名() == "雄狮之心" then
			改写JSON配置("雄狮之心")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("雄狮之心-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-21843.3,7812.25,1830},
		{-20554,8196.56,1832},
		{-20097.3,9500.64,1771.92},
		{-19420.6,10655.2,1608},
		{-17933.9,10612.8,1355.31},
		{-16622.9,10164.3,1325},
		{-15877.7,8991.97,1323.32},
		{-14829.7,8132.02,1328.25},
		{-13627.8,7587.75,1337.25},
		{-12711.8,6516.96,1333.55},
		{-11786,5261.35,1325},
		{-10375.5,5027.48,1351.11},
		{-9293.94,4221.75,1390.98},
		{-9248.81,2722.11,1374.02},
		{-9376,1280,1318},
		{-9851.19,-56.1078,1347},
		{-11094.7,-599.691,1500.72},
		{-12274.3,-1508.67,1575},
		{-12499,-2929.9,1580},
		{-11896.3,-4153.18,1582.48},
		{-10690.7,-4663.34,1756.37},
		{-9349.35,-4592.63,1890},
		{-8283.99,-3691.78,1898},
		{-6964.52,-3305.05,2077.15},
		{-5729.86,-2492.64,2100},
		{-4382.77,-1926.17,2107.9},
		{-2912.36,-1913.27,2225.42},
		{-1574.43,-1488.31,2208.51},
		{-109.228,-1663.31,2205},
		{1351.77,-1723.58,2209},
		{2817.47,-1863.08,2223.71},
		{4380.67,-1872.43,2127},
		{4970.52,-3193.88,2100.58},
		{5382.96,-4493.92,2103},
		{6305.03,-5634.07,2100},
		{7697.06,-5984,2100},
		{9062.21,-6550.35,2128.71},
		{10539.8,-6528.48,2658.6},
		{11837.1,-7044.76,2705.07},
		{13055.1,-7961.21,2721},
		{11927.1,-7085.66,2709.43},
		{11783.2,-5604,2705},
		{13033.1,-4855.9,2706.41},
		{14383.4,-4757.49,2711},
		{15317.2,-5813.87,2725.5},
		{14604.2,-7219.92,2710.57},
		{13548.3,-8055.63,2722.23},
		{12259.6,-7524.1,2724},
		{11934.9,-6259.58,2711.58},
		{12440.9,-4913.38,2705},
		{13490.2,-3867.68,2723},
		{13742.5,-2481.39,2812.77},
		{13851.8,-996.297,2810},
		{13835.3,355.03,2749.38},
		{14523.2,1554.67,2709},
		{15451.7,2638.26,2706.86},
		{14928.5,3871.07,2714.03},
		{13595.7,3848.58,2726.13},
		{12354.6,3336.97,2709},
		{11853.9,1898.09,2709.52},
		{12979.5,1123.71,2734.95},
		{14218.9,728.548,2728.39},
		{13635.8,-664.271,2812.24},
		{13711,-2129.4,2812.54},
		{11548.2,-6431.47,2709},
		{13871.8,1057.33,2710.04},
		{13343.6,2046.15,2711.1},
		{11930.7,2282.58,2714.33},
		{10728.5,3103.19,2711.01},
		{9250.76,3218.77,2419.59},
		{7856.46,2910.63,2418.99},
		{6438.39,2660.34,2402.8},
		{5210.88,2142.49,2132.49},
		{4994.91,700.06,2100},
		{5282.68,-763.111,2127.4},
		{6264.96,-1692.5,2031.32},
		{7604.49,-1726.44,1834.74},
		{3880,-1580,2144.44},
		{5463.48,-1455.58,2114.03},
		{5923.86,-1589.28,2105.67},
		
	}
	坐标数量=#坐标表
	function 电源(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(11548.2,-6431.47,2709,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 2 then																							
			local jieguo=BOSS寻路(12140.4,-5226,2707.89)
			if jieguo==3 then
				电源(1)
				return
			end				
			local jieguo=BOSS寻路(13723.5,-4628.27,2721)
			if jieguo==3 then
				电源(1)
				return
			end				
			local jieguo=BOSS寻路(15222,-5107.85,2708.62)
			if jieguo==3 then
				电源(1)
				return
			end				
			local jieguo=BOSS寻路(15178,-6352.52,2730)
			if jieguo==3 then
				电源(1)
				return
			end				
			local jieguo=BOSS寻路(14457,-7406.54,2713.23)
			if jieguo==3 then
				电源(1)
				return
			end				
			local jieguo=BOSS寻路(13332.8,-8215.44,2724)
			if jieguo==3 then
				电源(1)
				return
			end				
			local jieguo=BOSS寻路(11994.5,-7435.14,2722.7)
			if jieguo==3 then
				电源(1)
				return
			end				
			local jieguo=BOSS寻路(11547.8,-6464.63,2709.03)
			if jieguo==3 then
				电源(1)
				return
			end	
			else
				break	
			end																																															
		end	
	end
	function 电源1(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(13871.8,1057.33,2710.04,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end	
			计次=计次+1
			if 计次 < 2 then																										
			local jieguo=BOSS寻路(13871.8,1057.33,2710.04)
			if jieguo==3 then
				电源1(1)
				return
			end			
			local jieguo=BOSS寻路(12654.3,979.081,2738.8)
			if jieguo==3 then
				电源1(1)
				return
			end			
			local jieguo=BOSS寻路(12112.8,2461.71,2719.93)
			if jieguo==3 then
				电源1(1)
				return
			end			
			local jieguo=BOSS寻路(12675.3,3865.88,2714.57)
			if jieguo==3 then
				电源1(1)
				return
			end			
			local jieguo=BOSS寻路(15034.2,4252.78,2725.39)
			if jieguo==3 then
				电源1(1)
				return
			end			
			local jieguo=BOSS寻路(15709.6,3034.08,2719.13)
			if jieguo==3 then
				电源1(1)
				return
			end			
			local jieguo=BOSS寻路(15446.1,1789.81,2710.69)
			if jieguo==3 then
				电源1(1)
				return
			end			
			local jieguo=BOSS寻路(14327.8,910.595,2716.63)
			if jieguo==3 then
				电源1(1)
				return
			end	
			else
				break	
			end																																														
		end	
	end
	function 狮心BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(5923.86,-1589.28,2105.67,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			实时移动(7290,-1720,1843.44,400)
			实时移动(8793.04,-1524.33,1807.22,400)
				
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			local nihao =已接任务ID判断(0x11cea3)---参数为任务ID，成功返回1 --在控制台脚本工具中查看任务ID
			if nihao == 1 then
				break
			end				
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end	
			local nihao =已接任务ID判断(0x11cea3)---参数为任务ID，成功返回1 --在控制台脚本工具中查看任务ID
			if nihao == 1 then
				break
			end				
			计次=计次+1
			if 计次 < 8 then																										
			local jieguo=BOSS寻路(8950.33,-1044.86,1805.8)
			if jieguo==3 then
				狮心BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9354.75,-2093.59,1805)
			if jieguo==3 then
				狮心BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8525.47,-2114.01,1808.06)
			if jieguo==3 then
				狮心BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8400,-1312,1810)
			if jieguo==3 then
				狮心BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9456.29,-1609.68,1805)
			if jieguo==3 then
				狮心BOSS(1)
				return
			end	
			else
				break	
			end				
		end	
	end
	导航寻路(11548.2,-6431.47,2709,坐标数量,坐标表)
	电源(0)
	平面实时移动(12928,-6272,2706,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(7000)	
	回收()
	导航寻路(13871.8,1057.33,2710.04,坐标数量,坐标表)
	电源1(0)
	平面实时移动(13843,2074.9,2705.16,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(7000)	
	回收()
	导航寻路(5923.86,-1589.28,2105.67,坐标数量,坐标表)
	实时移动(7290,-1720,1843.44,400)
	延迟(2000)
	跳过动画()
	实时移动(8793.04,-1524.33,1807.22,400)
	跳过动画()
	延迟(2000)
	跳过动画()
	延迟(2000)
	跳过动画()
	延迟(3000)
	狮心BOSS(0)
	延迟(2000)
	跳过动画()
	延迟(3000)	
	ishave,x,y,z=范围怪判断2(1,0,0,0,"阿瑞娅",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)		
	按键加强("t")
	延迟(6000)
	按键(0x44) --按键D
	延迟(5000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	平面实时移动(1978.76,-2419.22,2007.4,400)
	平面实时移动(3163.21,-2530.93,2012.56,400)
	平面实时移动(4234.61,-3479.95,2004.25,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)		
	对话选项("伊吉公民")
	延迟(2000)	
	跳过对话()
	延迟(5000)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)		
	对话选项("再加些筹码")
	延迟(2000)	
	跳过对话()
	延迟(5000)		
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)		
	平面实时移动(2220.6,-2244.95,2012,400)
	平面实时移动(942.714,55.8215,2054.16,400)
	平面实时移动(-221.955,951.092,2032.2,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)		
	打开世界关卡("预言圣地")
	延迟(2000)
	进入世界关卡()	
	延迟(5000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)								
end
function 预言圣地()
	while  true do	
		延迟(2000)
		if 取地图名() == "预言圣地" then
			改写JSON配置("预言圣地")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("预言圣地-脚本退出挂机流程")
			return
		end	
	end
local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-1985.92,2663.35,1236},
		{-3164.97,2049.61,1236},
		{-4402.74,1595.19,1236},
		{-5781.99,1379.62,1236},
		{-7191.75,2038.99,1236},
		{-8770.83,1843.1,1236},
		{-8767.04,237.064,1236},
		{-9160.72,-1055.28,1236},
		{-10258.3,-1959.71,1236},
		{-11712.9,-2097.27,1236},
		{-13071.6,-1540.07,1236},
		{-12998.4,-2867.24,1236},
		{-13497.8,-1518.81,1236},
		{-12897.8,-2136.6,1236},
		{-13076.3,-1538.54,1236},
		---遇到BOSSAAA
		{-13808,-1440,1236},
		{-13655.5,-1359.61,1236},
		---遇到BOSS
		{-12467.5,-1980.4,1236},
		{-10862.5,-2182.21,1236},
		{-9722.56,-1530.45,1236},
		{-8128.7,-1132.97,1236},
		{-7047.82,-39.5955,1236},
		{-6050.73,1152.07,1236},
		{-4747.05,1019.49,1236},
		{-3367.56,1820.21,1236},
		{-2173.34,2382.65,1236},
		{-1568,3136,1236},
		---遇到BOSS
		{-379.995,1916.59,1236},
		---遇到BOSS对话
		{543.73,2976,1236},
		{1112,4158.64,1236},
		{876.757,5754.3,1236},
		{423.042,6980.08,1236},
		{150.26,8272.27,1236},
		{27.2532,9583.77,1236},
		{292.841,10905,1236},
		{-180.303,12367.7,1236},
		{-520.242,13844.5,1236},
		{110.679,14995.1,1236},
		{259.841,16386,1236},
		{230.19,17715.5,1236},
		{622.949,19295.5,1236},
		{522.586,20607.5,1236},
		{-829.93,20266.8,1236},
		{-166.47,19119.9,1236},
		{-176,18784,1236},
		---遇到BOSS
		{-976,18912,1236},
		---遇到BOSS
		{358.433,18848,1236},
		{1248,18944,1236},
		---遇到BOSS
		{346.934,20123.9,1236},
		{-277.165,18772.8,1236},
		{-304,18336,1236},
		---遇到BOSS
		{464,18144,1236},
		---遇到BOSS
		{327.137,19599.9,1236},
		{1357.65,18640.2,1236},
		{1570.93,18480.7,1236},
		---遇到BOSS
		{1936,19424,1236},
		---遇到BOSS
		{2460.59,18633.9,1236},
		---遇到BOSS
		{2224,17760,1236},
		---遇到BOSS
		{1360,17568,1236},
		---遇到BOSS
		{539.384,17430.2,1236},
		---遇到BOSS
		{-368,17376,1236},
		---遇到BOSS
		{-1072,17568,1236},
		---遇到BOSS
		{-2018.37,17758.2,1236},
		---遇到BOSS
		{-1416.39,18142.3,1236},
		---遇到BOSS
		{-2208,18624,1236},
		---遇到BOSS
		{-1888,19264,1236},
		---遇到BOSS
		{-573.619,19918.8,1236},
		{124.666,20328.8,1236},
		---遇到BOSS
		{402.216,18788.4,1236},
		{294.607,17176,1236},
		{347.225,15867,1236},
		{54.4967,14453.8,1236},
		{-581.479,13134,1236},
		{84.1249,12014.1,1236},
		{450.786,10506,1236},
		{134.177,9228.09,1236},
		{231.206,7911.07,1236},
		{711.055,6373.08,1236},
		{1210.01,5138.96,1236},
		{1168.42,3576.29,1236},
		{361.668,2419.22,1236},
		{1112,3623.46,1236},
		{1107.33,5147.43,1236},
		{-197.449,5715.06,1236},
		{-32,5888,1236},
		---遇到BOSS
		{1339.44,5454.85,1236},
		{1735.69,4118.98,1236},
		{995.791,2976,1236},
		{-55.4098,2162.51,1236},
		{-360.68,2017.21,1236},
		---遇到BOSS对话
		{1046.09,2384.42,1236},
		{2362.37,2368.24,1236},
		{3708.94,1766.36,1236},
		{4899.09,1191.59,1236},
		{6453.44,784.239,1236},
		{7519.55,18.211,1236},
		{8089.02,-1165.29,1236},
		{8563.12,-2613.78,1236},
		{0,0,0},
		{9048.67,-2782.54,1236},
		{10436.9,-2716.88,1236},
		{11996.4,-3155.2,1236},
		{13219.7,-3948.55,1236},
		{13941.2,-5052.08,1236},
		{15402.2,-5570.45,1236},
		{16618.1,-6045.19,1236},
		{17984,-5888,1236},
		{17408,-6144,1236},
		---遇到BOSS
		{16238.9,-5500.57,1236},
		{14732.7,-5108.35,1236},
		{13446.5,-4199.12,1236},
		{12496.3,-3004.95,1236},
		{11433.2,-2239.89,1236},
		{9914.91,-2434.07,1236},
		{8599.25,-2518.39,1236},
		{7708.34,-1298.36,1236},
		{7164.76,-94.8746,1236},
		{6582.42,644.466,1236},
		{5300.66,910.28,1236},
		{3864.35,1628.85,1236},
		{2750.72,2355.43,1236},
		{1606.89,3907.03,1236},
		{1442.79,2949.58,1236},
		{1488,3104,1236},
		---遇到BOSS
		{352,3840,1230},
		{1843.61,3303.19,1236},
		{12414.7,-3125.06,1236},
		{240,5728,1236},
		{2256.07,2572.36,1236},
		---遇到BOSS
	}
	坐标数量=#坐标表
	function 杀欲BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-13076.3,-1538.54,1236,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end	
			计次=计次+1
			if 计次 < 8 then																									
			local jieguo=BOSS寻路(-12850.8,-2388.63,1236)
			if jieguo==3 then
				杀欲BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-12207.8,-1481.24,1236)
			if jieguo==3 then
				杀欲BOSS(1)
				return
			end		
			else
				break	
			end																																														
		end	
	end	
	导航寻路(-360.68,2017.21,1236,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	对话选项("杀戮试炼")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	导航寻路(-13655.5,-1359.61,1236,坐标数量,坐标表)
	延迟(5000)	
	杀欲BOSS(0)
	延迟(3000)
	导航寻路(-13655.5,-1359.61,1236,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	导航寻路(-1568,3136,1236,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	导航寻路(-360.68,2017.21,1236,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	对话选项("权力试炼")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	导航寻路(1606.89,3907.03,1236,坐标数量,坐标表)
	导航寻路(-176,18784,1236,坐标数量,坐标表)
	回收()
	测试(-32.2087,18815.6,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(1120,18944,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(2192,19360,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(2416,18592,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(1407.41,18555.8,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(592,18336,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(-464,18336,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(-1248,18368,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(-2072.25,18561.4,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(-2064,19168,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(-1952,17600,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(-1072,17568,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(-368.777,17373,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(588.064,17405.1,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(1360,17568,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	测试(2254.14,17806.1,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	鼠标右键点击()
	延迟(800)
	按键加强("w")	
	延迟(800)
	按键加强("e")		
	导航寻路(124.666,20328.8,1236,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	导航寻路(240,5728,1236,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	导航寻路(2256.07,2572.36,1236,坐标数量,坐标表)
	导航寻路(-360.68,2017.21,1236,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	对话选项("美欲试炼")
	延迟(2000)
	跳过对话()
	延迟(2000)		
	--导航寻路(17408,-6144,1236,坐标数量,坐标表)
	回收()
	导航寻路(12414.7,-3125.06,1236,坐标数量,坐标表)			
	测试(12410.7,-2990.58,1236,100)
	测试(12944.5,-3512.98,1236,100)
	测试(13437.1,-4032.89,1236,100)
	测试(13820,-4480,1236,100)
	跳过动画()
	测试(14212.6,-4924.46,1236,100)
	测试(14610.5,-5375.03,1236,100)
	跳过动画()
	测试(14914.7,-5837.41,1236,100)
	测试(15230.9,-6348.31,1236,100)
	测试(15736,-6682.65,1236,100)
	测试(16405.6,-6894.21,1236,100)
	测试(16879,-6629.04,1236,100)
	测试(17403.6,-6335.18,1236,100)
	测试(17568,-6144,1236,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	测试(17019.5,-6674.02,1236,100)
	测试(16426.8,-6848.43,1236,100)
	测试(15918.2,-6768.2,1236,100)
	测试(15496.7,-6390.14,1236,100)
	测试(15095.5,-6008.63,1236,100)
	测试(14706,-5571.26,1236,100)
	测试(14308.9,-5105.99,1236,100)
	测试(13946.4,-4632.93,1236,100)
	测试(13582.3,-4157.84,1236,100)
	测试(13152.8,-3839.28,1236,100)
	测试(12676,-3491.13,1236,100)	
	导航寻路(1488,3104,1236,坐标数量,坐标表)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(10000)
	导航寻路(352,3840,1230,坐标数量,坐标表)	
	延迟(2000)
	测试(336,3872,1230,100)
	延迟(2000)
	按键(0x44) --按键D
	延迟(10000)									
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 永恒广场()
	while  true do	
		延迟(2000)
		if 取地图名() == "永恒广场" then
			改写JSON配置("永恒广场")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("永恒广场-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-11135.8,706.654,-709},
		{-9628.11,882.248,-269.053},
		{-8226.05,810.686,-107.833},
		{-6867.9,750.976,-106.122},
		{-5431.53,907.74,488.059},
		{-4052.3,928,506},
		{-2726.09,549.843,505},
		{-1242.89,286.437,455.125},
		{69.1404,520.767,505},
		{1596.23,448.26,512.886},
		{2863.8,642.472,951.9},
		{4326.86,904.813,1108},
		{5742.73,934.055,1586.37},
		{7051.31,704,1710},
		{8464.3,687.471,1714},
		{8636.14,691.082,1714.68},
		{7032.2,815.939,1710},
		{5574.12,777.72,1502.06},
		{4307.11,690.656,1106},
		{2964.19,824.121,1002.09},
		{1550.09,670.766,511.921},
		{144.113,747.344,505},
		{-1196.59,1079.84,451.437},
		{-1800.2,921.887,433},
		---遇到BOSS
		{-1917.8,1953.07,505},
		{-1484.61,3422.37,505},
		{-1599.23,4928.66,594.328},
		{-1471.83,6146.84,1112},
		{-1505.63,7590.31,1105},
		

	}
	坐标数量=#坐标表
	function 皓月小BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-1800.2,921.887,433,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 11 then																									
			local jieguo=BOSS寻路(-1859.56,282.846,445.701)
			if jieguo==3 then
				皓月小BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-1735.56,1089.5,434.047)
			if jieguo==3 then
				皓月小BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-1144.44,703.455,449.447)
			if jieguo==3 then
				皓月小BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-2016,640,431)
			if jieguo==3 then
				皓月小BOSS(1)
				return
			end		
			else
				break	
			end																																												
		end	
	end
	function 皓月小BOSS1(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-1471.83,6146.84,1112,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 7 then																									
			local jieguo=BOSS寻路(-1807.92,7640.28,1105)
			if jieguo==3 then
				皓月小BOSS1(1)
				return
			end				
			local jieguo=BOSS寻路(-1556.76,7939.37,1105)
			if jieguo==3 then
				皓月小BOSS1(1)
				return
			end				
			local jieguo=BOSS寻路(-1633.42,7485.92,1105)
			if jieguo==3 then
				皓月小BOSS1(1)
				return
			end				
			local jieguo=BOSS寻路(-1913.22,8009.41,1105.29)
			if jieguo==3 then
				皓月小BOSS1(1)
				return
			end		
			else
				break	
			end																																												
		end	
	end

	导航寻路(8636.14,691.082,1714.68,坐标数量,坐标表)
	平面实时移动(8636.14,691.082,1714.68,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	对话选项("冠军之路")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)		
	导航寻路(-1800.2,921.887,433,坐标数量,坐标表)
	延迟(2000)
	皓月小BOSS(0)
	延迟(2000)
	导航寻路(-1471.83,6146.84,1112,坐标数量,坐标表)
	皓月小BOSS1(0)
	实时移动(-1526.49,9011.72,1133.06,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 皓月之路()
	while  true do	
		延迟(2000)
		if 取地图名() == "皓月之路" then
			改写JSON配置("皓月之路")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("皓月之路-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{1080,270,503},
		{1143.23,1714.62,503},
		{880.398,3203.26,503},
		{676.317,4603.46,503},
		{1070.34,5919.06,503},
		{1200.72,7397.88,503},
		{1199.72,8965.22,503},
		{1063.58,10519.1,503},
		{941.823,11925.8,503},
		{1054.97,13539.5,503},
		{1139.4,13876.7,503},
		---遇到BOSS
		{1156.81,15252.9,503},
		{1062.5,16720.1,503},
		{1069.08,18121.8,503},
		{1238.92,19684.4,503},
		{822.568,20926.4,503},
		{-346.948,21520.7,503},
		{-921.21,21619.7,503},
		---遇到BOSS
		{275.203,22613.1,503},
		{1561.11,22368,503},
		{1239.44,20977.5,503},
		{-81.1476,21504,503},
		{-1424.31,21880.4,503},
		{-2783.16,21797,503},
		{-4252.86,21873.9,503},
		{-5640.99,21899.7,503},
		{-6975.43,21884.9,503},
		{-8413.35,21791.8,503},
		{-9797.12,21621.8,503},
		{-10449.3,20335.9,503},
		{-10516.5,20285.8,503},
		---遇到BOSS
		{-10495.5,18945.1,503},
		{-10410.1,17623.9,503},
		{-10342.2,16191.4,503},
		{-10469.7,14664.7,503},
		{-10701.7,13193.9,503},
		{-12193.3,13280,503},
		{-13307.7,12608,503},
		{-14576,13216,503},
		{-15510.1,12860.3,503},
		---遇到BOSS
		{-15523.3,11276.6,503},
		{-15522.6,9795.72,503},
		{-15550.9,8295.34,503},
		{-15576.5,6777.64,503},
		{-15496.8,5421.52,503},
		{-16565.5,4266.95,503},
		{-17813.8,3846.55,503},
		{-19149.5,3872.67,503},
		{-20471.4,3900.99,503},
		{-21947.8,3893.08,503},
		{-23413.7,3865.77,503},
		{-23615.6,4282.42,503},
		---遇到BOSS
		{-25099.7,4104.9,503},
		{-24420.1,2813.3,503},
		{-23297.4,3541.29,503},
		{-24428.1,2832.73,503},
		{-23189.9,3620.75,503},
		{-21867.1,3877.47,503},
		{-20479.1,3877.77,503},
		{-18991.3,3804.05,503},
		{-17661.7,3909.15,503},
		{-16402.9,4324.11,503},
		{-15040.9,4688.43,503},
		{-13799.1,3936,503},
		{-12280.8,3936,503},
		{-10975.9,3941.62,503},
		{-9613.35,3896.28,503},
		{-8304,3936,503},
		{-8304,3936,503},
		---遇到BOSS
		{-7079.82,4803.21,503},
		{-6322.94,3592.74,503},
		{-7594.68,2983.12,503},
		{-8023.72,4327.96,503},
		{-9484.57,3915.2,503},
		{-10811.1,3876.2,503},
		{-12359,3808,503},
		{-13845.5,3876.76,503},
		{-14968.9,2823.98,503},
		{-15592.5,1393.14,503},
		{-15567.2,-117.745,503},
		{-15542.3,-1608.04,503},
		{-15517.2,-3106.9,503},
		{-15485.7,-4566.31,503},
		{-15693,-5656.06,503},
		---遇到BOSS
		{-14952.8,-6737.01,503},
		{-15877,-7712,503},
		{-16938,-6782.67,503},
		{-16184,-5597.85,503},
		{-15027.9,-6676.05,503},
		{-15955.7,-7776,503},
		{-15573.9,-6330.28,503},
		{-15173.1,-6125.01,503},
		{-15410.1,-7595.97,503},
		{-15402.8,-9087.69,503},
		{-15708.2,-10548.6,503},
		{-15708.3,-12047.9,503},
		{-15730,-12648.7,503},
		{-20916.4,3844.44,503},
		{-10532.9,3827.47,503},
		{7840,6848,1105},
		{8030.9,5472.62,1458.69},
		{7934.25,4057.15,1731.55},
		{7878.51,2593.54,1710},
		{7409.28,1187.22,1710},
		{6166.54,624.489,1723.41},
		{4965.41,571.626,1194.54},
		{3465.68,557.117,1108},
		{1965.79,513.27,524.411},
		{850.853,-228.892,505},
		{944,-1568,505},
		{691.958,-255.735,505},
		{-585.609,330.631,505},
		{-1191.92,-896.516,505},
		{-1481.4,-2365.6,520.85},
		{-1562.9,-3862.38,994.849},
		{-1469.33,-5354.15,1105.2},
		{-1630.41,-6827.75,1109.47},
		{-1458.94,-7329.23,1106.92},		
	}
	坐标数量=#坐标表
	function 皓月1BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-20916.4,3844.44,503,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																									
			local jieguo=BOSS寻路(-24631.8,4702.38,503)
			if jieguo==3 then
				皓月1BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-25232.1,3632.62,503)
			if jieguo==3 then
				皓月1BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-24048,2720,503)
			if jieguo==3 then
				皓月1BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-23194.4,3687.83,503)
			if jieguo==3 then
				皓月1BOSS(1)
				return
			end		
			else
				break	
			end																																												
		end	
	end
	function 皓月2BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-10532.9,3827.47,503,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																									
			local jieguo=BOSS寻路(-7289.68,4963.65,503)
			if jieguo==3 then
				皓月2BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-6240,3937.91,503)
			if jieguo==3 then
				皓月2BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-7634.95,2610.64,503)
			if jieguo==3 then
				皓月2BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-8574.69,3847.57,503)
			if jieguo==3 then
				皓月2BOSS(1)
				return
			end				
			else
				break	
			end																																												
		end	
	end
	function 皓月3BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-10532.9,3827.47,503,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end		
			if name == "永恒广场（皓月）" then
				break
			end								
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																												
			local jieguo=BOSS寻路(-16399.7,-7059.08,503)
			if jieguo==3 then
				皓月3BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-15437.4,-7421.28,503)
			if jieguo==3 then
				皓月3BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-15877.8,-8378.86,503)
			if jieguo==3 then
				皓月3BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-15092.5,-7023.9,503)
			if jieguo==3 then
				皓月3BOSS(1)
				return
			end				
			else
				break	
			end																																												
		end	
	end
	function 循环()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																									
			BOSS寻路(1520,12384,503)
			BOSS寻路(959.549,12257.9,503)
			BOSS寻路(960,13376,503)
			BOSS寻路(1254.83,11773.2,503)			
			else
				break	
			end																																												
		end	
	end
	function 循环1()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																									
			BOSS寻路(-217.937,22230.9,503)
			BOSS寻路(358.401,21903.4,503)
			BOSS寻路(499.393,21065.8,503)
			BOSS寻路(-440.986,21584.2,503)	
			else
				break	
			end																																												
		end	
	end
	function 循环2()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 5 then																									
			BOSS寻路(-11331.3,21156.2,503)
			BOSS寻路(-11409,22042.2,503)
			BOSS寻路(-10525.6,22661.6,503)
			BOSS寻路(-9895.34,22102.6,503)
			BOSS寻路(-9796.2,21279.9,503)
			BOSS寻路(-10459.5,20931,503)
			else
				break	
			end																																												
		end	
	end
	function 循环3()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 5 then																									
			BOSS寻路(-15853.7,13799.8,503)
			BOSS寻路(-15364.3,13325.3,503)
			BOSS寻路(-15793.1,12828.8,503)
			BOSS寻路(-15967.8,12382.9,503)
			else
				break	
			end																																												
		end	
	end
	导航寻路(1139.4,13876.7,503,坐标数量,坐标表)
	循环()
	导航寻路(-921.21,21619.7,503,坐标数量,坐标表)
	循环1()
	导航寻路(-10516.5,20285.8,503,坐标数量,坐标表)
	回收()
	循环2()
	导航寻路(-15510.1,12860.3,503,坐标数量,坐标表)
	循环3()
	导航寻路(-23615.6,4282.42,503,坐标数量,坐标表)
	皓月1BOSS(0)
	导航寻路(-8304,3936,503,坐标数量,坐标表)
	皓月2BOSS(0)
	导航寻路(-15693,-5656.06,503,坐标数量,坐标表)
	皓月3BOSS(0)
	延迟(2000)
	平面实时移动(-16059.7,-8476.2,503,300)
	平面实时移动(-15936,-9728,503,300)
	平面实时移动(-15745.9,-11633.2,503,300)
	平面实时移动(-15665.4,-13141.3,503,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	导航寻路(-1458.94,-7329.23,1106.92,坐标数量,坐标表)
	延迟(10000)
	平面实时移动(-1458.94,-7329.23,1106.92,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)							
end
function 繁星之路()
	while  true do	
		延迟(2000)
		if 取地图名() == "繁星之路" then
			改写JSON配置("繁星之路")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("繁星之路-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-580,2510,502},
		{-2044.18,2471.14,502},
		{-3534.98,2464.79,502},
		{-5044.88,2458.73,502},
		{-6536.18,2451.29,502},
		{-7921.54,2444.36,502},
		{-9359.78,2422.44,502},
		{-9359.78,2422.44,502},
		{-8066.56,3053.53,502},
		{-9207.15,2128.43,502},
		{-7881.43,1449.01,502},
		{-7590.45,579.145,502},
		---遇到BOSS
		{-7524.24,-861.691,502},
		{-7461.47,-2412.01,502},
		{-7482.63,-3909.64,502},
		{-8082.92,-5146.35,502},
		{-9605.19,-5248,502},
		{-10940.7,-5277.66,502},
		{-12446.5,-5396.53,502},
		{-13912,-5470.47,502},
		{-15450,-5312,502},
		{-16902.8,-5318.03,502},
		{-17664.6,-4066.59,502},
		{-17562.6,-2595.6,502},
		{-17438.5,-1134.27,502},
		{-17890.9,261.701,502},
		{-17624.3,1795.22,502},
		{-17422.6,3229.28,502},
		{-16606.3,4519.47,502},
		{-17075.1,5871.95,502},
		{-17580.6,7190.13,502},
		{-17590.2,8659.49,502},
		{-17754.9,10168.8,502},
		{-17477.3,11470.3,502},
		{-17337.6,12940.8,502},
		{-16106.8,13759.2,502},
		{-15760,13664,502},
		---遇到BOSS
		{-14347.2,13720.8,502},
		{-12848.5,13672.5,502},
		{-11351.5,13583.5,502},
		{-9851.36,13611,502},
		{-8495.58,13632,502},
		{-7165.57,13592.2,502},
		{-5790.39,13820.7,502},
		{-5046.87,12673,502},
		{-3882.76,12083.8,502},
		{-2391.92,12031.9,502},
		{-887.532,12000,502},
		{571.987,12095,502},
		{1929.7,12225.5,502},
		{2417.67,13596.7,502},
		{2580.6,13644.1,502},
		---遇到BOSS
		{2969.9,12238.2,502},
		{2396.45,11031.5,502},
		{1136.03,11739.1,502},
		{2052.22,12866.8,502},
		{3211.14,11716.3,502},
		{1686.44,11904,502},
		{2473.55,13088,502},
		{2867.92,11806.1,502},
		{2400.29,13196.3,502},
		{2302.61,14702.3,502},
		{2500.49,16176.9,502},
		{2474.85,17674.6,502},
		{2491.77,19176.5,502},
		{2446.95,20578.9,502},
		{2445.82,22116.4,502},
		{2442.35,23194.4,502},
		{2442.35,23194.4,502},
		---遇到BOSS
		{2341.04,24722.5,502},
		{2389.67,26212.1,502},
		{2413.43,27569.5,502},
		{2452.82,28948.7,502},
		{2999.67,30255.9,502},
		{4260.63,30826.1,502},
		{4075.18,30762.1,502},
		---遇到BOSS
		{5652.93,30720,502},
		{7075.3,30694.2,502},
		{8568.19,30691.2,502},
		{10057.2,30735.4,502},
		{11580.3,30846.3,502},
		{12897.9,31011.7,502},
		{14189.2,31381.7,502},
		{15005.4,30341.3,502},
		{14321.4,30677.6,502},
		---遇到BOSS
		{13982.3,31939.3,502},
		{14660.1,30821.8,502},
		{13940.2,29711.1,502},
		{9734,30691,502},
		{10184.3,30850.1,502},
		---传送
		{2466,19590,502},
		{2643.7,20914.3,502},
		{2434.86,22304.1,502},
		{2446.04,23805.8,502},
		{2501.14,25365.2,502},
		{2564.95,26892.9,502},
		{2522,28361.5,502},

	}
	坐标数量=#坐标表
	function 繁星BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(10184.3,30850.1,502,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(10500)
			if name == "永恒广场（繁星）" then
				break
			end						
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 11 then																									
			local jieguo=BOSS寻路(14277,30605.4,502)
			if jieguo==3 then
				繁星BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(13717.1,29206.3,502)
			if jieguo==3 then
				繁星BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(12685.4,29962.4,502)
			if jieguo==3 then
				繁星BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(12592.6,31605.6,502)
			if jieguo==3 then
				繁星BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(14458.3,31201.4,502)
			if jieguo==3 then
				繁星BOSS(1)
				return
			end	
			else
				break	
			end																																												
		end	
	end
	function 皓月2BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-10532.9,3827.47,503,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 11 then																									
			local jieguo=BOSS寻路(-7289.68,4963.65,503)
			if jieguo==3 then
				皓月2BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-6240,3937.91,503)
			if jieguo==3 then
				皓月2BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-7634.95,2610.64,503)
			if jieguo==3 then
				皓月2BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-8574.69,3847.57,503)
			if jieguo==3 then
				皓月2BOSS(1)
				return
			end				
			else
				break	
			end																																												
		end	
	end
	function 皓月3BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-10532.9,3827.47,503,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,5000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 11 then																												
			local jieguo=BOSS寻路(-16399.7,-7059.08,503)
			if jieguo==3 then
				皓月3BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-15437.4,-7421.28,503)
			if jieguo==3 then
				皓月3BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-15877.8,-8378.86,503)
			if jieguo==3 then
				皓月3BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-15092.5,-7023.9,503)
			if jieguo==3 then
				皓月3BOSS(1)
				return
			end				
			else
				break	
			end																																												
		end	
	end
	function 繁星循环()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																									
			BOSS寻路(-8093.05,1496.7,502)
			BOSS寻路(-7516,1905.1,502)
			BOSS寻路(-7913.97,2832.46,502)
			BOSS寻路(-7841.29,1372.93,502)		
			else
				break	
			end																																												
		end	
	end
	function 繁星循环1()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																									
			BOSS寻路(-16672.9,13653.3,502)
			BOSS寻路(-17030.5,12941.1,502)
			BOSS寻路(-17984,14144,502)
			BOSS寻路(-16656.5,13158.1,502)	
			else
				break	
			end																																												
		end	
	end
	function 繁星循环2()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 5 then																									
			BOSS寻路(3219.61,12355.3,502)
			BOSS寻路(2340.74,12549.9,502)
			BOSS寻路(1338.36,11678.2,502)
			BOSS寻路(2241.2,12956.2,502)
			else
				break	
			end																																												
		end	
	end
	function 繁星循环3()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 5 then																									
			BOSS寻路(2897.08,22159.1,502)
			BOSS寻路(1943.63,22128.1,502)
			BOSS寻路(2384.38,21378.9,502)
			BOSS寻路(2466.67,22836.1,502)
			else
				break	
			end																																												
		end	
	end
	function 繁星循环4()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 5 then																									
			BOSS寻路(2988.23,31029.2,502)
			BOSS寻路(2031.75,31102.9,502)
			BOSS寻路(2166.87,29834.9,502)
			BOSS寻路(3765.02,30654,502)
			else
				break	
			end																																												
		end	
	end
	导航寻路(-7590.45,579.145,502,坐标数量,坐标表)
	繁星循环()
	导航寻路(-15760,13664,502,坐标数量,坐标表)
	繁星循环1()
	导航寻路(2580.6,13644.1,502,坐标数量,坐标表)
	回收()
	繁星循环2()
	导航寻路(2442.35,23194.4,502,坐标数量,坐标表)
	繁星循环3()
	导航寻路(4075.18,30762.1,502,坐标数量,坐标表)
	繁星循环4()
	导航寻路(14321.4,30677.6,502,坐标数量,坐标表)
	繁星BOSS(0)
	延迟(2000)
	平面实时移动(14850.6,31346,502,400)
	平面实时移动(16129.9,31213,502,400)
	平面实时移动(17463.6,30828.4,502,400)
	平面实时移动(20499.2,30695.7,502,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)			
	实时移动(7982.45,-3232.25,1730,400)
	实时移动(7745.01,-972.658,1710,400)
	实时移动(7246.57,215.114,1710,400)
	实时移动(7781.79,805.177,1710,400)
	实时移动(9216,768,1748,400)		
	延迟(2000)
	实时移动(9185.31,733.147,1747.5,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
	实时移动(12177.6,703.562,2327.66,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)			
end
function 太阳斗场()
	while  true do	
		延迟(2000)
		if 取地图名() == "太阳斗场" then
			改写JSON配置("太阳斗场")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("太阳斗场-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-2622.94,549.974,501},
		{-1180.84,619.382,501},
		{181.533,26.4748,501},
		{1602.12,319.535,501},
		{3079.78,532.125,501},
		{4564.68,600.114,501},
		{6061.87,570.683,501},
		{7533.77,808.71,501},
		{8987.21,1122.32,501},
		{10466.8,909.291,501},
		{10608.8,683.016,501},
		---遇到BOSS
		{10429.5,1073.77,501},--NPC位置
		{11790.2,572.108,501},
		{13155.1,611.569,501},
		{14659.1,448,501},
		{13258.7,667.836,501},
		{11757.2,644.097,501},
		{10294.2,893.121,501},
		{8828.91,1160.19,501},
		{7429.96,814.705,501},
		{5969.15,567.363,501},
		{4468.4,533.414,501},
		{2967.86,499.481,501},
		{1497.22,291.643,501},
		{-22.04,168.265,501},
		{399.646,-1084.39,501},
		{999.203,105.407,501},
		{2363.09,605.293,501},
		{3723.49,754.823,501},
		{5113.75,562.887,501},
		{6612.99,530.225,501},
		{7985.1,876.208,501},
		{9452.23,965.862,501},
		{10930.8,776.955,501},
		{12430.4,783.533,501},
		{13928.9,711.036,501},
		{15428.8,638.393,501},
		{16928.2,565.744,501},
		{18276.6,585.133,501},
		{17331,1793.14,501},
		{17909.7,3054.5,501},
		{19432.6,3095.63,501},
		{19855.6,4552.59,501},
		{19998.7,5864.06,501},
		{19878.4,7325.32,501},
		{19876.3,8811.37,501},
		{19819.6,10307.4,501},
		{19865.7,11687.3,509},
		{21076.7,12203.1,507},
		{22551.3,12317.9,501},
		{22912,12402.6,501},
		---遇到BOSS
		{21434.6,12432.8,510.33},
		{20143.8,13265.4,507.993},
		{19146.5,12315,506},
		{20636.5,12368.5,506},
		{22025.3,12336.8,501},
		{23554.3,12198.7,501},
		{24922.7,12403.3,501},
		{26401.1,12200.7,501},
		{27915,12187.8,501},
		{29381.9,12501,501},
		{30885.3,12588.2,464.238},
		{32403.6,12371.8,461},
		{33890.3,12405,501},
		{35385.9,12271.6,501},
		{36873.4,12187.4,501},
		{38383.3,12132.8,501},
		{39391.8,12128.8,509.507},
		---遇到BOSS
		{40895.8,12254.7,406.041},
		{42390.1,12149.2,406},
		{43895.9,12096.3,406},
		{45389,12167.7,441},
		{45530.7,12201.8,441},
		---NPC
		{44095.3,11864.8,406},
		{43902.3,13372.6,406},
		{45067.6,14148.1,406},
		{46378.9,13694.6,406},
		{46867.2,12440.5,406},
		{45886.4,11398.2,406},
		{44721.7,11999.2,406},
		{46048.4,12778.2,406},
		{47227,12226.2,406},
		{48723.8,12125.4,406},
		{50222.8,12100.5,412.251},
		{51708.7,12158.7,506},
		{53219.1,12154.2,509.188},
		{54621.3,12176.9,813.292},
		{56071.5,12191.8,959.494},
		{55520,12224,806},
		---NPC
		{56945.8,12281.8,1106.44},
		{58442.6,12276.4,1106},
		{59914.3,12271.1,1106},
		{61415.9,12263.9,1412.97},
		{39137.4,12128.7,504.534},
		{62384,12256,1406},

	}
	坐标数量=#坐标表
	function 太阳循环()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																									
			BOSS寻路(9757.91,1295.08,501)
			BOSS寻路(8817.25,1019.64,501)
			BOSS寻路(9552.5,1521.1,501)
			else
				break	
			end																																												
		end	
	end
	function 太阳循环1()
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end					
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 6 then																									
			BOSS寻路(20412.3,12452.5,506)
			BOSS寻路(19418.5,12443.4,506)
			BOSS寻路(19864.3,11610.2,510)
			BOSS寻路(20429.2,13382.1,511)
			BOSS寻路(20652.3,12316.2,506)
			else
				break	
			end																																												
		end	
	end
	function 太阳BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(39137.4,12128.7,504.534,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end	
			local nihao =已接任务ID判断(0x11daa3)---参数为任务ID，成功返回1 --在控制台脚本工具中查看任务ID
			if nihao == 1 then
				break
			end					
			ishave,x,y,z,name=取传送门信息(18500)
			if name == "梳洗大厅" then
				break
			end								
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 11 then																									
			local jieguo=BOSS寻路(45283.2,12997.1,406)
			if jieguo==3 then
				太阳BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(46307.7,12185.3,406)
			if jieguo==3 then
				太阳BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(45528.8,11257.9,406)
			if jieguo==3 then
				太阳BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(44482.9,12171.4,406)
			if jieguo==3 then
				太阳BOSS(1)
				return
			end			
			else
				break	
			end																																												
		end	
	end	
	解锁技能槽(102)
	解锁技能槽(202)
	解锁技能槽(302)
	解锁技能槽(402)
	更新技能1()	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	更新技能2()	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	更新技能3()	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	更新技能4()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
	导航寻路(10608.8,683.016,501,坐标数量,坐标表)
	平面实时移动(10429.5,1073.77,501,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("加入繁星英灵")
	延迟(2000)	
	跳过对话()
	延迟(2000)	
	太阳循环()
	导航寻路(22912,12402.6,501,坐标数量,坐标表)
	太阳循环1()
	回收()
	导航寻路(45530.7,12201.8,441,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	跳过对话()
	延迟(6000)	
	太阳BOSS(0)
	延迟(2000)
	测试(44976.3,12393.9,406,100)
	测试(45552,12695.3,406,100)
	测试(46093.3,12630.5,406,100)
	测试(46654.9,12485.9,406,100)
	测试(47210.6,12342.8,406,100)
	测试(47729.2,12258.1,406,100)
	测试(48355.6,12182,406,100)
	测试(49013.6,12167.5,406,100)
	测试(49593.9,12158.1,406,100)
	测试(50123.9,12152.7,406.716,100)
	测试(50704.2,12146.8,458.828,100)
	测试(50892.4,12144.9,495.518,100)	
	导航寻路(55520,12224,806,坐标数量,坐标表)
	延迟(6000)
	ishave,x,y,z=范围怪判断2(1,0,0,0,"阿瑞娅",2,5000)	
	平面实时移动(x,y,z,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)		
	领取任务奖励(1)
	延迟(2000)
	领取任务奖励(1)
	延迟(2000)	
	导航寻路(62384,12256,1406,坐标数量,坐标表)
	平面实时移动(62384,12256,1406,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 梳洗大厅()
	while  true do	
		延迟(2000)
		if 取地图名() == "梳洗大厅" then
			改写JSON配置("梳洗大厅")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("梳洗大厅-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-16002.6,-0.327898,6},
		{-14568,75.176,6},
		{-13067.7,105.253,6},
		{-11705.7,132.548,6},
		{-10366.9,108.174,6},
		{-9007.5,-32,6},
		{-7568,-109.133,6},
		{-6419.03,-729.945,6},
		{-5764.47,-1246.49,6},
		{-10505.3,-39.9724,6},
		---遇到BOSS
		{-5903.82,-2727.97,6},
		{-5846.41,-4227.04,6},
		{-5673.65,-5520.33,6},
		{-4410.13,-5634.58,466.06},
		{-3013.45,-5689.77,606},
		{-1609.79,-5830.43,606},
		{-1959.01,-4421.27,606},
		{-1952.35,-3074.51,606},
		{-1747.72,-1707.99,606},
		{-756.869,-816.881,608},
		{595.421,-268.834,606},
		{1937.07,-167.949,606},
		{3469.49,77.3909,606},
		{4840.93,352,506.221},
		{6263.8,4.54374,606},
		{7382.07,949.109,606},
		{8628.14,219.156,523.849},
		{8791.02,162.164,523},
		{9627.76,4.74097,521},
		---遇到BOSS
		{7564.23,1047.65,606},
		{6974.38,2491.68,606},
		{6162.63,3725.48,606},
		{6204.5,5168.71,911},
		{7660.74,5630.75,1206},
		{7807.12,6961.87,1206},
		{6479.89,7594.77,1206},
		{5083.93,7688.14,1206},
		{3639.1,7680,1206},
		{2272.31,7209.97,1206},
		{1134.61,8037.98,1031.44},
		{434.307,6619.05,718.526},
		{323.482,5228.38,606},
		{-988.609,5475.12,606},
		{-2060.66,4612.11,606},
		{-2968.62,5896.78,606},
		{-1476.65,5367.18,606},
		{-60.8095,5770.68,606},
		{-885.357,7012.87,606},
		{-1207.71,8556.88,606},
		{-2087.07,9546.47,606},
		{-736.486,9855.81,606},
		{742.533,9995.21,606},
		{2075.05,10624.8,606},
		{2166.18,10657.1,606},
		---遇到BOSS
		{385,9919,534},
		{127.412,9920.93,606},
		---cs
		{1520,10520,606},
		{2607.32,11301.8,606},
		{2615.52,12798.7,606},
		{2769.81,13960.1,606},
		---cs
		{328.947,5674.17,606},
		{409.43,4656.85,606},
		{-515.47,4745.16,606},
		{-1972.62,5298.57,606},
		{-2761.34,6362.82,609},
		{-3190.51,7774.49,606},
		{-1813.83,7071.85,508.002},
		{-1469.63,5778.22,606},
		{-2908.77,5578.96,606},
		{-3570.17,6347.44,606},	
	}
	坐标数量=#坐标表
	function 梳洗BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(127.412,9920.93,606,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end	
			ishave,x,y,z,name=取传送门信息(18500)
			if name == "太阳王庭" then
				break
			end								
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 11 then																									
			local jieguo=BOSS寻路(2166.18,10657.1,606)
			if jieguo==3 then
				梳洗BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(1782.32,11013.6,606)
			if jieguo==3 then
				梳洗BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(2207.52,9977.94,606)
			if jieguo==3 then
				梳洗BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(1559.25,10223.4,606)
			if jieguo==3 then
				梳洗BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(2400,10752,606)
			if jieguo==3 then
				梳洗BOSS(1)
				return
			end			
			else
				break	
			end																																												
		end	
	end

	导航寻路(-10505.3,-39.9724,6,坐标数量,坐标表)
	测试(-10082,58.8738,6,100)
	测试(-9423.03,70.3876,6,100)
	测试(-8822.5,80.8808,6,100)
	测试(-8168.86,90.3943,6,100)
	测试(-7558.79,93.7433,6,100)
	测试(-6962.33,97.0181,6,100)
	测试(-6338.04,11.1247,6,100)
	测试(-6108.64,-518.128,6,100)
	测试(-6054.68,-1108.19,6,100)
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		if 取血比例() ==100 then	
			break
		end
		按键加强("q")
		延迟(4000)
	end	
	测试(-6014.52,-1254.24,6,100)
	测试(-6070.68,-1790.16,6,100)
	测试(-6096.33,-2386.65,6,100)
	测试(-6116.67,-2986.74,6,100)
	测试(-6135.85,-3586.54,6,100)
	测试(-6098.12,-4175.65,6,100)
	测试(-5961.87,-4659.04,6,100)
	测试(-5931,-5249.83,6,100)
	测试(-5974.16,-5830.5,6,100)
	测试(-5384.1,-5794.67,9.7982,100)
	测试(-4804.88,-5665.12,275.888,100)
		
	导航寻路(9627.76,4.74097,521,坐标数量,坐标表)
	导航寻路(6263.8,4.54374,606,坐标数量,坐标表)
	导航寻路(8628.14,219.156,523.849,坐标数量,坐标表)	
	回收()
	导航寻路(328.947,5674.17,606,坐标数量,坐标表)
	导航寻路(-2761.34,6362.82,609,坐标数量,坐标表)
	回收()
	导航寻路(-3570.17,6347.44,606,坐标数量,坐标表)
	导航寻路(-1813.83,7071.85,508.002,坐标数量,坐标表)
	导航寻路(2166.18,10657.1,606,坐标数量,坐标表)
	梳洗BOSS(0)
	延迟(2000)
	导航寻路(2769.81,13960.1,606,坐标数量,坐标表)
	平面实时移动(2769.81,13960.1,606,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 太阳王庭()
	while  true do	
		延迟(2000)
		if 取地图名() == "太阳王庭" then
			改写JSON配置("太阳王庭")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("太阳王庭-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-4560,-14130,-289},
		{-4592.35,-12670.7,-289},
		{-4513.64,-11162.3,-289},
		{-4484.22,-9671.47,-289},
		{-4380.98,-8249.95,11},
		{-3106.51,-7872,11},
		{-1741.79,-7455.55,11},
		{-357.772,-7149.84,452.114},
		{1145.63,-7621.22,606},
		{1497.02,-9090.12,606},
		{2936.46,-9691.23,606},
		{3483.07,-8532.41,912.276},
		{4605.17,-7627.08,1106.77},
		{5980.67,-7686.64,1211},
		{5442.13,-6358.06,1211},
		{4328.4,-5530.62,1211},
		{3293.36,-4551.03,1165.96},
		{3138.48,-3253.71,911},
		{1754.8,-3489.54,606},
		{1424.5,-2186.58,606},
		{2764.4,-1608.18,609.128},
		{3278.57,-285.133,606},
		{2511.39,915.651,606},
		{2628,2400.82,606},
		{1830.52,3506.19,606},
		{1957.88,4811.84,606},
		{3422.69,5193.13,728.303},
		{4898.7,5192.22,1206},
		{6339.68,5098.22,1385.62},
		{7751.91,5108.57,1806.36},
		{8758.13,6138.14,1806},
		{8994.8,7571.62,1806},
		{8998.27,9127.48,1829.95},
		{9033.58,10323.2,2341.42},
		{8989.34,11841.4,2416},
		{9031.05,11895.3,2416},
		---遇到BOSS
		{9110,8472,1806},
		{9075.44,9867.7,2114.21},
		{9024.76,10334.1,2345.69},
		---传送
	}
	坐标数量=#坐标表
	function 虚影BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(9024.76,10334.1,2345.69,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end	
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "亵渎御座" then
				break
			end								
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 9 then																										
			local jieguo=BOSS寻路(9220,11310,2416)
			if jieguo==3 then
				虚影BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8476.89,11522.5,2416)
			if jieguo==3 then
				虚影BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9844.64,11945.1,2416)
			if jieguo==3 then
				虚影BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9555.65,11856.4,2416)
			if jieguo==3 then
				虚影BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8239.58,12046.8,2416)	
			if jieguo==3 then
				虚影BOSS(1)
				return
			end			
			else
				break	
			end																																												
		end	
	end

	导航寻路(9031.05,11895.3,2416,坐标数量,坐标表)
	虚影BOSS(0)
	延迟(2000)
	平面实时移动(8928,13312,2416,400)
	平面实时移动(8882.65,15324.1,2416,300)
	延迟(4000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 亵渎御座()----关注一下这个函数的地图名
	while  true do	
		延迟(2000)
		if 取地图名() == "亵渎御座" then
			改写JSON配置("亵渎御座")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("亵渎御座-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-13947.7,8259,5},
		{-12504.6,8279.93,5},
		{-11025.3,8411.22,5},
		{-9728.96,8745.09,5},
		{-8427.2,8576.44,5},
		{-6964.23,8270.73,5},
		{-5567.38,8577.31,5},
		{-4262.12,8335.6,5},
		{-2997.55,7651.5,5},
		{-2719.61,6222.53,5},
		{-3053.26,4960.27,5},
		{-3174,3395.56,5},
		{-2954.92,2074.03,5},
		{-1932.56,1055.34,5},
		{-469.384,1339.93,5},
		{1011.21,1487.39,608.401},
		{2480.88,1465.66,610},
		{4012.79,1504,610},
		{5317.72,1183.23,610},
		{6880.01,1091.44,610},
		{8378.27,987.349,610},
		{9604.84,438.317,610},
		{10879.9,0.230818,772.95},
		{12149.7,13.1832,1215},
		{13450,156.709,1215},
		{13458.1,158.401,1215},
		---遇到BOSS
		{10411,-38,609},
		{11853.1,186.84,1174.77},
		{11967.8,189.645,1205.93},
		{13538.4,468.063,1215},
		{14159.7,1701,1215},
		{14113,3187.61,1053.2},
		{14499.2,4425.99,615},
		{15965.2,4358.44,615},
		{16750.4,3105.52,615},
		{18050.2,2374.79,615},
		{19418.4,1829.05,615},
		{19867,398.436,615},
		{21075.8,-91.5351,400.193},
		{22572.9,-69.6202,10},
		{24072.6,22.48,10},
		{25572.9,23.2306,10},
		{27075.2,22.7303,10},
		{28609.9,-63.6029,10},
		{29038.7,-50.6912,10},
		{-2611.83,1142.85,5},
		{821.135,1419.78,529.247},
	}
	坐标数量=#坐标表
	function 亵渎BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(11967.8,189.645,1205.93,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		local 计次=0
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end				
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end		
			计次=计次+1
			if 计次 < 11 then																											
			local jieguo=BOSS寻路(13819.5,-221.041,1215)
			if jieguo==3 then
				亵渎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(13246.8,491.936,1215)
			if jieguo==3 then
				亵渎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(13200,-608,1215)
			if jieguo==3 then
				亵渎BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(14203.3,-195.982,1215)
			if jieguo==3 then
				亵渎BOSS(1)
				return
			end				
			else
				break	
			end																																												
		end	
	end
	导航寻路(-2611.83,1142.85,5,坐标数量,坐标表)
	避难所寻路(821.135,1419.78,529.247,坐标数量,坐标表)
	导航寻路(13458.1,158.401,1215,坐标数量,坐标表)
	亵渎BOSS(0)
	延迟(5000)
	亵渎BOSS(0)
	延迟(5000)
	亵渎BOSS(0)
	延迟(5000)
	亵渎BOSS(0)		
	延迟(2000)
	导航寻路(29038.7,-50.6912,10,坐标数量,坐标表)
	平面实时移动(29038.7,-50.6912,10,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 锈蚀深渊()
	while  true do	
		延迟(2000)
		if 取地图名() == "锈蚀深渊" then
			改写JSON配置("锈蚀深渊")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("锈蚀深渊-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-2162,-1465.4,6},
		{-1167.08,-317.229,6},
		{-2138.18,689.283,6},
		{-963.173,-201.848,6},	
		---传送
	}
	坐标数量=#坐标表
	function 锈蚀BOSS(模式)
		if 模式==1 then
			延迟(7000)
			实时移动(-2224,-4768,1146,300)
			延迟(3000)
			按键(0x44) --按键D
			延迟(4000)	
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end								
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																												
			local jieguo=BOSS寻路(-1572.35,-738.114,6)
			if jieguo==3 then
				锈蚀BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-539.233,-1048.51,6)
			if jieguo==3 then
				锈蚀BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-1305.65,-124.59,6)
			if jieguo==3 then
				锈蚀BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-2129.08,-519.01,6)
			if jieguo==3 then
				锈蚀BOSS(1)
				return
			end																																															
		end	
	end

	导航寻路(-2138.18,689.283,6,坐标数量,坐标表)
	导航寻路(-1167.08,-317.229,6,坐标数量,坐标表)
	锈蚀BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(-808.884,-214.136,6,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	实时移动(1745.06,-314.858,3093,300)
	实时移动(2382.77,1239.44,3096,300)
	实时移动(3704.28,2296.4,3095,300)
	实时移动(5008.62,3581.39,3320.24,300)
	实时移动(5582.48,4499.41,3601.36,300)
	实时移动(5902.54,4812,3615,300)
	实时移动(4833.48,3571.67,3282.41,300)
	实时移动(4419.78,2633.64,3119.23,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
	实时移动(3563.6,2088.98,3097,300)
	实时移动(2874.35,1613.12,3098.79,300)
	实时移动(2293.44,1212.05,3095.88,300)
	实时移动(1895.45,743.73,3093,300)
	实时移动(1808,-96,3093,300)
	实时移动(1597.33,-833.214,3093,300)
	实时移动(1357.97,-1811.31,3098.74,300)
	实时移动(1498.19,-2651.96,3161.64,300)
	实时移动(1770.41,-3238.49,3233.61,300)
	实时移动(2272,-3456,3253,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	打开世界关卡("远征壁垒")
	延迟(3000)
	进入世界关卡()
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)	
	实时移动(-271.019,-74.0845,807,300)
	实时移动(-2048.2,-187.852,507,300)
	实时移动(-2679.36,732.035,507,300)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	延迟(2000)
	对话选项("异界入侵")--有问题
	延迟(2000)
	延迟(2000)
	对话选项("异界入侵")--有问题
	延迟(2000)	
	跳过对话()
	延迟(2000)	
	实时移动(-1633.36,169.124,537.689,300)
	实时移动(88.2412,203.597,807,300)
	实时移动(-284.279,2686.5,807,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("导师馈赠")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)
	实时移动(76.8356,665.003,807,300)
	实时移动(74.0191,-1206.07,807,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	打开世界关卡("荒野山地")
	延迟(3000)
	进入世界关卡()
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(6000)				
end
function 荒野山地()
	while  true do	
		延迟(2000)
		if 取地图名() == "荒野山地" then
			改写JSON配置("荒野山地")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("荒野山地-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{2612.82,3070.47,380.326},
		{1812.52,4371.59,247.213},
		{1335.23,5715.49,104},
		{747.629,6904.07,104},
		{1496,7982.32,104},
		{1549.27,9579.86,104},
		{1340.31,10866,104},
		{149.93,11600.4,107.244},
		{-869.848,12578.8,99},
		{-2002.36,13479.5,97.7659},
		{-2670.23,14691.5,95.0554},
		{-1990.7,15954.3,121.778},
		{-1225.25,17131.4,100.357},
		{-408.368,18345.4,104},
		{586.981,19316.1,104},
		{1687.84,20207.7,104},
		{2760.38,21056,104},
		{4077.08,20617.8,104},
		{4313.74,19097,104},
		{5219.13,17959.7,104},
		{6209.58,18833.6,104},
		{7567.66,19379.7,314.504},
		{8523.62,20383.5,649.239},
		{9084.98,21690,942.246},
		{9165.57,23003.1,964},
		{10595.5,23153.1,966.892},
		{11015,23104.9,959},
		---传送
		{15890.6,23230,1016.48},
		{17280.5,23039,1480.38},
		{18060.9,21952.2,1594},
		{18374.5,20496.8,1599},
		{18411.5,19030.9,1599},
		{18603.4,17586.6,2101.12},
		{19447.9,16355.1,2209.9},
		{20536.2,15369.5,2204},
		{21338.4,14234.1,2235},
		{22176.1,13762.5,2238.92},
		---传送
		{28900.1,15150,3039},

	}
	坐标数量=#坐标表
	function 荒野BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(22176.1,13762.5,2238.92,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(18500)
			if name == "蛮荒古道" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																												
			local jieguo=BOSS寻路(29113.3,16264.8,3039)
			if jieguo==3 then
				荒野BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(29888.9,15554.9,3039)
			if jieguo==3 then
				荒野BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(29619.2,14879.6,3039)
			if jieguo==3 then
				荒野BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(30037.5,16017.8,3039)
			if jieguo==3 then
				荒野BOSS(1)
				return
			end																																															
		end	
	end

	导航寻路(11015,23104.9,959,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	按键(0x44) --按键D
	延迟(6000)			
	导航寻路(22176.1,13762.5,2238.92,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	按键(0x44) --按键D
	延迟(6000)		
	荒野BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(30504.4,15975.1,3039,400)
	实时移动(31779,14967.8,3039,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()	
	延迟(2000)
	跳过动画()	
	延迟(2000)				
end
function 蛮荒古道()
	while  true do	
		延迟(2000)
		if 取地图名() == "蛮荒古道" then
			改写JSON配置("蛮荒古道")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("蛮荒古道-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{2101,1316,5214},
		{2701.5,2642.62,5214},
		{3517.37,3797.07,5214},
		{4073.09,5202.49,5214},
		{4127.54,6639.13,5214},
		{4934.93,7720.18,5214},
		{5891.96,8876.66,5214},
		{6676.49,10163,5214},
		{6628.64,11593.9,5214},
		{7730.19,12461.9,5214},
		{9122.56,12939.7,5214},
		{10430.2,13571.8,5214},
		{11773.2,14230.5,5214},
		{12670.7,15314.8,5214},
		{12698.8,16794.7,5214},
		{11989.1,18133.9,5214},
		{11062,19312.1,5214},
		{10159.5,20320.9,5214},
		{9324.01,21335,5214},
		{9022.67,22646.4,5214},
		{9362.55,24052.6,5214},
		{9806.76,24963.9,5214},
		---遇到BOSS
		{7910,23420,5214},
		{8158.51,23404.7,5214},
		---传送

	}
	坐标数量=#坐标表
	function 蛮荒BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(8158.51,23404.7,5214,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "泣血高原" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																														
			local jieguo=BOSS寻路(9500,24530,5214)
			if jieguo==3 then
				蛮荒BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9464.37,25542.3,5213.9)
			if jieguo==3 then
				蛮荒BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9997.23,24995.4,5214.05)
			if jieguo==3 then
				蛮荒BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9994.47,26127.7,5222.57)
			if jieguo==3 then
				蛮荒BOSS(1)
				return
			end																																															
		end	
	end

	导航寻路(9806.76,24963.9,5214,坐标数量,坐标表)
	延迟(4000)		
	蛮荒BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(10219.6,26687.6,5233.01,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)				
end
function 泣血高原()
	while  true do	
		延迟(2000)
		if 取地图名() == "泣血高原" then
			改写JSON配置("泣血高原")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("泣血高原-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{1960,1350,5213},
		{2637.81,2692.93,5213},
		{3315.55,3861.55,5213},
		{4259.57,5012.86,5213},
		{5126.63,6252.04,5213},
		{5946.22,7476.44,5213},
		{6625.49,8719.32,5213},
		{7741.64,9510.08,5213},
		{8763.99,10396.3,5213},
		{10133.7,10906.2,5213},
		{11315.9,11707.8,5213},
		{12512.9,12384,5213},
		{13798.3,13150.4,5213},
		{13473,14462.9,5213},
		{13159.8,15798.8,5213},
		{12720.4,17226,5213},
		{11932.2,18481.8,5213},
		{10972.9,19404.2,5213},
		{9842.97,20294.3,5213},
		{8991.84,21368.2,5213},
		{8866.76,22842.5,5213},
		{9167.29,24244.5,5215.48},
		{9751.93,24907.6,5214},
		---遇到BOSS
		{8020,23200,5213},
		{8526.13,23487.9,5213},
		---传送


	}
	坐标数量=#坐标表
	function 泣血BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(8526.13,23487.9,5213,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "埋骨林地" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																														
			local jieguo=BOSS寻路(9500,24530,5217)
			if jieguo==3 then
				泣血BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(10375.7,25640.9,5233.21)
			if jieguo==3 then
				泣血BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(10160.9,24596.1,5239.67)
			if jieguo==3 then
				泣血BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9085.55,24546.6,5214.42)
			if jieguo==3 then
				泣血BOSS(1)
				return
			end																																															
		end	
	end

	导航寻路(9751.93,24907.6,5214,坐标数量,坐标表)
	延迟(4000)		
	泣血BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(9675.47,24446.3,5219.95,300)
	实时移动(10557,25252,5265.44,300)
	实时移动(10016,26944,5229,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 埋骨林地()
	while  true do	
		延迟(2000)
		if 取地图名() == "埋骨林地" then
			改写JSON配置("埋骨林地")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("埋骨林地-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-2791.19,8576,977},
		{-1591.28,7993.32,977},
		{-168.031,8463.96,977},
		{593.548,9571.1,977},
		{2068.05,9974.45,982},
		{3523.97,9658.4,985.124},
		{4623.42,8560.46,977},
		{5500.83,7305.21,980.144},
		{6557.5,6294.54,980},
		{7879.5,5642.27,1009.7},
		{9159.68,5083.27,1325.81},
		{8851.04,3735.71,1389.03},
		{8987.35,2405.6,1421.65},
		{8489.13,1117.13,1586.14},
		{7148.2,292.886,1757},
		{5945.43,-433.451,1716.45},
		{5266.16,782.962,1380.43},
		{4076.29,1561.58,1382},
		{2937.43,2375.62,1382},
		{1808.65,3199.86,1382},
		{922.505,4362.53,1382},
		{464,4640,1382},
		---遇到BOSS
		{2003.05,3210.69,1382},



	}
	坐标数量=#坐标表
	function 埋骨BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(2003.05,3210.69,1382,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "狮鹫之巢" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																														
			local jieguo=BOSS寻路(-287.785,5120.25,1382)
			if jieguo==3 then
				埋骨BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(640.732,5001.2,1382)
			if jieguo==3 then
				埋骨BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(526.767,4728.71,1382)
			if jieguo==3 then
				埋骨BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-79.2214,5482.03,1382)
			if jieguo==3 then
				埋骨BOSS(1)
				return
			end																																																
		end	
	end

	导航寻路(464,4640,1382,坐标数量,坐标表)
	延迟(4000)		
	埋骨BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(209.271,5729.8,1382,300)
	实时移动(-685.382,5833.48,1382,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 狮鹫之巢()
	while  true do	
		延迟(2000)
		if 取地图名() == "狮鹫之巢" then
			改写JSON配置("狮鹫之巢")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("狮鹫之巢-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-7337.13,-5708.34,1498},
		{-6444.8,-5282.65,1506.26},
		{-5513.05,-4178.92,1496},
		{-4998.09,-2892.18,1496},
		{-6184.59,-2049.12,1496},
		{-6485.82,-779.708,1507.32},
		{-6020.58,640.304,1496},
		{-5647.23,1886.46,1499},
		{-5332.33,3395.96,1509.12},
		{-5789.68,4821.13,1520.57},
		{-6833.33,5857.94,1491},
		{-8031.57,4878.19,1491},
		{-9237.39,4352,1496.33},
		{-10287.9,5174.04,1714.78},
		{-11018.5,6275.2,1758.05},
		{-10494.8,7625.76,1669.61},
		{-9672.82,8849.76,1496},
		{-8523.92,9745.64,1502.22},
		{-7108.38,9886.26,1501},
		{-5800.66,10081.3,1501},
		{-4973.83,11323.3,1501},
		{-3926.09,12336.5,1479.48},
		{-2628.27,11710.7,1191},
		{-1735.89,10596.9,1191},
		{-828.297,9419.08,1191},
		{473.37,9241.36,1191},
		{1818.81,8700.44,1191},
		{2245.02,7207.69,1191},
		{2328.24,5802.01,1191},
		{3101.28,4838.91,1191},
		---遇到BOSS
		{1871.64,6168.02,1191},
	}
	坐标数量=#坐标表
	function 狮鹫BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(1871.64,6168.02,1191,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "狮鹫之巢" then
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																															
			local jieguo=BOSS寻路(3101.28,4838.91,1191)
			if jieguo==3 then
				狮鹫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(3540.82,5514.64,1191)
			if jieguo==3 then
				狮鹫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(2430.17,4753.48,1191)
			if jieguo==3 then
				狮鹫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(3076.4,4273.46,1191)
			if jieguo==3 then
				狮鹫BOSS(1)
				return
			end																																																
		end	
	end

	导航寻路(3101.28,4838.91,1191,坐标数量,坐标表)
	延迟(4000)		
	狮鹫BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(2529.36,4231.08,1191,300)
	实时移动(3776.83,3899.36,1191,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	实时移动(-51.0807,126.455,807,300)
	实时移动(-247.224,2664.25,807,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("异界入侵")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("导师馈赠")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)	
	实时移动(181.668,296.889,807,300)
	实时移动(149.807,-1234.75,807,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	打开世界关卡("深渊矿洞")
	延迟(3000)
	进入世界关卡()
	延迟(2000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)			
end
function 深渊矿洞()
	while  true do	
		延迟(2000)
		if 取地图名() == "深渊矿洞" then
			改写JSON配置("深渊矿洞")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("深渊矿洞-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-20770,-21720,394},
		{-19536.2,-21216.4,394},
		{-18627.7,-20256,394},
		{-17522.3,-19552,394},
		{-16677.2,-18277.5,394},
		{-16041.2,-16927.7,394},
		{-15620.9,-15517.3,394},
		{-14322.5,-14859.1,394},
		{-13074.7,-15264,394},
		{-11731.7,-14930.4,394},
		{-10804.2,-13876.6,394},
		{-10498,-12443.4,394},
		{-9665.67,-11259.4,394},
		{-8214.32,-11488,528.42},
		{-6810.01,-11601.4,569},
		{-5719.9,-10543.8,569},
		{-5217.16,-9110.68,569},
		{-5184.71,-7521.02,569},
		{-5907.3,-6425.4,569},
		{-6716.15,-5120.09,569},
		{-7894.33,-4200.64,569},
		{-9002.01,-3066.18,569},
		{-10288.8,-2542.23,569},
		{-11061.2,-3828.98,569},
		{-12032,-4992,569},
		{-13251.4,-5965.24,457.779},
		{-14147.8,-7166.1,434},
		{-15252.5,-8202.6,434},
		{-16755.7,-8671.98,434},
		{-17452.1,-7461.26,434},
		{-18395.8,-6299.28,434},
		{-18926.1,-4896.81,603.038},
		{-18568.2,-3479.75,678.212},
		{-17090.7,-3684.63,974.928},
		{-17482,-2286.45,769},
		{-16996.2,-930.491,584},
		{-16064.2,218.437,584},
		{-14985.3,1119.63,494.042},
		{-14365.2,2298.41,404},
		{-14612.2,3780.41,404},
		{-14033.9,5119.81,404},
		{-12726.9,5664,404},
		{-11233.7,5691.46,404},
		{-9943.64,5885.35,404},
		{-8859.09,6665.82,410.46},
		{-8509.82,8099.69,589},
		{-8309.28,9550.44,589},
		{-7648,10688,589},
		---传送
		{-22232,8437.01,-257},
		{-21714,9691.92,-122},
		{-22323.7,10708.7,-126},
		---BSS
	}
	坐标数量=#坐标表
	function 深渊BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-7648,10688,589,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			导航寻路(-22323.7,10708.7,-126,坐标数量,坐标表)
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "熔铁之核" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																														
			local jieguo=BOSS寻路(-22312.9,10663,-126)
			if jieguo==3 then
				深渊BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-21680.4,11360,-126)
			if jieguo==3 then
				深渊BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-21236.3,10766.4,-126)
			if jieguo==3 then
				深渊BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-22432.4,10154.1,-126)
			if jieguo==3 then
				深渊BOSS(1)
				return
			end																																																		
		end	
	end

	导航寻路(-7648,10688,589,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	导航寻路(-22323.7,10708.7,-126,坐标数量,坐标表)
	延迟(2000)	
	深渊BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(-21346.3,10045.5,-126,300)
	实时移动(-20790.9,10728.4,-126,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 熔铁之核()
	while  true do	
		延迟(2000)
		if 取地图名() == "熔铁之核" then
			改写JSON配置("熔铁之核")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("熔铁之核-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-1322.47,-1106.98,1148.59},
		{-2421.19,-2163.94,1147},
		{-3596.7,-3090.07,1147},
		{-4624.43,-3982,1147},
		{-5945.6,-4097.36,1147},
		{-6815.74,-2957.24,1147},
		{-6102.83,-1738.55,1147},
		{-6805.37,-545.612,1147},
		{-7372.49,712.187,1189.52},
		{-6409.11,1866.17,1192},
		{-5346.48,2854.93,1195.22},
		{-5089.98,4294.13,1157},
		{-5373.41,5612.62,1157},
		{-4735.1,6819.03,1157},
		{-3345.2,6656.84,1157},
		{-1901.97,6496,1157},
		{-1229.44,5246.15,1157},
		{-370.651,4029.28,1157},
		{751.604,3060.65,1157},
		{1899.47,2306.91,1157},
		{3352.79,2722.87,1157},
		{4413.13,3602.08,1157},
		{5100.72,4761.44,1157},
		{6275.16,3963.77,1157},
		{6588.17,2673.2,1157},
		{6149.7,1277.91,1157},
		{7059.12,89.7647,1157.19},
		{7142.5,-1292.5,1191.4},
		{6105.46,-2219.82,1189},
		{5226.48,-3412.99,1153.83},
		{4538.82,-4713.65,1152},
		{5093.61,-6148.13,1152},
		{4192,-7232,1152},
		{2730.68,-6834.2,1152},
		{1670.22,-5978.61,1152},
		{715.964,-5091.15,1152},
		{1911.06,-5650.51,1152},
		{3446.96,-5617.34,1152},
		{4498.86,-4634.28,1152},
		{5949.65,-4561.7,1155.65},
		{5487.62,-5800.52,1152},
		{4649.4,-6876.07,1152},
		{3248.14,-6591.12,1152},
		{1906.18,-6000.33,1152},
		{886.156,-4889.55,1152},
		{-3.03281,-3693.72,1152},
		{-480,-2624,1152},
		---传送
		{12689.3,-3849.99,1322},
		{13431.9,-3623.09,1322},
		{12772.8,-4772.43,1322},
	}
	坐标数量=#坐标表
	function 熔铁BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-480,-2624,1152,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			导航寻路(12772.8,-4772.43,1322,坐标数量,坐标表)
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "荒废洞窟" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																														
			local jieguo=BOSS寻路(12659,-4202.33,1322)
			if jieguo==3 then
				熔铁BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(13370.5,-4200.69,1322)
			if jieguo==3 then
				熔铁BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(12761.5,-4850.75,1322)
			if jieguo==3 then
				熔铁BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(12075,-4269.25,1322)
			if jieguo==3 then
				熔铁BOSS(1)
				return
			end																																																		
		end	
	end
	导航寻路(-6805.37,-545.612,1147,坐标数量,坐标表)
	导航寻路(-480,-2624,1152,坐标数量,坐标表)
	延迟(2000)
	按键(0x44) --按键D
	延迟(3000)
	熔铁BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(13696,-4864,1322,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 荒废洞窟()
	while  true do	
		延迟(2000)
		if 取地图名() == "荒废洞窟" then
			改写JSON配置("荒废洞窟")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("荒废洞窟-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-3386.48,-7920.98,572},
		{-4684.68,-7255.44,572},
		{-5461.96,-6027.11,572},
		{-5381.49,-4682.99,315.261},
		{-4629.85,-3447.5,217},
		{-3652.01,-2349.39,217},
		{-4951.77,-1679.85,134.781},
		{-6100.72,-1059.94,-143},
		{-5830.93,286.85,-143},
		{-4975.84,1408.66,-143},
		{-3941.62,2360.77,-139},
		{-2500.79,2788.98,-143},
		{-1316.67,3423.28,-139},
		{-773.593,4824.99,-173.456},
		{-171.183,6178.89,-196.241},
		{1129.66,6824.09,-203},
		{2324.66,6031.57,-203},
		{3185.04,4960,-420.195},
		{4312.42,4069.38,-576.832},
		{4319.74,2548,-578},
		{3359.57,1539.02,-680.083},
		{2121.68,1095.35,-836},
		{2132.21,-358.615,-1048},
		{2937.41,-1714.82,-1048},
		{4143.56,-2594.42,-1203.46},
		{5422.2,-3292.12,-1503},
		{6731.94,-2636.17,-1501.62},
		{7696.11,-1660.36,-1566.02},
		{8760.13,-595.893,-1669.25},
		{9928.15,219.992,-1676.75},
		{10866.1,1236.17,-1731.98},
		{11686.1,2483.3,-2050.4},
		{12505.9,3735.69,-2095},
		{13376.8,4804.38,-2099.14},
		{13715.7,4465.88,-2095.17},
		---遇到BOSS
		{12565.1,5374.96,-2085.71},
		{4840,-2930,-1398.03},
		{6277.01,-2720.13,-1504},
		{7392.92,-1768.37,-1522.74},
		{8346.27,-838.629,-1667.21},
		{9418.33,30.9299,-1672.03},
		{10448,1165.55,-1674.71},
		{11433.3,2260.88,-2006.69},
		{11408,2336,-2017},
		---传送
	}
	坐标数量=#坐标表
	function 荒废BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-480,-2624,1152,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			导航寻路(12772.8,-4772.43,1322,坐标数量,坐标表)
			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "觐见密道" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																															
			local jieguo=BOSS寻路(12650,4150,-2095.31)
			if jieguo==3 then
				荒废BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(13637.5,4867.56,-2100.11)
			if jieguo==3 then
				荒废BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(13401.7,5292.1,-2105.38)
			if jieguo==3 then
				荒废BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(13747.8,3870.57,-2098)
			if jieguo==3 then
				荒废BOSS(1)
				return
			end																																																		
		end	
	end	
	导航寻路(13715.7,4465.88,-2095.17,坐标数量,坐标表)
	延迟(2000)			
	荒废BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	平面实时移动(13609.6,5512.57,-2105.7,400)
	平面实时移动(12926.3,6442.53,-2083,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 觐见密道()
	while  true do	
		延迟(2000)
		if 取地图名() == "觐见密道" then
			改写JSON配置("觐见密道")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("觐见密道-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-5070.45,7802.97,-316},
		{-6070.71,6819.81,-346},
		{-6735.06,5537.87,-346},
		{-5482.52,4780.34,-344},
		{-4453.58,3978.66,-186},
		{-3269.25,3135.97,-191},
		{-2293.53,2068.94,-191},
		{-3515.57,1364.29,-186.183},
		{-4581.78,675.338,-477},
		{-4880.64,-662.95,-502.586},
		{-6158.82,-1032.67,-821},
		{-7635.15,-809.579,-925.424},
		{-7929.99,-2184.7,-1116},
		{-7262.72,-3399.61,-1116},
		{-6111.39,-4294.57,-1130.75},
		{-4791.23,-4800,-1401},
		{-3618.14,-5404.4,-1401},
		{-2484.89,-6377.64,-1401},
		{-1143.2,-6512.66,-1401},
		{-264.548,-5300.56,-1562.99},
		{481.306,-4224,-1666},
		{1647.91,-3582.25,-1666},
		{2291.01,-3154.31,-1663.43},
		---遇到BOSS
		{2853.44,-2900.25,-1696},
		---传送
		{3210.8,-2488.31,-2944.54},
		{4450.71,-1817.11,-3328.46},
		{4121.16,-899.838,-3346},
		{5388.85,-387.391,-3346},
		{5980.08,-1848.16,-3129.86},
		{7339.02,-2103.16,-3106},
		---BSS
		{5634.75,-1309.25,-3338.96},

		---传送
	}
	坐标数量=#坐标表
	function 觐见BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(5634.75,-1309.25,-3338.96,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "尘封铸台" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(7617,-2318,-3106)
			if jieguo==3 then
				觐见BOSS(1)
				return
			end		
			local jieguo=BOSS寻路(7048.51,-1948.59,-3106)
			if jieguo==3 then
				觐见BOSS(1)
				return
			end		
			local jieguo=BOSS寻路(8175.33,-1934.02,-3105.78)
			if jieguo==3 then
				觐见BOSS(1)
				return
			end		
			local jieguo=BOSS寻路(7629.09,-2824.96,-3106)
			if jieguo==3 then
				觐见BOSS(1)
				return
			end																																																
		end	
	end	
	导航寻路(2853.44,-2900.25,-1696,坐标数量,坐标表)
	延迟(3000)
	按键(0x44) --按键D
	延迟(6000)	
	导航寻路(4121.16,-899.838,-3346,坐标数量,坐标表)
	导航寻路(7339.02,-2103.16,-3106,坐标数量,坐标表)
	觐见BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(8573.18,-2421.26,-3106,300)
	实时移动(9024,-1856,-3111,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 尘封铸台()
	while  true do	
		延迟(2000)
		if 取地图名() == "尘封铸台" then
			改写JSON配置("尘封铸台")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("尘封铸台-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-3759,-13672,1599.88},
		{-4702.36,-12606.5,1557},
		{-5211.92,-11305.1,1557},
		{-4502.44,-10022.5,1557},
		{-3610.2,-8756.4,1557},
		{-2645.81,-7618.88,1752.84},
		{-1770.5,-6616.01,1862},
		{-1450.42,-5329.48,1843.28},
		{-1752.79,-3976.31,1535.7},
		{-3138.52,-3328.74,1347},
		{-3979.83,-2263.66,1347},
		{-2964.53,-1241.36,1179.51},
		{-2133.73,-43.4597,1167},
		{-1336.91,1055.22,1167},
		{-346.561,2103.21,1167},
		{-516.398,3508.2,1167},
		{-1821.4,4124.02,1146},
		---传送
		{-1835.38,4129.92,-179},
		{-2021.42,4994.91,-417},
		{-658.704,5461.85,-417},
		{-568.803,6827.75,-413.358},
		{79.0921,8163.27,-417},
		{664.291,9553.46,-417},
		{1566.96,10729.1,-417},
		{2568,11811.5,-417},
		{3563.62,12870.2,-330.657},
		{4516.08,13737.7,6.25108},
		{5445.62,14890.2,396.967},
		{6469.35,15986.2,789.133},
		{7439.5,17065.9,812},
		---BSS
		{3950,13260,-187.75},
		{4532.22,13951.4,53.6514},
		---传送


		---传送
	}
	坐标数量=#坐标表
	function 尘封BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(4532.22,13951.4,53.6514,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "远征壁垒" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																	
			local jieguo=BOSS寻路(7451.09,17193.3,812)
			if jieguo==3 then
				尘封BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(6896.66,17789.8,812)
			if jieguo==3 then
				尘封BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(6720,16960,812)
			if jieguo==3 then
				尘封BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(7761.2,16771.9,812)
			if jieguo==3 then
				尘封BOSS(1)
				return
			end																																																
		end	
	end	
	导航寻路(-1821.4,4124.02,1146,坐标数量,坐标表)
	延迟(3000)
	按键(0x44) --按键D
	延迟(6000)	
	导航寻路(7439.5,17065.9,812,坐标数量,坐标表)
	尘封BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(8432.51,16927.3,812,300)
	实时移动(8261.32,18043.4,812,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(3000)		
	实时移动(-71.3273,1348.68,807,400)
	实时移动(-272.646,2566.52,807,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("异界入侵")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)	
	实时移动(195.729,653.524,807,400)
	实时移动(898.268,-1154.11,807,400)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("异界入侵")
	延迟(2000)
	跳过对话()
	延迟(2000)
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)		
	实时移动(131.226,-1261.08,807,400)			
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	打开世界关卡("遗世教区")
	延迟(3000)
	进入世界关卡()
	延迟(2000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)			
end
function 遗世教区()
	while  true do	
		延迟(2000)
		if 取地图名() == "遗世教区" then
			改写JSON配置("遗世教区")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("遗世教区-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{2600,9910,1306},
		{2696.69,8507,1306},
		{2709.89,7007.62,1306},
		{2520.99,5674.66,1306},
		{2433.53,4342.84,1306},
		{3516.14,3303.63,1306},
		{4223.22,2201.27,1306},
		{4230.6,766.116,1306},
		{3089.38,-104.076,1306},
		{2640,-1523.54,1306},
		{1317.32,-2239.85,1306},
		{-166.126,-2399.99,1306},
		{-1519.87,-2042.38,1306},
		{-1056.47,-736,1306},
		{348.645,-633.331,1610.1},
		{430.156,814.89,1906},
		{-831.908,1274.57,1906},
		{-2325.09,1158.91,1845.22},
		{-2901.17,2385.81,1314.61},
		{-3813.62,3333.86,1306},
		{-5299.75,3417.78,1306},
		{-6607.51,3107.86,1306},
		{-6493.83,1715.12,1306},
		{-6702.48,420.4,1306},
		{-7951.69,1016.52,1315.19},
		{-8638.99,2149.22,1606},
		{-9583.09,1004.12,1401.38},
		{-10849.4,772.86,1007.88},
		{-11707.6,1986.88,1084.72},
		{-12845.2,1362.31,1306},
		{-12714.8,-120.313,1306},
		{-12034.5,-1280,1389.82},
		{-10968.1,-2275.73,1606},
		{-11589.5,-3491.24,1606},
		{-13060,-3653.12,1376.01},
		{-14040.4,-2780.7,1306},
		{-14775.7,-3695.44,734.552},
		{-16153.1,-3366.17,706},
		{-16779.6,-2022.83,706},
		{-16638.6,-563.918,1010},
		{-15870.1,658.634,1006},
		{-15472.6,2017.18,1006},
		{-16392.8,3164.7,1006},
		{-8011.23,1958.53,1605.35},
		{-16662.4,4461.22,1006},
		{-16813.4,5303.88,1006},
		{-14279.1,-2537.3,1270.33},
		{-7159.94,663.096,1306},
		---遇到BOSS
		{-16610,-390,1009},
		{-15846.1,851.372,1006},
		{-15903.7,2250.7,1006},
		{-16405,3586.63,1006},
		{-16418,3668.75,1006},
		---传送
	}
	坐标数量=#坐标表
	function 遗世BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-16418,3668.75,1006,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "教徒聚落" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(-17290,4970,1006)
			if jieguo==3 then
				遗世BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-17648.4,5636,1006)
			if jieguo==3 then
				遗世BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-16916.1,5922.89,1006)
			if jieguo==3 then
				遗世BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-16277.5,5365.92,1006)
			if jieguo==3 then
				遗世BOSS(1)
				return
			end																																																	
		end	
	end	
	导航寻路(-7159.94,663.096,1306,坐标数量,坐标表)
	导航寻路(-8011.23,1958.53,1605.35,坐标数量,坐标表)
	导航寻路(-14279.1,-2537.3,1270.33,坐标数量,坐标表)
	导航寻路(-16813.4,5303.88,1006,坐标数量,坐标表)
	遗世BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(-16036.3,6432.55,1006,300)
	实时移动(-16537.3,7711.92,1006,300)
	实时移动(-16588.7,9069.81,1006,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 教徒聚落()
	while  true do	
		延迟(2000)
		if 取地图名() == "教徒聚落" then
			改写JSON配置("教徒聚落")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("教徒聚落-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-2640,7700,906},
		{-1229.65,7832.63,906},
		{-157.896,6927.24,906},
		{-111.215,5443.54,906},
		{1245.77,5185.11,1145.29},
		{2255.88,4125.18,1206},
		{2488.58,2679.96,1208.25},
		{2312.96,1198.2,908},
		{2730.42,-82.078,906},
		{3228.77,-1300.83,906},
		{4679.33,-1068.99,906},
		{6058.73,-935.797,758.206},
		{7552,-1152,710},
		{8499.2,-270.205,906},
		{10000.4,69.8054,906},
		{11457.7,112.177,906},
		{12960.6,128,1008.27},
		{14356.4,-107.028,1206},
		{15188.4,-1149.71,1206},
		{0,0,0},
		{15270,-1833.71,1206},
		{16588.9,-1984.47,1001.84},
		{17081.3,-3264.5,665.702},
		{17160,-4581.75,606},
		{15825.6,-4736,606},
		{14510.2,-4281.73,906},
		{13226,-3819.61,906},
		{11761.5,-3537.22,747.451},
		{10387.1,-4034.82,876.934},
		{10094.2,-5405.21,1206},
		{9561.97,-6748.68,1210},
		{8276.19,-6400.28,906},
		{7594.98,-5075.98,906},
		{6906.9,-3841.44,906},
		{7620.44,-2586.95,906},
		{9092.68,-2336,906},
		{10612.1,-2170.73,906},
		{12110.9,-2197.38,1206},
		{13604.9,-2054.68,1206},
		{15088.1,-1953.06,1206},
		{16448.1,-2170.7,1055.13},
		{17019,-3477.41,614.985},
		{17323,-4937.74,606},
		{16907.5,-6230.52,606},
		{16734.1,-6759.04,606},
		---遇到BOSS
		{16671.3,-4313.52,606},

	}
	坐标数量=#坐标表
	function 教徒BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(16671.3,-4313.52,606,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "祈祷庭院" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(16734.1,-6759.04,606)
			if jieguo==3 then
				教徒BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(16269.4,-6227.18,606)
			if jieguo==3 then
				教徒BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(16245.2,-6914.02,606)
			if jieguo==3 then
				教徒BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(17201.5,-6532.46,606)
			if jieguo==3 then
				教徒BOSS(1)
				return
			end																																																	
		end	
	end	
	导航寻路(16734.1,-6759.04,606,坐标数量,坐标表)
	教徒BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(17059.5,-7067.13,606,300)
	实时移动(17207.8,-8313.97,606,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 祈祷庭院()
	while  true do	
		延迟(2000)
		if 取地图名() == "祈祷庭院" then
			改写JSON配置("祈祷庭院")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("祈祷庭院-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-4380,-1000,15},
		{-2954.17,-940.916,15},
		{-1453.92,-877.897,15},
		{-735.043,417.219,15},
		{-678.095,1917.12,15},
		{-617.828,3403.83,315},
		{-798.793,4879.81,315},
		{-783.57,6313.89,315},
		{-664.948,7623.93,17.7523},
		{704.852,8032,15},
		{1995.52,7872,15},
		{3465.98,7954.31,15},
		{4954.7,7838.31,15},
		{6450.73,7712.76,15},
		{8008.42,7412.51,15},
		{9323.37,6976,15},
		{10398.1,7786.35,284.276},
		{11773.1,7654.77,315},
		{13310,7936.01,315},
		{14612.9,8080.55,315},
		{16067.9,8032,315},
		{17434.1,7808.21,315},
		{18803.7,8065.07,431.773},
		{20311.4,8151.41,615},
		---遇到BOSS
		{18366.7,8641.46,318},
		---传送

	}
	坐标数量=#坐标表
	function 祈祷BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(18366.7,8641.46,318,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "狂信圣殿" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(19650,8600,617.438)
			if jieguo==3 then
				祈祷BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(20117.1,9378.11,615)
			if jieguo==3 then
				祈祷BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(20358.1,8605.36,615)
			if jieguo==3 then
				祈祷BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(20164.9,7992.87,615)
			if jieguo==3 then
				祈祷BOSS(1)
				return
			end																																																		
		end	
	end	
	导航寻路(20311.4,8151.41,615,坐标数量,坐标表)
	祈祷BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(20390.7,9169.68,615,300)
	实时移动(21424,8736,615,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 狂信圣殿()
	while  true do	
		延迟(2000)
		if 取地图名() == "狂信圣殿" then
			改写JSON配置("狂信圣殿")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("狂信圣殿-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-9870,9480,4},
		{-11328.3,9250.28,4},
		{-11835.8,7872.42,4},
		{-11768.3,6372.22,4},
		{-11393.8,5097.72,4},
		{-9893.63,4960.24,4},
		{-8579.35,4823.64,4},
		{-7121.52,4960,4},
		{-5715.62,4772.72,4},
		{-4206.13,4855.59,4},
		{-2744.01,4893.23,4},
		{-1283,5119.94,4},
		{180.978,4908.84,4},
		{1325.79,5635.39,4},
		{795.208,6996.87,4},
		{524.551,8421.77,4},
		{1901.55,8899.76,4},
		{3384.44,8863.27,4},
		{3667.05,7334.2,4},
		{4316.59,6103.64,4},
		{4850.66,4634.67,4},
		{4549.16,3285,4},
		{3072.34,3264,4},
		{1641.5,3121.8,4},
		{1145.06,1890.68,4},
		{1060.75,521.501,4},
		{965.551,-777.705,4},
		{499.153,-2047.99,4},
		{-502.479,-3022.73,4},
		{-1436.45,-4152.98,4},
		{-2813.39,-4158.96,4},
		{-3663.4,-5278.8,4},
		{-3732.17,-6724.16,4},
		{-3744,-8064,4},
		{-2251.68,-8226.54,4},
		{-1645.28,-9628.86,4},
		{-1681.99,-11136.8,4},
		{-1649.67,-12633.4,4},
		{-1531.69,-14150.5,4},
		{32.4848,-14208,4},
		{485.542,-14285.2,4},
		---遇到BOSS
		{-915.466,-14179.4,4},
		---传送


	}
	坐标数量=#坐标表
	function 狂信BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-915.466,-14179.4,4,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "异教王庭" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(1129.9,-13544.1,4)
			if jieguo==3 then
				狂信BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(764.013,-14670.1,4)
			if jieguo==3 then
				狂信BOSS(1)
				return
			end		
			local jieguo=BOSS寻路(326.795,-14170,4)
			if jieguo==3 then
				狂信BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(1747.09,-14405,4)
			if jieguo==3 then
				狂信BOSS(1)
				return
			end																																																		
		end	
	end	
	导航寻路(485.542,-14285.2,4,坐标数量,坐标表)
	狂信BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(1215.04,-15027.7,4,300)
	实时移动(1056,-16192,4,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 异教王庭()
	while  true do	
		延迟(2000)
		if 取地图名() == "异教王庭" then
			改写JSON配置("异教王庭")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("异教王庭-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-5920,3130,6},
		{-4713.49,3631.62,6},
		{-3846.62,2381.81,6},
		{-2352.81,2244.43,6},
		{-946.787,2336.59,6},
		{80,1888,6},
		{-600.997,526.006,6},
		{-1375.69,-555.216,6},
		{-2825.1,-69.26,6},
		{-3383.28,-1518.56,6},
		{-2427.2,-2716.88,6},
		{-1105.1,-2658.2,6},
		{-1833.53,-3049.65,6},
		{295.394,-2560,6},
		{1619.56,-2749.05,6},
		{1790.16,-3030.04,6},
		{2737.87,-1808.69,6},
		{-3792,32,6},
		{4071.35,-1226.7,6},
		{4454.52,449.446,6},
		{3926.91,-248.762,6},
		---遇到BOSS
		{896,-2432,6},
		---传送


	}
	坐标数量=#坐标表
	function 异教BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(896,-2432,6,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "孤烟营地" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(3599.95,-39.5594,6)
			if jieguo==3 then
				异教BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(4338.26,77.4999,6)
			if jieguo==3 then
				异教BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(3977.25,-884.872,6)
			if jieguo==3 then
				异教BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(4265.33,-1372.67,6)
			if jieguo==3 then
				异教BOSS(1)
				return
			end																																																	
		end	
	end	
	导航寻路(-3792,32,6,坐标数量,坐标表)
	导航寻路(-1833.53,-3049.65,6,坐标数量,坐标表)
	导航寻路(1790.16,-3030.04,6,坐标数量,坐标表)
	导航寻路(3926.91,-248.762,6,坐标数量,坐标表)
	异教BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(4608,-768,6,300)
	实时移动(5819.44,-18.7522,6,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 孤烟营地()
	while  true do	
		延迟(2000)
		if 取地图名() == "孤烟营地" then
			改写JSON配置("孤烟营地")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("孤烟营地-脚本退出挂机流程")
			return
		end	
	end
	加点()
	实时移动(-6028.75,-5827.96,1916,300)
	实时移动(-4880.63,-5958.44,1847.05,300)
	实时移动(-2172.24,-6097.74,1781,300)
	实时移动(-779.14,-4830.69,1796.12,300)
	实时移动(-587.645,-3244.96,2003.41,300)
	实时移动(416.966,-2331.25,2009.15,300)
	实时移动(1816.7,-1798.42,2020.47,300)
	实时移动(3328.69,509.689,2025.98,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("异界入侵")
	延迟(2000)
	跳过对话()
	延迟(2000)
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)	
	实时移动(3652,-1400.79,2005.9,300)
	实时移动(3837.64,-3251.25,2007,300)
	实时移动(4288.23,-3518.73,2003.99,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("导师馈赠")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)	
	实时移动(3296,-2688,2006,300)
	实时移动(2274.01,-2109.99,2014.06,300)
	实时移动(1831.62,-523.948,2029.19,300)
	实时移动(1041.15,203.003,2048.06,300)
	实时移动(-236.112,1022.81,2030.66,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	打开世界关卡("沙漠边境")
	延迟(3000)
	进入世界关卡()
	延迟(2000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)	
end
function 沙漠边境()
	while  true do	
		延迟(2000)
		if 取地图名() == "沙漠边境" then
			改写JSON配置("沙漠边境")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("沙漠边境-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-8810,-16640,46.375},
		{-7682.54,-15632.3,32},
		{-8356.89,-14406.9,32},
		{-8611.13,-13029.6,32},
		{-7941.8,-11650.9,32},
		{-6752.87,-10640.6,32},
		{-5470.99,-10064.5,32},
		{-4444.14,-8994.03,32},
		{-3821.53,-8918.74,32},
		{-3090.86,-7800.54,32},
		{-2635.46,-6311.88,32},
		{-2401.44,-4889.15,32},
		{-2996.23,-3398.14,32},
		{-3349.93,-1880.59,32},
		{-4152.73,-554.622,32},
		{-4869.76,785.229,32},
		{-4561.7,2268.43,32},
		{-4322.13,3771.72,32},
		{-2791.33,3817.71,32},
		{-1480.42,3285.32,32},
		{-68.1219,2693.63,32},
		{1465.8,2674.73,32},
		{2841.37,3275.32,32},
		{4195.68,3771.18,32},
		{5558.25,3402.77,32},
		{6540.66,2212.34,32},
		{7749.92,1417.1,32},
		{9312.84,1358.24,32},
		{10616.1,1408,32},
		{11906.9,809.255,32},
		{13439.7,588.309,32},
		{14027.1,-843.852,32},
		{15068.2,-1774.76,32},
		{16371.8,-2162.94,32},
		{16985.9,-2506.96,32},
		---遇到BOSS
		{12540,-1190,32},
		{14007.2,-1229.49,32},
		{14376.8,-1215.11,32},
		---传送
	}
	坐标数量=#坐标表
	function 边境BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(14376.8,-1215.11,32,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "无人沙丘" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(15855,-2278,32)
			if jieguo==3 then
				边境BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16245.7,-3071.65,32)
			if jieguo==3 then
				边境BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16826.3,-2129.62,32)
			if jieguo==3 then
				边境BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17108.9,-2943.76,32)		
			if jieguo==3 then
				边境BOSS(1)
				return
			end																																																	
		end	
	end	
	导航寻路(16985.9,-2506.96,32,坐标数量,坐标表)
	边境BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(18840.4,-1744.48,32,300)
	实时移动(19882.4,-2147.79,32,300)
	实时移动(20900,-2384.58,32,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 无人沙丘()
	while  true do	
		延迟(2000)
		if 取地图名() == "无人沙丘" then
			改写JSON配置("无人沙丘")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("无人沙丘-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-14409.2,-1008.11,2491},
		{-13690.5,154.214,2491},
		{-12265.8,-529.917,2491},
		{-10755.9,-891.033,2491},
		{-9333.63,-1229.4,2491},
		{-9486.84,293.647,2491},
		{-9351.91,1840.19,2491},
		{-8976.58,3203.43,2491},
		{-7493.52,3468.86,2491},
		{-6163.62,3047.15,2491},
		{-4749.94,3081.99,2491},
		{-3215.93,3304.05,2491},
		{-1663.37,3072.85,2491},
		{-126.095,2811.32,2491},
		{1144.02,1952,2491},
		{160.407,2933.5,2491},
		{443.671,4373.7,2491},
		{1745.73,4437.95,2491},
		{2798.03,3609.15,2491},
		{4217.18,3286.13,2491},
		{5515.09,3123.84,2491},
		{7068.83,3313.76,2491},
		{8607.42,3186.01,2491},
		{9734.33,2182.39,2491},
		{10424.8,762.82,2491},
		{11119.5,-651.185,2491},
		{11854.1,-1746.92,2491},
		{10991.8,-2945.51,2491},
		{11661.5,-4083.55,2491},
		{13132.6,-3580.33,2491},
		{14591.7,-3423.66,2491},
		{15675.7,-4475.11,2491},
		{16451.7,-5705.66,2491},
		{17065.3,-6957.32,2491},
		{16979.5,-8340.06,2491},
		---遇到BOSS
		{16160,-5780,2491},
		{14957,-6530.52,2491},
		{13925,-7748.31,2491},
		{14544.5,-9022.26,2491},
		{14863.3,-9186.48,2491},
		---传送

	}
	坐标数量=#坐标表
	function 无人BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(14863.3,-9186.48,2491,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "荒漠绿洲" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(16616.7,-8555.07,2491)
			if jieguo==3 then
				无人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17516.8,-8286.53,2491)
			if jieguo==3 then
				无人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17558.9,-9007.53,2491)
			if jieguo==3 then
				无人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(16750.7,-8695.66,2491)
			if jieguo==3 then
				无人BOSS(1)
				return
			end																																																
		end	
	end	
	导航寻路(16979.5,-8340.06,2491,坐标数量,坐标表)
	无人BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(17495,-8433.66,2491,300)
	实时移动(18816,-8384,2506,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 荒漠绿洲()
	while  true do	
		延迟(2000)
		if 取地图名() == "荒漠绿洲" then
			改写JSON配置("荒漠绿洲")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("荒漠绿洲-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-232.806,279.369,16},
		{1211.38,79.3803,16},
		{2752.52,-25.8738,16},
		{4199.23,593.571,16},
		{5353.16,1325.56,16},
		{6065.18,2653.95,16},
		{6394.72,4114.49,16},
		{6610.55,5541.09,16},
		{6639.85,6873.08,16},
		{6729.89,8409.27,16},
		{7324.82,9887.47,16},
		{8345.94,11016.3,16},
		{9784.06,10464.6,16},
		{10483.7,9146.12,16},
		{11050.9,7719.72,16},
		{11769.9,6296.16,16},
		{12527.5,4935.89,16},
		{13236.5,3843.29,16},
		{14744.8,3397.46,16},
		{16327.9,3467.07,16},
		{17889.6,3282.18,16},
		{19457.7,3105.32,16},
		{20783.4,2560,16},
		{20915.3,1146.46,16},
		{20569.5,-362.969,16},
		{21533,-1504.18,16},
		{22686.5,-2584.15,16},
		{23558.2,-3954.34,16},
		{23822.2,-5220.29,16},
		---遇到BOSS
		{23506.5,-2549.33,16},
		---传送


	}
	坐标数量=#坐标表
	function 荒漠BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(23506.5,-2549.33,16,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "迷沙屏障" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(23300,-4000,16)
			if jieguo==3 then
				荒漠BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(23251.2,-5151.08,16)
			if jieguo==3 then
				荒漠BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(24264.1,-5468.25,16)
			if jieguo==3 then
				荒漠BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(24617.9,-4575.89,16)
			if jieguo==3 then
				荒漠BOSS(1)
				return
			end																																																		
		end	
	end	
	导航寻路(23822.2,-5220.29,16,坐标数量,坐标表)
	荒漠BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(24993.4,-5311.19,16,300)
	实时移动(25920.8,-6217.64,16,300)
	实时移动(26864,-6560,16,300)
	实时移动(29260.3,-6938.36,16,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 迷沙屏障()
	while  true do	
		延迟(2000)
		if 取地图名() == "迷沙屏障" then
			改写JSON配置("迷沙屏障")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("迷沙屏障-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-12833,-2146,1603},
		{-11463.6,-2546.33,1603},
		{-10143.3,-2901.8,1603},
		{-9381.91,-4192.49,1611.99},
		{-8348.39,-5349.06,1608},
		{-6932.5,-6008.07,1608},
		{-5923.77,-5063.55,1608},
		{-4854.45,-4245.47,1603},
		{-3456.91,-4160.35,1603},
		{-2253.59,-3612.64,1603},
		{-1802.45,-2183.31,1604.67},
		{-921.625,-1004.13,1603},
		{316.472,-482.763,1605},
		{1827.89,-665.027,1606.46},
		{3356.42,-1056,1623.39},
		{4858.63,-1407.2,1603},
		{6380.4,-1303.43,1603},
		{7646.03,-903.487,1603.77},
		{8800.3,-232.446,1604},
		{9853.86,589.987,1603},
		{11199.5,1393.7,1603},
		{11888.9,2526.22,1607},
		{12364,3991.98,1603},
		{12037.8,5255.32,1603},
		{12113.3,5897.05,1604},
		---遇到BOSS
		{12402,3269,1612.89},
		{12505.9,3791.96,1604},
		---传送
	}
	坐标数量=#坐标表
	function 迷沙BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(12505.9,3791.96,1604,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "狮王谷地" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(12179.9,5297.85,1604)
			if jieguo==3 then
				迷沙BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(11391.6,5850.16,1603)
			if jieguo==3 then
				迷沙BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(11978.2,6337.72,1603)
			if jieguo==3 then
				迷沙BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(12480.2,5730.7,1607)
			if jieguo==3 then
				迷沙BOSS(1)
				return
			end																																																		
		end	
	end	
	导航寻路(12113.3,5897.05,1604,坐标数量,坐标表)
	迷沙BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(11875.9,6149.93,1603,300)
	实时移动(11656.2,7505.36,1603,300)
	实时移动(12107.6,9016.44,1603,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 狮王谷地()
	while  true do	
		延迟(2000)
		if 取地图名() == "狮王谷地" then
			改写JSON配置("狮王谷地")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("狮王谷地-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-21840,7870,1830},
		{-20507.5,7970.12,1830},
		{-20271.5,9479.45,1782.65},
		{-19590.7,10601.1,1608},
		{-18029.6,10774.7,1392.66},
		{-16833.4,9786.91,1335.99},
		{-15911.7,8847.42,1321.24},
		{-14549.3,8365.04,1342.82},
		{-13328.6,7777.21,1336.92},
		{-12694.7,6355.2,1325.6},
		{-11701.4,5201.29,1325},
		{-10199.4,5091.29,1352.1},
		{-9236.65,4001.57,1367.15},
		{-9275,2444.01,1365.19},
		{-9232,1568,1323},
		---箱子
		{-9702.97,161.351,1336.87},
		{-10936.3,-806.411,1509.48},
		{-11955,-1656.9,1575.89},
		{-12817.9,-2931,1577},
		{-12049.4,-4291.36,1575},
		{-10640.4,-4895.72,1777.9},
		{-9242.77,-4522.72,1890},
		{-7806.21,-3872.55,1932.34},
		{-6547.95,-3109.33,2103.79},
		{-5546.21,-2259.49,2100},
		{-4435.02,-1380.66,2106.83},
		{-2871.31,-1448.22,2223},
		{-1310.56,-1509.73,2208},
		{157.2,-1555.75,2205},
		{1539.53,-1407.22,2224.15},
		{2941.53,-1499.62,2234.3},
		{4424.11,-1407.97,2130},
		{5947.05,-1579.25,2106.3},
		{7307.86,-1814.46,1841.3},
		{8765.17,-1375.34,1807.59},
		{8956.4,-1575.45,1805.61},
		---BSS
		{5906.89,-1715.89,2107.02},
		---传送

	}
	坐标数量=#坐标表
	function 谷地BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(5906.89,-1715.89,2107.02,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "孤烟营地" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(8006.53,-1330.91,1815)
			if jieguo==3 then
				谷地BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9010.49,-944.616,1805)
			if jieguo==3 then
				谷地BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9458.74,-1881.76,1805)
			if jieguo==3 then
				谷地BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8566.29,-2352.24,1814)
			if jieguo==3 then
				谷地BOSS(1)
				return
			end																																																	
		end	
	end	
	导航寻路(8956.4,-1575.45,1805.61,坐标数量,坐标表)
	谷地BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(9626.03,-1394.44,1805,300)
	实时移动(11408,-1248,1873,300)
	实时移动(12714.8,-1582.46,1880,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)		
	实时移动(-850,650,2012.72,300)
	实时移动(204.505,1957.15,2003.68,300)
	实时移动(1612.13,1951.78,2002,300)
	实时移动(3451.82,599.89,2024.25,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("异界入侵")
	延迟(2000)
	跳过对话()
	延迟(2000)
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)	
	实时移动(1687.27,1728.53,2013.69,300)
	实时移动(-1118.15,2269.05,2002.49,300)
	实时移动(-1859.21,4267.39,2009.8,300)
	实时移动(-4330.11,4837.73,2005.27,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("异界入侵")
	延迟(2000)
	跳过对话()
	延迟(2000)
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)		
	实时移动(-1861.32,4400.97,2009.67,300)
	实时移动(-1380.02,2377.13,2004,300)
	实时移动(-247.487,1061.07,2028.45,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	打开世界关卡("金色阶梯")
	延迟(3000)
	进入世界关卡()
	延迟(2000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)						
end
function 金色阶梯()
	while  true do	
		延迟(2000)
		if 取地图名() == "金色阶梯" then
			改写JSON配置("金色阶梯")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("金色阶梯-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-8526.74,457.33,-105.394},
		{-7452.82,1095.14,-110},
		{-6109.26,720.353,176.372},
		{-4776.99,670.992,520.781},
		{-3396.39,714.535,505},
		{-2014.39,1149.21,454.463},
		{-552.247,894.124,506.912},
		{1014.29,775.274,505.583},
		{2522.11,623.169,781.056},
		{4082.18,803.574,1105},
		{5646.2,821.207,1538.1},
		{7076.5,386.05,1710},
		{7623.28,864.856,1710},
		---遇到BOSS
		{4170,740,1105},
		{5493.52,731.047,1461.76},
		{5795.67,641.629,1612.83},
		---传送

	}
	坐标数量=#坐标表
	function 金色BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(5795.67,641.629,1612.83,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "古国遗迹" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																
			local jieguo=BOSS寻路(6690,750,1722.31)
			if jieguo==3 then
				金色BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(7274.01,1009.99,1710)
			if jieguo==3 then
				金色BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(7567.22,435.128,1710)
			if jieguo==3 then
				金色BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(6986.9,167.988,1710.88)
			if jieguo==3 then
				金色BOSS(1)
				return
			end																																																			
		end	
	end	
	导航寻路(7623.28,864.856,1710,坐标数量,坐标表)
	金色BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(8544.91,557.676,1713.53,300)
	实时移动(9705.05,712.331,1836.02,300)
	实时移动(11118.7,771.294,2322.49,300)
	实时移动(12425.7,750.917,2363.24,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 古国遗迹()
	while  true do	
		延迟(2000)
		if 取地图名() == "古国遗迹" then
			改写JSON配置("古国遗迹")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("古国遗迹-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{1050,740,503},
		{1112.06,2218.98,503},
		{533.751,3698.11,503},
		{792.514,5105.03,503},
		{1073.81,6465.62,503},
		{1361.87,7946.37,503},
		{1155.54,9283.77,503},
		{1248.04,10677,503},
		{1249.29,12168.9,503},
		{1108.34,13623.5,503},
		{1031.59,15148.5,503},
		{880.779,16631.3,503},
		{785.965,18075.6,503},
		{1132,19442.1,503},
		{596.522,20672,503},
		{-248.11,21683.4,503},
		{-1547.94,21920,503},
		{-3045.37,21855.4,503},
		{-4595.86,21728.6,503},
		{-5912.13,21846.9,503},
		{-7300.53,21826.4,503},
		{-8871.76,21885.9,503},
		{-10156.8,21088.8,503},
		{-10679.1,19836.8,503},
		{-10349.6,18475,503},
		{-10472.1,16971.5,503},
		{-10498.3,15480.9,503},
		{-10101.2,14044.4,503},
		{-11201.2,13116.9,503},
		{-12645.6,12871.1,503},
		{-13470.2,11666.8,503},
		{-14299.3,13031.8,503},
		{-15619.1,13349,503},
		{-15547.9,11905.7,503},
		{-15609.2,10433.8,503},
		{-15757.8,8969.74,503},
		{-15593.2,7447.8,503},
		{-15653.1,6968.31,503},
		{-15507.6,5586.78,503},
		{-16184.4,4456.33,503},
		{-14890,4009.67,503},
		{-15252.9,2564.93,503},
		{-15754.2,1225.93,503},
		{-15597.8,-136.863,503},
		{-15529.1,-1641.08,503},
		{-15602,-3172.06,503},
		{-15670.4,-4743.64,503},
		{-15801.7,-6107.05,503},
		{-15894.8,-6866.95,503},
		---BSS
		{-15832,7670,503},
		{-15580.1,6196.65,503},
		{-15406.3,4666.81,503},
		{-14704.8,3414.45,503},
		{-15519.3,2242.11,503},
		{-15639.9,768.593,503},
		{-15634.2,-712.936,503},
		{-15588.8,-2200.93,503},
		{-15649.9,-2751.87,503},
		---传送

	}
	坐标数量=#坐标表
	function 古国BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-15649.9,-2751.87,503,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "破碎大厅" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																	
			local jieguo=BOSS寻路(-15760,-5660,503)
			if jieguo==3 then
				古国BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-16304,-6624,503)
			if jieguo==3 then
				古国BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-14992.4,-7331.57,503)
			if jieguo==3 then
				古国BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-16299.2,-7765.62,503)
			if jieguo==3 then
				古国BOSS(1)
				return
			end																																																		
		end	
	end	
	导航寻路(-15894.8,-6866.95,503,坐标数量,坐标表)
	古国BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(-16243.5,-7847.65,503,300)
	实时移动(-15890.9,-9494.94,503,300)
	实时移动(-15751.4,-12952.3,503,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 破碎大厅()
	while  true do	
		延迟(2000)
		if 取地图名() == "破碎大厅" then
			改写JSON配置("破碎大厅")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("破碎大厅-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-14901,-50,6},
		{-13530.5,-2.77656,6},
		{-12230.9,265.097,6},
		{-10686.5,-0.00596,6},
		{-9133.73,-130.911,6},
		{-7605.28,33.8345,6},
		{-6118.17,-44.617,6},
		{-5818.79,-1537.7,6},
		{-5868.7,-3114.85,6},
		{-5888.85,-4677.7,6},
		{-5787.43,-5986.9,6},
		{-4347.12,-5568,487.676},
		{-2911.84,-5703.19,606},
		{-1801.6,-4838.11,606},
		{-2032.05,-3269.24,606},
		{-1750.5,-1866.01,606},
		{-706.234,-924.033,607},
		{543.935,-94.6842,606},
		{2007.61,193.153,606},
		{3539.22,96.0001,606},
		{5099.19,69.7936,530.28},
		{6550.01,238.913,606},
		{7721.91,811.551,607.639},
		{7035.89,2184.23,606},
		{6337.47,3519.04,606},
		{5869.76,4997.02,911},
		{7025.52,5756.59,1187.09},
		{7971,6845.01,1206},
		{6971.34,7678.53,1206},
		{5397.25,7754.54,1206},
		{3826.25,7810.1,1206},
		{2568.82,7103.33,1206},
		{1491.74,8000.84,1205.44},
		{376.471,7284.53,911},
		{228.387,5743.08,606},
		{-964.255,5128.09,606},
		{-2244.43,5617.43,606},
		{-3377.88,6399.02,606},
		{-3414.96,7962.57,606},
		{-2449.14,9125.35,606},
		{-1209.56,9972.4,606},
		{365.155,10021.7,606},
		{760.226,9842.29,606},
		{1911.8,10580.3,606},
		{2458.8,10702.7,606},
		---BSS
		{385,9919,606},
		{154.938,9948.73,606},
		---传送


	}
	坐标数量=#坐标表
	function 破碎BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(154.938,9948.73,606,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "日曜之城" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																	
			local jieguo=BOSS寻路(1520,10520,606)
			if jieguo==3 then
				破碎BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(2223.25,10044.7,606)
			if jieguo==3 then
				破碎BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(1788.73,11094.6,606)
			if jieguo==3 then
				破碎BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(2579.63,10746.7,606)
			if jieguo==3 then
				破碎BOSS(1)
				return
			end																																																			
		end	
	end	
	导航寻路(2458.8,10702.7,606,坐标数量,坐标表)
	破碎BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(2649.47,11195.9,606,300)
	实时移动(2724.13,12824.9,606,300)
	实时移动(2784,14016,606,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 日曜之城()
	while  true do	
		延迟(2000)
		if 取地图名() == "日曜之城" then
			改写JSON配置("日曜之城")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("日曜之城-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-5050,-14350,-289},
		{-4696.81,-13078.1,-289},
		{-4563.8,-11510.8,-289},
		{-4555.38,-9945.68,-289},
		{-4506.11,-8370.19,11},
		{-3109.08,-8036.56,11},
		{-1714.21,-7468.57,11},
		{-175.952,-7237.09,540.862},
		{1175.72,-7511.57,606},
		{1377.51,-9025.29,606},
		{2469.92,-9940.95,606},
		{3610.57,-9290.85,616.404},
		{3491.02,-7747.92,911},
		{4768.97,-7716.97,1159.04},
		{5687.25,-6609.51,1211},
		{5478.88,-5256.97,1110.64},
		{4167.46,-5403.29,1211},
		{3298.26,-4385.51,1073.85},
		{2872.43,-3122.89,911},
		{1455.3,-3290.54,606},
		{1060.47,-2021.51,606},
		{2385,-1511.48,617.117},
		{3414.23,-571.116,606},
		{2844.42,896.096,607.997},
		{2572.82,2377.22,606},
		{1755.72,3658.1,606},
		{1558.15,5217.04,606},
		{2879.59,5239.99,606},
		{4391.81,5133.68,1189.85},
		{5858.59,5075.3,1206},
		{7073.32,5225.56,1748.25},
		{8620.57,5280,1806},
		{8756.42,6611.13,1806},
		{9040.95,8097.9,1806},
		{9118.43,9595.33,1966.57},
		{9024,10240,2301},
		---传送
		{8941.77,11620.5,2416},
		{9035.19,11892.2,2416},
		---BSS


	}
	坐标数量=#坐标表
	function 日曜BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(9024,10240,2301,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "流金王座" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																	
			local jieguo=BOSS寻路(9220,11310,2416)
			if jieguo==3 then
				日曜BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8396.29,11603.5,2416)
			if jieguo==3 then
				日曜BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(9739.4,11446.4,2416)
			if jieguo==3 then
				日曜BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8944.22,12221.8,2416)
			if jieguo==3 then
				日曜BOSS(1)
				return
			end																																																			
		end	
	end	
	导航寻路(9035.19,11892.2,2416,坐标数量,坐标表)
	日曜BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(9046.48,12390.9,2416,300)
	实时移动(8959.58,14404.2,2416,300)
	实时移动(8735.85,15419.1,2416,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 流金王座()
	while  true do	
		延迟(2000)
		if 取地图名() == "流金王座" then
			改写JSON配置("流金王座")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("流金王座-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-13950,8450,5},
		{-12373.2,8348.72,5},
		{-11070.4,8224,5},
		{-9619.73,8427.94,5},
		{-8070.94,8460.41,5},
		{-6486.88,8553.63,5},
		{-4922.08,8640.34,5},
		{-3457.69,8071.9,5},
		{-2479.45,7196.31,5},
		{-2924.46,5824.17,5},
		{-3258.75,4377.41,5},
		{-3539.79,2885.56,5},
		{-3341.08,1562.16,5},
		{-2101.45,1054.75,5},
		{-586.579,1318.41,5},
		{828.659,1344,532.538},
		{2353.11,1488.07,610},
		{3918.04,1500.39,610},
		{5493.12,1320.91,610},
		{6932.2,1017.22,610},
		{8415.75,608.606,610},
		{9831.42,305.162,610},
		{11264,-59.9929,959.013},
		{11504.1,-32.6721,1081},
		{11993.6,120.366,1212.61},
		---传送
		{13053,147.074,1215},
		{13539.9,-554.47,1215},
		---BSS
	}
	坐标数量=#坐标表
	function 王座BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(11993.6,120.366,1212.61,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "孤烟营地" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																	
			local jieguo=BOSS寻路(13730,-19.999,1215)
			if jieguo==3 then
				王座BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(13310,530.231,1215)
			if jieguo==3 then
				王座BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(13480.1,-538.749,1215)
			if jieguo==3 then
				王座BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(12890.1,-755.228,1215)
			if jieguo==3 then
				王座BOSS(1)
				return
			end																																																					
		end	
	end	
	导航寻路(13539.9,-554.47,1215,坐标数量,坐标表)
	王座BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(14557.8,171.681,1215,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	实时移动(763.253,1973.37,2002.66,300)
	实时移动(2454.39,1192.25,2005.74,300)
	实时移动(3427.15,681.138,2023.86,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("异界入侵")
	延迟(2000)
	跳过对话()
	延迟(2000)
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)
	实时移动(865.776,1991.65,2002.24,300)
	实时移动(-1574.47,2534.68,2004.49,300)
	实时移动(-2233.33,4752.66,2003,300)
	实时移动(-4429.57,4776.78,2004,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("异界入侵")
	延迟(2000)
	跳过对话()
	延迟(2000)
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)
	实时移动(-2066.17,4420.02,2002.06,300)
	实时移动(-1436.45,2555.98,2004,300)
	实时移动(-167.161,1014.76,2032.21,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(6000)
	打开世界关卡("隐秘丛林")
	延迟(3000)
	进入世界关卡()
	延迟(2000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)									
end
function 隐秘丛林()
	while  true do	
		延迟(2000)
		if 取地图名() == "隐秘丛林" then
			改写JSON配置("隐秘丛林")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("隐秘丛林-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{4072.42,3165.36,1629.72},
		{4432,2208,1636},
		{5751.41,2369.34,1636},
		{7158.11,2228.84,1636},
		{8503.46,2451.44,1636},
		{9937.41,2853.24,1636},
		{11057.1,3852.57,1637.87},
		{12227.8,4838.31,1636},
		{13384,5878.81,1636},
		{14326.5,7016.69,1636},
		{15387.4,8052.91,1673.6},
		{16504.9,9033.97,1665.64},
		{17530.7,10261.7,1636},
		{18495.3,11197.7,1636},
		{19220.9,12559,1636},
		{20465,13367.4,1636},
		{20952.5,14842.2,1636},
		{21071.6,16412.7,1636},
		{19831,17080,1636},
		{19075.6,18185.7,1636},
		{19832.8,19249.6,1636},
		---遇到BOSS
		{16470,8970,1672.47},
		{16705.6,10422.8,1636},
		{17010.8,11941.4,1636},
		{18194.2,12982.2,1636},
		{18604.8,14361.5,1636},
		{18593.7,15683.3,1636},
		{18836.4,16995.2,1636},
		{18849.5,17936.7,1636},
		---传送


	}
	坐标数量=#坐标表
	function 隐秘BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(18849.5,17936.7,1636,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "巨木之森" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																		
			local jieguo=BOSS寻路(19295,18710,1636)
			if jieguo==3 then
				隐秘BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(19220.2,19469.4,1636)
			if jieguo==3 then
				隐秘BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(19954,19312.7,1636)
			if jieguo==3 then
				隐秘BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(19145.9,19198.6,1636)
			if jieguo==3 then
				隐秘BOSS(1)
				return
			end																																																				
		end	
	end	
	导航寻路(19832.8,19249.6,1636,坐标数量,坐标表)
	隐秘BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(20442.9,19508.5,1654.6,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 巨木之森()
	while  true do	
		延迟(2000)
		if 取地图名() == "巨木之森" then
			改写JSON配置("巨木之森")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("巨木之森-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{21250,10260,1147},
		{20199.5,9442.24,1147},
		{18711.6,10019.6,1147},
		{17555.8,9063.65,1147},
		{17604.5,7706.61,1147},
		{18213.3,6325.34,1147},
		{18264.5,4841.1,1151.27},
		{17593.2,3515.17,1147},
		{16500.7,4486.89,1147},
		{15228.9,5154.06,1147},
		{13693.5,5244.68,1147},
		{12317.2,4933.57,1147},
		{12621.8,3406.03,1147},
		{12990.4,1984,1147},
		{14200.1,1108.16,1147},
		{15461.7,227.724,1147},
		{15733.8,-1236.4,1147},
		{14643.3,-2303.89,1166},
		{13549.4,-3335.15,1148},
		{12080.2,-3244.17,1147},
		{10823.9,-2447.75,1147},
		{9555.7,-2897.69,1147},
		{8213.62,-2657.01,1147},
		{7716.11,-1151.33,1147},
		{7192.68,271.722,1162},
		{6551.12,1708.85,1147},
		{6349.1,3059.37,1147},
		{5020.04,3128.08,1147},
		{4227.55,1814.74,1147},
		{2809.1,1407.53,1147},
		{2681.7,-92.5953,1149.89},
		{2023.36,-1492.66,1166},
		{1297.99,-2604.16,1147},
		{1152,-3712,1147},
		---遇到BOSS
		{2540,-750,1162},
		{2242.6,-1049.64,1162},
		---传送
	}
	坐标数量=#坐标表
	function 巨木BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(2242.6,-1049.64,1162,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "毒瘴幽谷" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																		
			local jieguo=BOSS寻路(1300,-3500,1147)
			if jieguo==3 then
				巨木BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(605.913,-3313.65,1147)
			if jieguo==3 then
				巨木BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(1354.28,-2839.88,1147)
			if jieguo==3 then
				巨木BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(2034.83,-3294.44,1147)
			if jieguo==3 then
				巨木BOSS(1)
				return
			end																																																				
		end	
	end	
	导航寻路(1152,-3712,1147,坐标数量,坐标表)
	巨木BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(1311.29,-3427.84,1147,300)
	实时移动(2035.65,-4346.3,1147,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 毒瘴幽谷()
	while  true do	
		延迟(2000)
		if 取地图名() == "毒瘴幽谷" then
			改写JSON配置("毒瘴幽谷")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("毒瘴幽谷-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{18431,8978,1131},
		{17115.2,8485.21,1131},
		{15709.4,7866.14,1131},
		{14379.9,7666.61,1131},
		{13849.8,6323.59,1131},
		{13341.6,4932.86,1131},
		{12878.2,3456.56,1131},
		{13405.9,2001.79,1131},
		{14817.4,1647.89,1131},
		{16062.2,896,1131},
		{17584.6,959.984,1131},
		{19010.9,1180.07,1131},
		{20159.3,438.625,1131},
		{20389.8,-973.446,1131},
		{20128.5,-2498.01,1131},
		{20055.1,-4072.75,1131},
		{18743.2,-3993.46,1131},
		{17233.6,-4509.6,1131},
		{15707,-4800,1131},
		{14319.6,-5439.56,1131},
		{13053.9,-6040.79,1131},
		{11496.3,-6241.8,1131},
		{10215.7,-7085.87,1131},
		{8951.14,-7878.15,1131},
		{7514.87,-7290.97,1131},
		{6351.22,-6433.56,1131},
		{4933.05,-6076.73,1131},
		{3395.09,-6009.08,1131},
		{1882.09,-5591.41,1131},
		{1771.17,-4076.69,1131},
		{2148.79,-2587.26,1131},
		{2380.1,-1079.4,1131},
		{3074.46,323.126,1131},
		{3988.15,1320.27,1131},
		{4936.77,2257.54,1131},
		{6218.41,2545.61,1131},
		{6908.6,1220.47,1131},
		{7570.56,-167.883,1131},
		{8134.05,-1629.03,1131},
		{7973.57,-2257.34,1131},
		---遇到BOSS
		{7220,510,1131},
		{7341.51,109.11,1131},
		---传送

	}
	坐标数量=#坐标表
	function 毒瘴BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(341.51,109.11,1131,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "异变秘殿" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																			
			local jieguo=BOSS寻路(8479.99,-2107.75,1131)
			if jieguo==3 then
				毒瘴BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(7649.18,-2129.46,1131)
			if jieguo==3 then
				毒瘴BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8291.25,-2858.79,1131)
			if jieguo==3 then
				毒瘴BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(8978.77,-2402.02,1131)
			if jieguo==3 then
				毒瘴BOSS(1)
				return
			end																																																				
		end	
	end	
	导航寻路(7973.57,-2257.34,1131,坐标数量,坐标表)
	毒瘴BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(9520,-2144,1131,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 异变秘殿()
	while  true do	
		延迟(2000)
		if 取地图名() == "异变秘殿" then
			改写JSON配置("异变秘殿")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("异变秘殿-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{2287,-18376,321},
		{2298.83,-17013.7,321},
		{2295.55,-15461.8,353.183},
		{2472.63,-14052.5,351},
		{4033.37,-14144,236},
		{5598.5,-14120.8,321},
		{7144.08,-14180.3,321},
		{8604.24,-14210.7,318.084},
		{10178.2,-14225.6,321},
		{10409.1,-12912.1,321},
		{10504,-11561.8,321},
		{9040,-11294.8,321},
		{7771.69,-11808,321},
		{6258.49,-12219.1,321},
		{5576.98,-12339.6,321},
		{4515.5,-11554.4,321},
		{3089.27,-11218,321},
		{2414.3,-9970.86,86},
		{2503.76,-8399.47,86},
		{2464.51,-6823.86,86},
		{2552.04,-5296.14,86},
		{3924.5,-5221.71,86},
		{5338.94,-5303.21,86},
		{6734.93,-5095.51,86},
		{8289.69,-5109.44,86},
		{9792.92,-4928,86},
		{9974.42,-3549.33,86},
		{10010.7,-1973.29,86},
		{9933.32,-559.331,86},
		{10024.8,-123.423,86},
		---遇到BOSS
		{9960,-2760,86},
		---传送


	}
	坐标数量=#坐标表
	function 异变BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(9960,-2760,86,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "幻影地宫" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																			
			local jieguo=BOSS寻路(9925.48,-138.963,86)
			if jieguo==3 then
				异变BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(9456.93,367.173,86)
			if jieguo==3 then
				异变BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(10551.3,522.046,86)
			if jieguo==3 then
				异变BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(10239.5,-479.306,86)
			if jieguo==3 then
				异变BOSS(1)
				return
			end																																																					
		end	
	end	
	导航寻路(10024.8,-123.423,86,坐标数量,坐标表)
	异变BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(9876,1988.49,86,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 幻影地宫()

	while  true do	
		延迟(2000)
		if 取地图名() == "幻影地宫" then
			改写JSON配置("幻影地宫")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("幻影地宫-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-3573,-9675,503},
		{-3391.9,-8363.23,503},
		{-3307.82,-6862.58,503},
		{-2004.14,-6385.61,503},
		{-469.396,-6272,503},
		{926.427,-6253.7,503},
		{2405.68,-6116.99,503},
		{3502.02,-5283.21,503},
		{3456,-5504,503},
		---遇到BOSS
		{2816,-4352,503},
		---遇到BOSS
		{1701.63,-3258.72,503},
		{2702.29,-2357.93,503},
		---遇到BOSS
		{4111.92,-2786.38,503},
		{5205.5,-1951.69,503},
		{5035.64,-604.326,503},
		{5065.68,915.158,503},
		{5073.91,2063.4,503},
		---遇到BOSS
		{6435.69,2117.76,503},
		{7833.85,2436.4,503},
		{8992.77,3144.31,503},
		{9899.7,4263.65,503},
		{9346.12,5484.59,503},
		{8502.66,6548.34,503},
		{8333.86,8073.83,503},
		{7244.96,7190.91,503},
		{5824.1,7200,503},
		{4432.12,7040,503},
		{2958.7,6996.25,503},
		{3134.55,6119.22,503},
		---遇到BOSS
		{2966.13,4733.29,503},
		{2640.99,3242.35,503},
		{1437.6,2488.26,503},
		{1106.04,1470.59,503},
		---遇到BOSS
		{1053.85,75.8378,503},
		{975.989,-720.277,503},
		---遇到BOSS
		{-403.814,-602.053,503},
		{-585.143,934.889,503},
		{-545.896,2420.46,503},
		{-379.915,3769.11,503},
		{-479.961,5182.53,503},
		{-481.7,6557.03,503},
		{-581.193,7876.06,503},
		{-576.982,9414.05,503},
		{-531.021,10916.5,503},
		{-604.364,12487.1,503},
		{-541.861,14058.3,503},
		{-561.226,15626.8,503},
		{-783.985,16998.5,503},
		{-584.325,18391,503},
		{-520.636,19958,503},
		{-475.492,21533.7,503},
		{-430.018,23119.7,503},
		{-389.457,24686.5,503},
		{-695.764,25027.4,504},
		---遇到BOSS
		{-440,14970,503},
		{-925.286,16468.4,503},
		{-755.954,18034.5,503},
		{-561.311,19526.4,503},
		{-331.36,20961.1,503},
		{-427.437,22403.9,503},
		{-452.071,22490.8,503},
		---传送

	}
	坐标数量=#坐标表
	function 地宫BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-452.071,22490.8,503,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(8500)
			if name == "避难所-余烬之息" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																			
			local jieguo=BOSS寻路(-450,25016,503.75)
			if jieguo==3 then
				地宫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-1275.2,24806.4,503)
			if jieguo==3 then
				地宫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(306.378,25079.7,503)
			if jieguo==3 then
				地宫BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-752.122,24502,503)
			if jieguo==3 then
				地宫BOSS(1)
				return
			end																																																						
		end	
	end	
	导航寻路(3456,-5504,503,坐标数量,坐标表)
	导航寻路(2816,-4352,503,坐标数量,坐标表)
	导航寻路(2702.29,-2357.93,503,坐标数量,坐标表)
	导航寻路(5073.91,2063.4,503,坐标数量,坐标表)
	导航寻路(3134.55,6119.22,503,坐标数量,坐标表)
	导航寻路(1053.85,75.8378,503,坐标数量,坐标表)
	导航寻路(975.989,-720.277,503,坐标数量,坐标表)
	导航寻路(-695.764,25027.4,504,坐标数量,坐标表)
	地宫BOSS(0)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	实时移动(545.408,24978.9,503,400)
	实时移动(1665.24,25570.1,503,400)
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)	
	实时移动(1790,-3210,3234.97,300)
	实时移动(1237.16,-1816.57,3096.16,300)
	实时移动(2217.08,-1799.53,3093,300)	
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	对话选项("导师馈赠")
	延迟(2000)
	跳过对话()
	延迟(2000)	
	领取任务奖励(1)	
	延迟(2000)
	领取任务奖励(1)	
	延迟(2000)
	实时移动(2133.33,1343.9,3097,300)
	实时移动(4292.28,2442.11,3119.72,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)	
	跳过对话()
	延迟(2000)								
end
function 信仰之墙()
	while  true do	
		延迟(2000)
		if 取地图名() == "信仰之墙" then
			改写JSON配置("信仰之墙")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("信仰之墙-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{19630,34140,5153},
		{19775.7,35676.8,5313.54},
		{21180.1,35829.7,5313},
		{22665.1,35761,5313},
		{24068.2,35664.2,5313},
		{24299.3,34309.7,5313},
		{25599.4,34097.1,5313},
		{27068.8,34060.4,5335.52},
		{28410.8,33770.1,5502},
		{29172.6,32684,5498.63},
		{29151.7,31144.7,5318},
		{28949,29708.8,5318},
		{29408,28350.4,5318},
		{28912.9,26914.1,5323},
		{29082.2,25543,5323},
		{30386.9,25205,5323},
		{31871,25010.1,5517},
		{31928,23526.7,5693},
		{31919.7,22068.9,5519.88},
		{30516.5,21768.1,5333.51},
		{28961.8,21499.2,5332.07},
		{29051.9,20102.6,5515.53},
		{29340.2,18692.6,5613},
		{30236.7,17580.1,5613},
		{31616.5,17496.9,5376.48},
		{32064,18924,5213},
		{33410.6,18533.4,5213},
		{34885.4,18456.2,5213},
		{36394.9,18481.7,5213},
		{37271.1,17503.7,5213},
		{38681.3,17423.2,5213},
		{40052.9,17414.8,5306.23},
		{39891.2,17625.7,5275.4},
		{41174.3,17394.6,5363},
		{41520.6,17029.7,5363},
		---BSS
		{40248.8,17427.5,5355.21},
		{39496.8,17415.3,5215.49},
		---传送
		{40821.4,17824,5366},

	}
	坐标数量=#坐标表
	function 信仰BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(39496.8,17415.3,5215.49,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,3000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(2500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																			
			local jieguo=BOSS寻路(41616,17760,5363)
			if jieguo==3 then
				信仰BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(41114.5,16814.2,5363)
			if jieguo==3 then
				信仰BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(40976.3,17876.1,5363.81)
			if jieguo==3 then
				信仰BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(41456.2,17949.4,5363)
			if jieguo==3 then
				信仰BOSS(1)
				return
			end																																																						
		end	
	end	
	导航寻路(41520.6,17029.7,5363,坐标数量,坐标表)
	信仰BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 极冬王座()
	while  true do	
		延迟(2000)
		if 取地图名() == "极冬王座" then
			改写JSON配置("极冬王座")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("极冬王座-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-1110,-710,40.6875},
		{-228.048,458.932,40},
		---遇到BOSS
		{-452.518,-82.3433,40},
	}
	坐标数量=#坐标表
	function 极冬BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-228.048,458.932,40,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(2500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(-1043.67,457.428,40)
			if jieguo==3 then
				极冬BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-68.8345,428.994,40)
			if jieguo==3 then
				极冬BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-600.344,-480.502,40)
			if jieguo==3 then
				极冬BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-187.163,-1065.26,41)
			if jieguo==3 then
				极冬BOSS(1)
				return
			end																																																								
		end	
	end	
	导航寻路(-228.048,458.932,40,坐标数量,坐标表)
	极冬BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 亚人村落()
	while  true do	
		延迟(2000)
		if 取地图名() == "亚人村落" then
			改写JSON配置("亚人村落")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("亚人村落-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-5241,-9069,321},
		{-4764.85,-7647.49,175.715},
		{-5476.76,-6402.71,91.1911},
		{-6263.69,-5136.62,86.5581},
		{-5182.65,-4248.33,66.4222},
		{-4418.61,-3127.16,69.2764},
		{-3110.99,-2637.97,331.289},
		{-2409.46,-1548.81,498.713},
		{-3299.96,-440.078,408.01},
		{-4428.3,260.889,371},
		{-5636.89,1130.28,371},
		{-7017.94,1133.05,369.592},
		{-8245.09,2071.92,30.9013},
		{-8707.53,3495.1,26},
		{-8763.87,4923.55,-21.6859},
		{-7776.9,5951.4,-295.113},
		{-6605.25,6860.52,-284},
		{-5301.88,7494.52,-284},
		{-4137.84,8415.7,-277.731},
		{-2864.82,8898.72,-59},
		{-1801.32,8014.59,-59},
		{-1822.29,6640.39,-290.826},
		{-1884.09,5156.61,-369},
		{-1975.42,3629.43,-365.42},
		{-1143.54,2378.45,-369},
		{-15.0442,1674,-369},
		{1466.6,1717.19,-369},
		{2772.06,1469.41,-326.129},
		{3898.9,864,-60},
		{5213.26,902.177,-49.3642},
		{6046.31,2125.45,-54},
		{7306.93,2844.01,-50.8752},
		{8153.06,1639.35,252.885},
		{8386.04,392.744,579.907},
		{9620.43,1111.89,593.683},
		{10536.5,8.72817,904.597},
		{900,1890,-369},
		{2267.1,1753.95,-366},
		{3328.78,870.68,-118.268},
		{4767.7,941.821,-59},
		{6063.76,672.604,40.6841},
		{7457.1,1191.61,259.772},
		{8336.61,245.652,578.677},
		{7629,-1049.96,599.68},
		{8604.29,-1923.65,905.943},
		{9465.77,-710.953,909.783},
		{10324.2,479.665,904.031},
		{9744.64,-852.136,908},
		{10282.1,-2183.19,906},
		{7790.65,-1636.68,763.094},
		{11379.2,-3085.54,902.423},
		{12151.2,-3809.31,901},
		---遇到BOSS
		{11016.4,-3094.76,905.895},
		{12319.3,-3000.89,901},
		{12866.7,-4276.66,902},
		{11934.8,-3176.95,901},
		{13285.2,-3344.34,901},
		{12058,-3801.33,901},
		{10608,-2528,917},
		---传送

	}
	坐标数量=#坐标表
	function 亚人BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(10608,-2528,917,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(2500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(11016.4,-3094.76,905.895)
			if jieguo==3 then
				亚人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(12319.3,-3000.89,901)
			if jieguo==3 then
				亚人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(11934.8,-3176.95,901)
			if jieguo==3 then
				亚人BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(12866.7,-4276.66,902)
			if jieguo==3 then
				亚人BOSS(1)
				return
			end																																																								
		end	
	end	
	导航寻路(7790.65,-1636.68,763.094,坐标数量,坐标表)
	导航寻路(12151.2,-3809.31,901,坐标数量,坐标表)
	亚人BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 呼啸矿道()
	while  true do	
		延迟(2000)
		if 取地图名() == "呼啸矿道" then
			改写JSON配置("呼啸矿道")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("呼啸矿道-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-22290,-22510,394},
		{-20923.9,-22234.5,394},
		{-19571.4,-21409,394},
		{-18549.4,-20333.5,394},
		{-17511.8,-19249,394},
		{-16619.7,-18045.3,394},
		{-15850.7,-16763.3,394},
		{-15155.1,-15439.6,394},
		{-13881.4,-14848,394},
		{-12473.4,-15157.6,394},
		{-11294.3,-14395.4,394},
		{-10373.7,-13195.4,394},
		{-10681.6,-11747.8,394},
		{-9349.71,-11136,394},
		{-8046.59,-11712,564.809},
		{-6718.88,-11430.5,569},
		{-5768.12,-10351,569},
		{-5052.92,-9030.63,569},
		{-5039.96,-7563.97,569},
		{-5753.9,-6244.06,569},
		{-6638.98,-5044.09,569},
		{-7773.36,-4076.35,569},
		{-8781.77,-3172.33,569},
		{-9711.5,-2216.54,569},
		{-10626.9,-3317.72,569},
		{-11620.6,-4404.61,569},
		{-10809.4,-5471.29,569},
		{-12163,-4871.73,569},
		{-13113.4,-3847.72,575.589},
		{-12794.6,-5217.93,573},
		{-13688.8,-6322.56,434.225},
		{-14674.9,-7435.48,434},
		{-15989.2,-7157.48,434},
		{-17046.9,-7941.14,434},
		{-18087.4,-6956.68,434},
		{-18979.7,-5768.58,461.156},
		{-18969,-4306.66,586.792},
		{-18792.6,-2846.35,584},
		{-18164.6,-1528.3,584},
		{-17036.6,-791.976,584},
		{-16038.2,118.759,584},
		{-14899.9,1056.73,495.443},
		{-14363,2429.73,404},
		{-14825,3781.75,404},
		{-14138.8,5035.14,404},
		{-12912.8,5757.6,404},
		{-11413.1,5736.54,404},
		{-10044.5,5685.99,404},
		{-8836.31,6658.81,410.044},
		{-8672.05,7995.27,589.148},
		{-8435.35,9301.28,589},
		{-7900.55,10586.4,589},
		{-7568,10592,589},
		---传送
		{-22232,8437.01,-257},
		{-21890.4,9821.59,-123.925},
		{-21895.2,10510,-126},
		---BSS
	}
	坐标数量=#坐标表
	function 呼啸BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-7568,10592,589,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)	
			实时移动(-22236.3,9120.12,-221.501,300)		
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(2500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(-21895.2,10510,-126)
			if jieguo==3 then
				呼啸BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-22240,11072,-126)
			if jieguo==3 then
				呼啸BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-22550.4,10203.2,-126)
			if jieguo==3 then
				呼啸BOSS(1)
				return
			end				
			local jieguo=BOSS寻路(-21826.2,10001.8,-126)
			if jieguo==3 then
				呼啸BOSS(1)
				return
			end																																																								
		end	
	end	
	导航寻路(-7568,10592,589,坐标数量,坐标表)
	延迟(3000)
	按键(0x44) --按键D
	延迟(5000)	
	实时移动(-22236.3,9120.12,-221.501,300)
	呼啸BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 蛮荒原野()
	while  true do	
		延迟(2000)
		if 取地图名() == "蛮荒原野" then
			改写JSON配置("蛮荒原野")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("蛮荒原野-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-8435,-18601,32},
		{-9090.45,-17467.1,32},
		{-9116.78,-16063.6,32},
		{-9056.13,-14580.3,32},
		{-9753.56,-13447.6,32},
		{-10071.3,-11977.4,32},
		{-9965.35,-10523.5,32},
		{-9825.35,-9116.01,32},
		{-9690.24,-7732.47,32},
		{-9846.03,-6407.5,32},
		{-9194.2,-4952.21,32},
		{-9640.23,-3547.43,32},
		{-9989.46,-2110.5,32},
		{-9059.78,-1138.93,32},
		{-8185.41,56.607,32},
		{-7159.71,1161.04,32},
		{-5752.43,1374.91,32},
		{-4423.55,1329.57,32},
		{-4722.19,2806.45,32},
		{-4590.41,4276.68,32},
		{-3082.26,4086.93,32},
		{-1735.94,3548.27,32},
		{-780.738,2395.62,32},
		{188.297,1511.3,32},
		{1509.11,836.11,32},
		{2700.47,-68.7865,32},
		{3137.62,-1375.16,32},
		{4150.3,-2348.6,32},
		{5213.4,-3331.4,32},
		{6237.23,-4441.99,32},
		{6508.62,-5784.67,32},
		{7237.15,-7043.25,32},
		{8792.74,-7119.85,32},
		{10016.9,-6344.6,32},
		{10787.4,-5068.78,32},
		{10439.2,-3620.46,32},
		{10770.6,-2269.28,32},
		{12106.5,-1817.06,32},
		{13279.5,-1168.14,32},
		{14644.9,-1365.5,32},
		{15621.7,-2228.29,32},
		{16782.1,-2956.14,32},
		{17742.7,-2886.37,32},
		---遇到BOSS
		{18767.7,-2547.96,32},
		{17845.7,-1823.7,32},
		{17841.2,-2933.9,32},
		{17831.6,-3712.77,32},
		{16710,-2875.11,32},
		{14371.5,-1112.61,32},
		---传送
	}
	坐标数量=#坐标表
	function 原野BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(14371.5,-1112.61,32,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(18767.7,-2547.96,32)
			if jieguo==3 then
				原野BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17845.7,-1823.7,32)
			if jieguo==3 then
				原野BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17841.2,-2933.9,32)
			if jieguo==3 then
				原野BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(17831.6,-3712.77,32)
			if jieguo==3 then
				原野BOSS(1)
				return
			end																																																								
		end	
	end	
	导航寻路(17742.7,-2886.37,32,坐标数量,坐标表)
	原野BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 龙陨荒野()
	while  true do	
		延迟(2000)
		if 取地图名() == "龙陨荒野" then
			改写JSON配置("龙陨荒野")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("龙陨荒野-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-10550,-7450,6218.72},
		{-9053.22,-7020.3,6081.19},
		{-9746.44,-7448.29,6193.67},
		{-8759.64,-6417.67,5986.03},
		{-9664.64,-5300.35,5927.8},
		{-10984.9,-5189.01,5927},
		{-11081.2,-3693.57,5930.36},
		{-11027.4,-2306.37,5932},
		{-10316.5,-1029.94,5927},
		{-9483.44,209.007,5936.23},
		{-8357.67,997.194,5934.6},
		{-7367.38,2106.69,5923.56},
		{-6564.39,3372.31,5912},
		{-5273.94,3735.86,5917},
		{-3851.48,3581.88,5919},
		{-2431.86,4024.69,5921.11},
		{-1780.64,5272.09,5918.15},
		{-1770.2,6721.94,5918.33},
		{-1296.82,8048.19,5842.82},
		{-43.9797,7230.2,5579.23},
		{899.751,6133.53,5328.73},
		{1915.31,5874.03,5202.06},
		{2073.49,7344.49,5094.62},
		{2609.95,8798.1,4920.18},
		{3690.11,9904.45,4897},
		{5111.16,9727.07,4897},
		{6488.93,9283.86,4897},
		{7250.11,9749.92,4897},
		---遇到BOSS
		{8096.18,8676.59,4897},
		{7476.62,9095,4897},
		{7206,8559.48,4897},
		{6706.94,9322.63,4897},
		{8019.62,9048.77,4897},
		{4930.2,9603.57,4897},
		---传送

	}
	坐标数量=#坐标表
	function 龙陨BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(4930.2,9603.57,4897,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(8096.18,8676.59,4897)
			if jieguo==3 then
				龙陨BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(7476.62,9095,4897)
			if jieguo==3 then
				龙陨BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(7206,8559.48,4897)
			if jieguo==3 then
				龙陨BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(6706.94,9322.63,4897)
			if jieguo==3 then
				龙陨BOSS(1)
				return
			end																																																								
		end	
	end	
	导航寻路(7250.11,9749.92,4897,坐标数量,坐标表)
	原野BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 聚兽平原()
	while  true do	
		延迟(2000)
		if 取地图名() == "聚兽平原" then
			改写JSON配置("聚兽平原")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("聚兽平原-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-9130,-14510,606},
		{-7660.06,-14185.7,606},
		{-6252.09,-14629.8,606},
		{-4783.44,-14327,606},
		{-3313.51,-14106.5,606},
		{-2237.28,-13198,606},
		{-1161.57,-12157.7,606},
		{-581.044,-10805.5,606},
		{-271.335,-9337.53,606},
		{-980.99,-8083.89,606},
		{-1796.25,-6853.33,606},
		{-2530.42,-5545.71,606},
		{-3163.53,-4199.1,606},
		{-2821.35,-2890.7,606},
		{-3228.28,-4219.69,606},
		{-2299.47,-5234.57,606},
		{-1634.15,-6576.76,606},
		{-955.164,-7914.39,606},
		{232.311,-8691.96,606},
		{1546.83,-8016.42,610.162},
		{2705.65,-7006,606},
		{4017.02,-6317.38,606},
		{5243.23,-5601.6,600.95},
		{5665,-4185.91,624.246},
		{6087.75,-2826.53,607},
		{6152.57,-1330.91,608},
		{6149.5,165.032,603},
		{6772.98,1515.48,597.849},
		{8187.87,1739.99,741.284},
		{8676.58,502.109,985.273},
		{8971.4,-824.602,1018.12},
		{8534.57,510.991,968.305},
		{7270.83,1124.06,619.013},
		{5886.15,1662.72,582.115},
		{4975.09,2841.64,607.929},
		{3811.58,3744,606},
		{2498.22,3970.89,606},
		{1191.57,4446.34,610.052},
		{-292.301,4351.9,610},
		{-1651.76,3923.68,604.69},
		{-2287.25,5359.81,601},
		{-2037.47,6830.16,598},
		{-2115.78,8199.72,596},
		{-1889.82,9623.33,596},
		{-1074.29,10821.2,601.838},
		{-40.914,12008.8,620.726},
		{804.963,13247.7,587},
		{1588.54,14621.3,596},
		{1902.99,15733.2,596},
		---遇到BOSS
		{1448.21,13710.6,595.772},
		---传送
		{1446.26,15732.3,596},
		{1951.16,16023.7,596},
		{2528,15808,596},
		{2278.07,14947.5,596},

	}
	坐标数量=#坐标表
	function 聚兽BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(1448.21,13710.6,595.772,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(1446.26,15732.3,596)
			if jieguo==3 then
				聚兽BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(1951.16,16023.7,596)
			if jieguo==3 then
				聚兽BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(2528,15808,596)
			if jieguo==3 then
				聚兽BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(2278.07,14947.5,596)
			if jieguo==3 then
				聚兽BOSS(1)
				return
			end																																																								
		end	
	end	
	--导航寻路(-9130,-14510,606,坐标数量,坐标表)
	导航寻路(1902.99,15733.2,596,坐标数量,坐标表)
	聚兽BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 荆棘秽土()
	while  true do	
		延迟(2000)
		if 取地图名() == "荆棘秽土" then
			改写JSON配置("荆棘秽土")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("荆棘秽土-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-283,-88,3},
		{1191.58,64,3},
		{2613.59,363.702,3},
		{3951.76,453.654,3},
		{5354.31,599.238,3},
		{6469.78,1511.03,3},
		{7912.1,1490.65,3},
		{9390.56,1682.1,3},
		{10295.7,2891.4,3},
		{10513.1,4278.73,3},
		{10463.6,5759.14,3},
		{10123.6,7109.59,3},
		{9791.19,8458.45,3},
		{8842.04,9612.8,3},
		{7519.21,9977.93,3},
		{6175.46,10497.1,3},
		{4922.86,11200.3,3},
		{4574.88,12518,3},
		{4934.57,13874.9,3},
		{5330.66,15126,3},
		{6103.79,16318.9,3},
		{6951.48,17551,3},
		{7042.28,19003.7,3},
		{6358.33,20240.5,3},
		{4933.15,20538.6,3},
		{3651.78,19968,3},
		{2270.15,19456,3},
		{1918.03,18102.8,3},
		{2323.18,16696.6,13},
		{2496.83,15223.6,-16.0448},
		{1733.99,13954.7,-321.643},
		{1074.4,12863.5,-603.417},
		{867.138,11882.1,-602.314},
		---遇到BOSS
		{520.361,11702.5,-594.148},
		{304,12768,-611},
		{1281.25,12380.7,-607},
		{1083.91,11747.6,-599.112},
		{1824,13888,-333},
		---传送
	}
	坐标数量=#坐标表
	function 荆棘BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(1824,13888,-333,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(520.361,11702.5,-594.148)
			if jieguo==3 then
				荆棘BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(304,12768,-611)
			if jieguo==3 then
				荆棘BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(1281.25,12380.7,-607)
			if jieguo==3 then
				荆棘BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(1083.91,11747.6,-599.112)
			if jieguo==3 then
				荆棘BOSS(1)
				return
			end																																																								
		end	
	end	
	--导航寻路(-9130,-14510,606,坐标数量,坐标表)
	导航寻路(867.138,11882.1,-602.314,坐标数量,坐标表)
	荆棘BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 云间高墙()
	while  true do	
		延迟(2000)
		if 取地图名() == "云间高墙" then
			改写JSON配置("云间高墙")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("云间高墙-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-1100,-24950,92},
		{-519.897,-23727.7,91},
		{49.5823,-22428.8,91},
		{181.758,-21059.1,91},
		{891.935,-19720.1,91},
		{1251.71,-18285.6,91},
		{1301.89,-16886.2,91},
		{2089.99,-15766.5,93.2983},
		{2723.71,-14579.1,94.4043},
		{3087.16,-13144.2,91},
		{3264.95,-11785,88},
		{3114.65,-10320.1,88.3343},
		{2511.82,-8965.71,86},
		{2126.19,-7523.84,86},
		{2271.02,-6139.56,86},
		{2469.69,-4677.82,86},
		{2856.5,-3251.22,87.6007},
		{3759,-2059.4,88.5312},
		{4496.55,-917.32,89.6492},
		{5331.19,208.353,86},
		{6727.33,680.269,88},
		{7632.82,1739.02,89.5256},
		{7832,3177.61,87.75},
		{7911.03,4656.41,87},
		{7327.69,5871.54,87},
		{6647.68,6195,86},
		{6979.18,7708.1,86},
		{7594.27,9018.71,86},
		{8422.17,10269.3,86},
		{9153.59,11574,86},
		{10036.7,12779.5,86},
		{11226.6,13817.4,86},
		{12603.4,14176,86},
		{14096.8,14061.3,86},
		{15574.6,13887.9,86},
		{17058,13980.4,86},
		{18522.6,14545.3,109.459},
		{19459.8,15611.3,98.8825},
		{19605.3,16989.4,106},
		{19334.6,18382.9,106},
		{18113.6,19317.5,95.3775},
		{16648.8,19138.9,101},
		{16208,18592,120},
		---传送
		{-2249.98,2100.01,2476},
		{-1295.83,3111.41,2447.23},
		{-188.501,3986.71,2446},
		---BSS
		{-752,3936,2446},
		{-342.58,3295.94,2446},
		{-1007.02,3342.7,2446},
		{-777.966,4049.2,2446},

	}
	坐标数量=#坐标表
	function 云间BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(16208,18592,120,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(-752,3936,2446)
			if jieguo==3 then
				云间BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-342.58,3295.94,2446)
			if jieguo==3 then
				云间BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-1007.02,3342.7,2446)
			if jieguo==3 then
				云间BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(-777.966,4049.2,2446)
			if jieguo==3 then
				云间BOSS(1)
				return
			end																																																								
		end	
	end	
	导航寻路(16208,18592,120,坐标数量,坐标表)
	延迟(3000)
	按键(0x44) --按键D
	延迟(6000)
	实时移动(-768,3072,2446,300)
	云间BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 虚构丰碑()

	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{4990,9690,4897},
		{5986.6,9351.75,4897},
		{7200,9344,4897},
		---遇到BOSS
		{6808.05,9885.48,4897},
		{6503.92,9266.99,4897},
		{6745.85,8465.58,4897},
		{7208.2,9150.25,4897},
		{4720,9824,4897},
		---传送
	}
	坐标数量=#坐标表
	function 虚构BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(4720,9824,4897,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
			local jieguo=BOSS寻路(6808.05,9885.48,4897)
			if jieguo==3 then
				虚构BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(6503.92,9266.99,4897)
			if jieguo==3 then
				虚构BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(6745.85,8465.58,4897)
			if jieguo==3 then
				虚构BOSS(1)
				return
			end			
			local jieguo=BOSS寻路(7208.2,9150.25,4897)
			if jieguo==3 then
				虚构BOSS(1)
				return
			end																																																								
		end	
	end		
	导航寻路(7200,9344,4897,坐标数量,坐标表)
	虚构BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 恶武荒村()
	while  true do	
		延迟(2000)
		if 取地图名() == "恶武荒村" then
			改写JSON配置("恶武荒村")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("恶武荒村-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-10875.5,-2053,2768},
		{-9395.54,-2302.72,2768},
		{-7874.35,-2214.32,2768},
		{-6334.71,-1688.5,2768},
		{-5212.36,-550.949,2768},
		{-3832.49,34.1574,2768},
		{-2723.01,-1005.44,2768},
		{-2710.95,-2541.89,2768},
		{-2514.35,-3995.03,2768},
		{-1803.38,-5395.21,2768},
		{-1886.09,-6975.76,2768},
		{-2385.51,-8528.82,2768},
		{-3150.48,-9964.75,2768},
		{-3714.46,-11452.5,2768},
		{-2537.05,-12558.3,2768},
		{-1064.61,-13291.3,2768},
		{500.113,-13719.1,2768},
		{1415.9,-12332.9,2768},
		{1788.74,-10720.9,2768},
		{1973.73,-9050,2768},
		{2243.07,-7506.19,2768},
		{1750.98,-6217.73,2768},
		{1680.52,-4571.72,2768},
		{1373.53,-3067.04,2768},
		{1148.5,-1505.73,2768},
		{1810.57,-167.704,2768},
		{2969.64,1004.9,2768},
		{4531.65,1301.05,2768},
		{6155.68,1402.4,2768},
		{7805.82,1354.72,2768},
		{9473.62,1205.21,2768},
		{9690.62,2512.83,2768},
		{10143.4,4106.84,2768},
		{10396.7,5666.46,2768},
		{9715.73,7004.17,2768},
		{8117.46,6910.7,2768},
		{6474.85,7003.76,2768},
		{5041.29,6368,2768},
		{3555.54,5731.88,2768},
		{2181.29,6622.28,2768},
		{1261.1,7887.04,2768},
		{15.8409,9018.67,2768},
		{-1116.95,9820.8,2768},
		{-1210.95,11228.4,2768},
		{-1067.43,12797.1,2768},
		{-2003.54,14025.4,2768},
		{-3565.87,14445.9,2768},
		{-5082.25,14344.7,2768},
		{-5901.65,12948.1,2768},
		{-6056.02,11329.4,2768},
		{-5636.98,9803.09,2768},
		{-5908.56,8218.84,2768},
		{-5873.7,6620.67,2768},
		{-5767.05,7923.59,2768},
		---传送
		{-6032.07,6394.16,2768},
		{-6057.07,5452.89,2768},
		---BSS


	}
	坐标数量=#坐标表
	function 恶武BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-5767.05,7923.59,2768,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
        local locations = {
			{-5632.26,4969.07,2768},
			{-6534.98,5300.91,2768},
			{-6632.71,4657.23,2768},
			{-5664,4416,2768},
        }
			math.randomseed(os.time())  -- 设置随机数种子
			local shuffle = function(t)
				local n = #t
				while n > 2 do
					local k = math.random(n)
					t[n], t[k] = t[k], t[n]
					n = n - 1
				end
				return t
			end		
			local shuffled_locations = shuffle(locations)  -- 打乱数组顺序
			for _, location in ipairs(shuffled_locations) do
				local jieguo=实时移动(location[1], location[2], location[3], 300)
				if 取血比例() < 79 then
					使用技能("复合药剂")
				end
				鼠标右键点击()
				延迟(300)
				按键加强("w")
				按键加强("e")
				按键加强("r")
				if jieguo==3 then
					延迟(1000)
					记忆点复活()
					延迟(3000)
					ishave,x,y,z,name=取传送门信息(3500)
					if name == "传送到BOSS场地" then
						实时移动(x,y,z,300)
						延迟(3000)
						按键(0x44) --按键D
						延迟(5000)	
					end		
				end						
			end																																																							
		end	
	end	
	导航寻路(-5767.05,7923.59,2768,坐标数量,坐标表)
	ishave,x,y,z,name=取传送门信息(3500)
	if name == "传送到BOSS场地" then
	实时移动(x,y,z,300)
	延迟(3000)
	按键(0x44) --按键D
	延迟(5000)	
	end			
	导航寻路(-6057.07,5452.89,2768,坐标数量,坐标表)
	恶武BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(3500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 晦暗广场()
	while  true do	
		延迟(2000)
		if 取地图名() == "晦暗广场" then
			改写JSON配置("晦暗广场")
			break	
		end	
		延迟(2000)	
		if 取停止挂机命令()==1 then
			输出信息("晦暗广场-脚本退出挂机流程")
			return
		end	
	end
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-7899.93,-5059.07,-670},
		{-7984.57,-3688.12,-670},
		{-7753.21,-2334.18,-670},
		{-7384.91,-1027.9,-670},
		{-7054.96,333.115,-670},
		{-7021.52,1713.18,-670},
		{-7272.77,3290.21,-670},
		{-7073.83,4651.69,-670},
		{-5517.84,5241.97,-670},
		{-4169.93,4546.4,-566.491},
		{-2844.34,3697.73,-381},
		{-2358.73,2215.58,-381},
		{-1797.8,2063.43,-378.88},
		{-438.785,2119.65,-21},
		{-297.412,832.194,214},
		{688.275,-190.991,214},
		{1798.11,-987.04,214},
		{3159.61,-1240.44,469.356},
		{4473.69,-577.911,609},
		{5864.18,56.4465,800.813},
		{7294.02,-55.8601,1105.81},
		{5981,39.1139,838.063},
		{5183.89,21.7633,619.986},
		---传送
		{6534.64,111.856,1022.32},
		{8088.49,166.277,1283.65},
		{7983.89,154.408,1242.87},

	}
	坐标数量=#坐标表
	function 晦暗BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(5183.89,21.7633,619.986,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
        local locations = {
			{8560,-544,1329},
			{8315.58,469.152,1317.45},
			{7909.59,-103.426,1212.77},
			{8768,-128,1329},
        }
			math.randomseed(os.time())  -- 设置随机数种子
			local shuffle = function(t)
				local n = #t
				while n > 2 do
					local k = math.random(n)
					t[n], t[k] = t[k], t[n]
					n = n - 1
				end
				return t
			end		
			local shuffled_locations = shuffle(locations)  -- 打乱数组顺序
			for _, location in ipairs(shuffled_locations) do
				local jieguo=实时移动(location[1], location[2], location[3], 300)
				if 取血比例() < 79 then
					使用技能("复合药剂")
				end
				鼠标右键点击()
				延迟(300)
				按键加强("w")
				按键加强("e")
				按键加强("r")
				if jieguo==3 then
					延迟(1000)
					记忆点复活()
					延迟(3000)
					ishave,x,y,z,name=取传送门信息(3500)
					if name == "传送到BOSS场地" then
						实时移动(x,y,z,300)
						延迟(3000)
						按键(0x44) --按键D
						延迟(5000)	
					end						
				end						
			end																																																							
		end	
	end	
	导航寻路(5183.89,21.7633,619.986,坐标数量,坐标表)
	ishave,x,y,z,name=取传送门信息(3500)
	if name == "传送到BOSS场地" then
		实时移动(x,y,z,300)
		延迟(3000)
		按键(0x44) --按键D
		延迟(5000)	
	end		
	导航寻路(7983.89,154.408,1242.87,坐标数量,坐标表)
	晦暗BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(3500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 雷影极巅()

	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{-153.347,356.516,673},
		{578.722,620.572,673},
		{49.9526,362.235,673},
		{-520.162,-163.378,673},
		{-235.195,-798.436,673},
		{635.325,-494.673,673},
		{-248.815,36.5581,673},
		{-875.523,545.873,673},
		---传送
	}
	坐标数量=#坐标表
	function 雷影BOSS(模式)
		if 模式==1 then
			延迟(7000)
			导航寻路(-875.523,545.873,673,坐标数量,坐标表)
			延迟(3000)
			按键(0x44) --按键D
			延迟(5000)			
		end	
		while  true do	
			--NPC,x,y,z=范围怪判断2(1,0,0,0,"矮人王",2,15000)		
			NPC,x,y,z=范围怪判断(1,0,0,0,8000)
			if NPC==0 then
				break
			end		
			ishave,x,y,z,name=取传送门信息(3500)
			if name == "" then
				break
			end										
			if 取停止挂机命令()==1 then
				输出信息("脚本退出挂机流程")
				return
			end																																				
        local locations = {
			{-153.347,356.516,673},
			{578.722,620.572,673},
			{49.9526,362.235,673},
			{-520.162,-163.378,673},
			{-235.195,-798.436,673},
			{635.325,-494.673,673},
			{-248.815,36.5581,673},
			{-875.523,545.873,673},
        }
			math.randomseed(os.time())  -- 设置随机数种子
			local shuffle = function(t)
				local n = #t
				while n > 2 do
					local k = math.random(n)
					t[n], t[k] = t[k], t[n]
					n = n - 1
				end
				return t
			end		
			local shuffled_locations = shuffle(locations)  -- 打乱数组顺序
			for _, location in ipairs(shuffled_locations) do
				local jieguo=实时移动(location[1], location[2], location[3], 300)
				if 取血比例() < 79 then
					使用技能("复合药剂")
				end
				鼠标右键点击()
				延迟(300)
				按键加强("w")
				按键加强("e")
				按键加强("r")
				if jieguo==3 then
					延迟(1000)
					记忆点复活()
					延迟(3000)
					ishave,x,y,z,name=取传送门信息(3500)
					if name == "传送到BOSS场地" then
						实时移动(x,y,z,300)
						延迟(3000)
						按键(0x44) --按键D
						延迟(5000)	
					end						
				end						
			end																																																							
		end	
	end	
	导航寻路(-875.523,545.873,673,坐标数量,坐标表)
	导航寻路(-153.347,356.516,673,坐标数量,坐标表)
	雷影BOSS(0)
	延迟(2000)	
	ishave,x,y,z,name=取传送门信息(2500)
	if name == "" then
		实时移动(x,y,z,300)
	end		
	延迟(3000)
	按键(0x44) --按键D
	延迟(2000)
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(6000)		
	加点()
	延迟(2000)	
	按键加强("b")
	延迟(2000)
	快速换装()
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(1000)					
end
function 避难所()
	local 坐标表=
	{
		--用控制台在需要导航的区域取一些可通行的点，没有顺序要求
		{4300.99,2630.17,3123.81},
		{3713.76,2305.12,3094.93},
		{3128.37,2069.59,3100.16},
		{2522.64,1946.81,3119.84},
		{2479.06,1383.45,3097.12},
		{2240.92,815.816,3093},
		{2147.34,202.028,3093},
		{1659.25,487.635,3093},
		{1173.85,966.667,3093},
		{834.239,1424.05,3094.75},
		{504.389,1959.59,3028.24},
		{168.362,2482.62,2890.3},
		{-13.8976,3078.54,2859},
		{-532.91,3125.23,2860},
		{-1123.74,3017.84,2857.31},
		{-1723.47,3096.71,2857.47},
		{-2350.25,3043.64,2861.89},
		{-2973.5,3111.35,2859.54},
		{-3444.01,3469.5,2867.37},
		{-4043.8,3147.94,2863},
		{-3733.53,2752.5,2879.95},
		{-3975.53,2200.35,2890.62},
		{-4260.29,1639.17,2888},
		{-4157.56,2142.52,2889.98},
		{-3862.45,2595.4,2890.79},
		{-3300.79,2859.66,2870.65},
		{-2767.1,2957.82,2858.43},
		{-2141.15,3028.77,2862.35},
		{-1515.65,3046.96,2854.11},
		{-884.599,3065.2,2860.58},
		{-336.758,3009.5,2858.05},
		{161.586,2679.77,2867.23},
		{539.39,2215.59,2978.53},
		{849.303,1708.69,3079.41},
		{1036.34,1110.83,3094},
		{1228.34,551.315,3093},
		{1405.74,-43.143,3093},
		{1881.29,-413.827,3093},
		{2533.24,-404.669,3093},
		{2563.72,-917.987,3093},
		{2387.01,-1397.57,3093},
		{1758.11,-1627.06,3095},
		{1341.68,-2038.42,3100.63},
		{1009.98,-2550.18,3106.6},
		{422.767,-2805.3,3093},
		{-19.3714,-3224.47,3090},
		{-232.362,-3790.78,3093},
		{-548.763,-3181.5,3089},
		{-653.411,-2595.62,3090},
		{-786.004,-1979.15,3092.44},
		{-183.074,-1560.11,3094.22},
		{434.91,-1658.04,3093},
		{964.721,-1808.85,3093},
		{1376.23,-2240.45,3112.06},
		{1806.93,-2700.14,3216.71},
		{1949.96,-3197.57,3250.77},
		{1669.72,-2714.08,3197.12},
		{1816.34,-2141.89,3111.15},
		{2330.87,-1823.82,3093},
		{2954.98,-1836.74,3093},
		{3391.84,-1293.09,3093},
		{3861.15,-1117.08,3093},
		{4270.05,-1486.65,3093},
		{4615.35,-2014.15,3093},
		{5195.96,-1813.83,3093},
		{5439.41,-1257.95,3094.84},
		{5357.68,-664.89,3097},
		{5123.85,-73.8564,3093.31},
		{5522.55,386.827,3093},
		{4986.2,774.47,3093},
		{4609.3,1242.09,3093},
		{4298.49,1883.19,3093},
		{4229.97,2478.97,3115.61},
		{4482.13,2926.95,3100.23},
		{4792.89,3344.94,3223.34},
		{5103.95,3797.43,3331.02},
		{5473.54,4239.56,3558.78},
		{5687.6,4530,3605.52},
		---异界

	}
	坐标数量=#坐标表
	避难所寻路(5687.6,4530,3605.52,坐标数量,坐标表)
end	
function 副本进入()
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)
end	
function 异界冰封()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("信仰之墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	信仰之墙()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("呼啸矿道")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	呼啸矿道()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("信仰之墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	信仰之墙()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("呼啸矿道")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	呼啸矿道()		
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("亚人村落")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	亚人村落()		
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	打开异界关卡("冰封寒渊监视者")--测试有效
	延迟(3000)	
	开启关头传送门()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	极冬王座()
	实时移动(4682.9,3359.64,3199.43,300)
	实时移动(4441.86,2705.28,3114.23,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)		
end	
function 开冰封寒渊时刻2()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 2" then
			输出信息("========时刻 2========")
			break
		end			
		延迟(3000)	
		关闭时刻解锁提示()
		延迟(2000)
		时刻卡牌选择窗口关闭(1)
		延迟(1000)
		时刻混乱窗口关闭()
		延迟(1000)		
		点击时刻选择按钮()--测试有效
		延迟(1000)		
		点击指定时刻("时刻 2")--测试有效
		延迟(2000)
		点击指定时刻("时刻 1")--测试有效
		延迟(2000)
		点击指定时刻("时刻 2")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 2" then
			输出信息("========时刻 2========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
	end		
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
end	
function 开冰封寒渊时刻3()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		if 取当前时刻() == "时刻 3" then
			输出信息("========时刻 3========")
			break
		end				
		关闭时刻解锁提示()
		延迟(2000)
		时刻卡牌选择窗口关闭(1)
		延迟(1000)
		时刻混乱窗口关闭()
		延迟(1000)
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 3")--测试有效
		延迟(2000)
		点击指定时刻("时刻 2")--测试有效
		延迟(2000)
		点击指定时刻("时刻 3")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 3" then
			输出信息("========时刻 3========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
	end		
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
end	
function 开冰封寒渊时刻4()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		if 取当前时刻() == "时刻 4" then
			输出信息("========时刻 4========")
			break
		end				
		关闭时刻解锁提示()
		延迟(2000)		
		时刻卡牌选择窗口关闭(1)
		延迟(1000)
		时刻混乱窗口关闭()
		延迟(1000)		
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 4")--测试有效
		延迟(2000)
		点击指定时刻("时刻 3")--测试有效
		延迟(2000)
		点击指定时刻("时刻 4")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 4" then
			输出信息("========时刻 4========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)	
		开冰封寒渊时刻4()		
	end		
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
end	
function 开冰封寒渊时刻5()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		if 取当前时刻() == "时刻 5" then
			输出信息("========时刻 5========")
			break
		end				
		关闭时刻解锁提示()
		延迟(2000)
		时刻卡牌选择窗口关闭(1)
		延迟(1000)
		时刻混乱窗口关闭()
		延迟(1000)		
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 5")--测试有效
		延迟(2000)
		点击指定时刻("时刻 4")--测试有效
		延迟(2000)
		点击指定时刻("时刻 5")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 5" then
			输出信息("========时刻 5========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
	end		
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
end	
--[[function 异界冰封时刻3()
while  true do	
	if 取停止挂机命令()==1 then
		输出信息("脚本退出挂机流程")
		return
	end		
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	if 取当前时刻() == "时刻 3" then
		输出信息("========时刻 3========")
		break
	end		
	关闭时刻解锁提示()
	延迟(2000)
	点击时刻选择按钮()--测试有效
	延迟(1000)
	点击指定时刻("时刻 3")--测试有效
	延迟(2000)
	点击指定时刻("时刻 2")--测试有效
	延迟(2000)
	点击指定时刻("时刻 3")--测试有效
	延迟(3000)
	if 取当前时刻() == "时刻 3" then
		输出信息("========时刻 3========")
		break
	end	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(5000)		
end		
	打开异界关卡("信仰之墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	信仰之墙()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("呼啸矿道")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	呼啸矿道()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("信仰之墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	信仰之墙()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("呼啸矿道")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	呼啸矿道()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("亚人村落")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	亚人村落()		
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("亚人村落")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	亚人村落()				
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	打开异界关卡("冰封寒渊监视者")--测试有效
	延迟(3000)	
	开启关头传送门()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	极冬王座()	
end	--]]
function 冰封时刻3()
	while  true do	
		避难所()
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		选择异界地区("冰封寒渊")
		延迟(3000)	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 3" then
			输出信息("========时刻 3========")
			break
		end		
		关闭时刻解锁提示()
		延迟(2000)
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 3")--测试有效
		延迟(2000)
		点击指定时刻("时刻 2")--测试有效
		延迟(2000)
		点击指定时刻("时刻 3")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 3" then
			输出信息("========时刻 3========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)			
	end	
end	
function 异界冰封时刻3()
	冰封时刻3()
	local 当前次数,最大次数=取异界关头副本次数("冰封寒渊监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("冰封寒渊监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		极冬王座()
		return	
	end		
	打开异界关卡("信仰之墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	信仰之墙()
	冰封时刻3()
	local 当前次数,最大次数=取异界关头副本次数("冰封寒渊监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("冰封寒渊监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		极冬王座()
		return	
	end	
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("呼啸矿道")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	呼啸矿道()	
	冰封时刻3()
	local 当前次数,最大次数=取异界关头副本次数("冰封寒渊监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("冰封寒渊监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		极冬王座()
		return	
	end	
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("亚人村落")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	亚人村落()
end	
--[[function 钢铁炼境时刻2()
while  true do	
	if 取停止挂机命令()==1 then
		输出信息("脚本退出挂机流程")
		return
	end		
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	if 取当前时刻() == "时刻 2" then
		输出信息("========时刻 2========")
		break
	end		
	关闭时刻解锁提示()
	延迟(2000)
	点击时刻选择按钮()--测试有效
	延迟(1000)
	点击指定时刻("时刻 2")--测试有效
	延迟(2000)
	点击指定时刻("时刻 1")--测试有效
	延迟(2000)
	点击指定时刻("时刻 2")--测试有效
	延迟(3000)
	if 取当前时刻() == "时刻 2" then
		输出信息("========时刻 2========")
		break
	end	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(5000)			
end		
	打开异界关卡("聚兽平原")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	聚兽平原()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("云间高墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	云间高墙()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("云间高墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	云间高墙()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()		
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	打开异界关卡("钢铁炼境监视者")--测试有效
	延迟(3000)	
	开启关头传送门()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	虚构丰碑()		
end	--]]
function 钢铁炼境时刻2()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
while  true do	
	if 取停止挂机命令()==1 then
		输出信息("脚本退出挂机流程")
		return
	end		
	if 取当前时刻() == "时刻 2" then
		输出信息("========时刻 2========")
		break
	end		
	关闭时刻解锁提示()
	延迟(2000)	
	点击时刻选择按钮()--测试有效
	延迟(1000)
	点击指定时刻("时刻 2")--测试有效
	延迟(2000)
	点击指定时刻("时刻 1")--测试有效
	延迟(2000)
	点击指定时刻("时刻 2")--测试有效
	延迟(3000)
	if 取当前时刻() == "时刻 2" then
		输出信息("========时刻 2========")
		break
	end	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(5000)			
end	
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end	
	打开异界关卡("聚兽平原")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	聚兽平原()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end			
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("云间高墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	云间高墙()
end	
function 冰封时刻4()
	while  true do	
		避难所()
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		选择异界地区("冰封寒渊")
		延迟(3000)	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 4" then
			输出信息("========时刻 4========")
			break
		end		
		关闭时刻解锁提示()
		延迟(2000)
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 4")--测试有效
		延迟(2000)
		点击指定时刻("时刻 3")--测试有效
		延迟(2000)
		点击指定时刻("时刻 4")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 4" then
			输出信息("========时刻 4========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)			
	end	
end	
function 异界冰封时刻4()
	冰封时刻4()
	local 当前次数,最大次数=取异界关头副本次数("冰封寒渊监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("冰封寒渊监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		极冬王座()
		return	
	end		
	打开异界关卡("信仰之墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	信仰之墙()
	冰封时刻4()
	local 当前次数,最大次数=取异界关头副本次数("冰封寒渊监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("冰封寒渊监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		极冬王座()
		return	
	end	
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("呼啸矿道")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	呼啸矿道()	
	冰封时刻4()
	local 当前次数,最大次数=取异界关头副本次数("冰封寒渊监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("冰封寒渊监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		极冬王座()
		return	
	end	
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	选择异界地区("冰封寒渊")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("亚人村落")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	亚人村落()
end	
--[[function 钢铁炼境时刻3()
while  true do	
	if 取停止挂机命令()==1 then
		输出信息("脚本退出挂机流程")
		return
	end		
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	if 取当前时刻() == "时刻 3" then
		输出信息("========时刻 3========")
		break
	end		
	关闭时刻解锁提示()
	延迟(2000)
	点击时刻选择按钮()--测试有效
	延迟(1000)
	点击指定时刻("时刻 3")--测试有效
	延迟(2000)
	点击指定时刻("时刻 2")--测试有效
	延迟(2000)
	点击指定时刻("时刻 3")--测试有效
	延迟(3000)
	if 取当前时刻() == "时刻 3" then
		输出信息("========时刻 3========")
		break
	end	
	延迟(1000)
	按键加强("spacebar")--按空格关闭所有界面		
	延迟(5000)			
end		
	打开异界关卡("聚兽平原")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	聚兽平原()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("云间高墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	云间高墙()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("云间高墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	云间高墙()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()		
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	打开异界关卡("钢铁炼境监视者")--测试有效
	延迟(3000)	
	开启关头传送门()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	虚构丰碑()		
end	--]]
function 钢铁时刻3()
	while  true do	
		避难所()
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		选择异界地区("钢铁炼境")
		延迟(3000)	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 3" then
			输出信息("========时刻 3========")
			break
		end		
		关闭时刻解锁提示()
		延迟(2000)
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 3")--测试有效
		延迟(2000)
		点击指定时刻("时刻 2")--测试有效
		延迟(2000)
		点击指定时刻("时刻 3")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 3" then
			输出信息("========时刻 3========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)			
	end	
end	
function 钢铁炼境时刻3()
	钢铁时刻3()
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end	
	打开异界关卡("聚兽平原")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	聚兽平原()
	钢铁时刻3()
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end			
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
	钢铁时刻3()
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("云间高墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	云间高墙()
end	
function 钢铁时刻4()
	while  true do	
		避难所()
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		选择异界地区("钢铁炼境")
		延迟(3000)	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 4" then
			输出信息("========时刻 4========")
			break
		end		
		关闭时刻解锁提示()
		延迟(2000)
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 4")--测试有效
		延迟(2000)
		点击指定时刻("时刻 3")--测试有效
		延迟(2000)
		点击指定时刻("时刻 4")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 4" then
			输出信息("========时刻 4========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)			
	end	
end	
function 钢铁炼境时刻4()
	钢铁时刻4()
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end	
	打开异界关卡("聚兽平原")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	聚兽平原()
	钢铁时刻4()
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end			
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
	钢铁时刻4()
	local 当前次数,最大次数=取异界关头副本次数("钢铁炼境监视者")
	输出信息(当前次数)
	输出信息(最大次数)
	if 当前次数 == 最大次数 then
		打开异界关卡("钢铁炼境监视者")--测试有效
		延迟(3000)	
		开启关头传送门()
		延迟(3000)
		实时移动(5984,4992,3613,300)
		延迟(2000)
		按键(0x44) --按键D
		延迟(5000)	
		等待过图()
		延迟(2000)
		跳过动画()	
		延迟(2000)	
		虚构丰碑()
		return	
	end	
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("云间高墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	云间高墙()
end	
math.randomseed(os.time())
function 沸涌1号副本()
	打开异界关卡("蛮荒原野")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end		
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	蛮荒原野()
end

function 沸涌2号副本()
	打开异界关卡("龙陨荒野")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end		
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	龙陨荒野()	
end

function 第1号副本()
	打开异界关卡("信仰之墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end		
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	信仰之墙()
end

function 第2号副本()
	打开异界关卡("呼啸矿道")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end		
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	呼啸矿道()	
end

function 第3号副本()
	打开异界关卡("亚人村落")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end		
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	亚人村落()
end

function 第4号副本()
	打开异界关卡("冰封寒渊监视者")--测试有效
	延迟(3000)	
	开启关头传送门()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end		
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	极冬王座()
	实时移动(4682.9,3359.64,3199.43,300)
	实时移动(4441.86,2705.28,3114.23,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)		
end
function 冰封测试()
	--while true do
		hasFlag3 = 0
		local randomNums = {1,2,3} -- 随机选择的三个副本编号数组
		while #randomNums < 3 do -- 随机选择三个副本编号
			local randomNum = math.random(4)
			if randomNum ~= 4 and not table.contains(randomNums, randomNum) then
				table.insert(randomNums, randomNum)
			end
		end
		while true do
			if 取停止挂机命令()==1 then			
				return 
			end	
			避难所()
			延迟(2000)
			按键(0x44) --按键D
			延迟(5000)	
			选择异界地区("冰封寒渊")
			延迟(1000)	
			关闭时刻解锁提示()
			延迟(1000)	
			延迟(1000)	
			时刻卡牌选择窗口关闭(1)
			延迟(1000)	
			延迟(1000)	
			时刻混乱窗口关闭()
			延迟(1000)	
			if 取顶层窗口名()== "MysteryArea" then 
				break
			end			
		end	
		--输出信息("选中的副本编号为：" .. table.concat(randomNums, ","))
		--if table.contains(randomNums,4) then -- 如果随机结果包含 4，就进入 4 号副本
		--	第4号副本()
		local currentCount,maxCount=取异界关头副本次数("冰封寒渊监视者")
		输出信息(currentCount)
		输出信息(maxCount)
		if currentCount == maxCount or currentCount > maxCount then
			第4号副本()
			hasFlag3 = 1
		else -- 否则就进入其他三个副本随机其中一个
			local randomIndex = math.random(#randomNums)
			local dungeonNum = randomNums[randomIndex]
			if dungeonNum == 1 then
				第1号副本()
			elseif dungeonNum == 2 then
				第2号副本()
			elseif dungeonNum == 3 then
				第3号副本()
			end
		end
	--end	
end	
function 沸涌测试()
	--while true do
		local randomNums = {1,2} -- 随机选择的三个副本编号数组
		while #randomNums < 2 do -- 随机选择三个副本编号
			local randomNum = math.random(3)
			if randomNum ~= 3 and not table.contains(randomNums, randomNum) then
				table.insert(randomNums, randomNum)
			end
		end
		while true do
			if 取停止挂机命令()==1 then			
				return 
			end			
			避难所()
			延迟(2000)
			按键(0x44) --按键D
			延迟(5000)	
			选择异界地区("沸涌炎海")
			延迟(1000)	
			关闭时刻解锁提示()
			延迟(1000)	
			延迟(1000)	
			时刻卡牌选择窗口关闭(1)
			延迟(1000)	
			延迟(1000)	
			时刻混乱窗口关闭()
			延迟(1000)	
			if 取顶层窗口名()== "MysteryArea" then 
				break
			end				
		end
		local randomIndex = math.random(#randomNums)
		local dungeonNum = randomNums[randomIndex]
		if dungeonNum == 1 then
			沸涌1号副本()
		elseif dungeonNum == 2 then
			沸涌2号副本()
		end
	--end	
end	
-- 遍历背包函数

function 钢铁1号副本()
	打开异界关卡("聚兽平原")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	聚兽平原()
end	
function 钢铁2号副本()
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("荆棘秽土")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	荆棘秽土()	
end	
function 钢铁3号副本()
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("云间高墙")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end		
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	云间高墙()
end	
function 钢铁4号副本()
	打开异界关卡("钢铁炼境监视者")--测试有效
	延迟(3000)	
	开启关头传送门()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	虚构丰碑()
	实时移动(4682.9,3359.64,3199.43,300)
	实时移动(4441.86,2705.28,3114.23,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
end	
function 钢铁测试()
	--while true do
		steelFlag = 0
		local randomNums = {1,2,3} -- 随机选择的三个副本编号数组
		while #randomNums < 3 do -- 随机选择三个副本编号
			local randomNum = math.random(4)
			if randomNum ~= 4 and not table.contains(randomNums, randomNum) then
				table.insert(randomNums, randomNum)
			end
		end
		while true do
			if 取停止挂机命令()==1 then			
				return 
			end	
			避难所()
			延迟(2000)
			按键(0x44) --按键D
			延迟(5000)	
			选择异界地区("钢铁炼境")
			延迟(1000)	
			关闭时刻解锁提示()
			延迟(1000)	
			延迟(1000)	
			时刻卡牌选择窗口关闭(1)
			延迟(1000)	
			延迟(1000)	
			时刻混乱窗口关闭()
			延迟(1000)	
			if 取顶层窗口名()== "MysteryArea" then 
				break
			end			
		end	
		--输出信息("选中的副本编号为：" .. table.concat(randomNums, ","))
		--if table.contains(randomNums,4) then -- 如果随机结果包含 4，就进入 4 号副本
		--	第4号副本()
		local currentCount,maxCount=取异界关头副本次数("钢铁炼境监视者")
		输出信息(currentCount)
		输出信息(maxCount)
		if currentCount == maxCount or currentCount > maxCount then
			钢铁4号副本()
			steelFlag = 1
		else -- 否则就进入其他三个副本随机其中一个
			local randomIndex = math.random(#randomNums)
			local dungeonNum = randomNums[randomIndex]
			if dungeonNum == 1 then
				钢铁1号副本()
			elseif dungeonNum == 2 then
				钢铁2号副本()
			elseif dungeonNum == 3 then
				钢铁3号副本()
			end
		end
	--end	
end
function 雷鸣1号副本()
	打开异界关卡("恶武荒村")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	恶武荒村()
end	
function 雷鸣2号副本()
	关闭时刻解锁提示()
	延迟(3000)
	打开异界关卡("晦暗广场")--测试有效
	延迟(3000)	
	异界关卡点下一步按钮()
	延迟(3000)
	异界关卡点下一步按钮()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)		
	晦暗广场()	
end	
function 雷鸣3号副本()
	关闭时刻解锁提示()
	打开异界关卡("雷鸣废土监视者")--测试有效
	延迟(3000)	
	开启关头传送门()
	延迟(3000)
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end			
	实时移动(5984,4992,3613,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)	
	if 取顶层窗口名()== "MysteryArea"	or  取顶层窗口名() == "Mystery" then
		return
	end	
	等待过图()
	延迟(2000)
	跳过动画()	
	延迟(2000)	
	雷影极巅()
	实时移动(4682.9,3359.64,3199.43,300)
	实时移动(4441.86,2705.28,3114.23,300)
	延迟(2000)
	按键(0x44) --按键D
	延迟(2000)
	跳过对话()
	延迟(2000)	
end	
function 雷鸣测试()
	--while true do
		steelFlag = 0
		local randomNums = {1,2,3} -- 随机选择的三个副本编号数组
		while #randomNums < 3 do -- 随机选择三个副本编号
			local randomNum = math.random(4)
			if randomNum ~= 4 and not table.contains(randomNums, randomNum) then
				table.insert(randomNums, randomNum)
			end
		end
		while true do
			if 取停止挂机命令()==1 then			
				return 
			end	
			避难所()
			延迟(2000)
			按键(0x44) --按键D
			延迟(5000)	
			选择异界地区("雷鸣废土")
			延迟(1000)	
			关闭时刻解锁提示()
			延迟(1000)	
			延迟(1000)	
			时刻卡牌选择窗口关闭(1)
			延迟(1000)	
			延迟(1000)	
			时刻混乱窗口关闭()
			延迟(1000)	
			if 取顶层窗口名()== "MysteryArea" then 
				break
			end			
		end	
		--输出信息("选中的副本编号为：" .. table.concat(randomNums, ","))
		--if table.contains(randomNums,4) then -- 如果随机结果包含 4，就进入 4 号副本
		--	第4号副本()
		local currentCount,maxCount=取异界关头副本次数("雷鸣废土监视者")
		输出信息(currentCount)
		输出信息(maxCount)
		if currentCount == maxCount or currentCount > maxCount then
			雷鸣3号副本()
			steelFlag = 1
		else -- 否则就进入其他三个副本随机其中一个
			local randomIndex = math.random(#randomNums)
			local dungeonNum = randomNums[randomIndex]
			if dungeonNum == 1 then
				雷鸣1号副本()
			elseif dungeonNum == 2 then
				雷鸣2号副本()
			end
		end
	--end	
end
function 钢铁开时刻2()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)		
	选择异界地区("钢铁炼境")
	延迟(3000)	
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 2" then
			输出信息("========时刻 2========")
			break
		end		
		关闭时刻解锁提示()
		延迟(2000)
		时刻卡牌选择窗口关闭(1)
		延迟(1000)
		时刻混乱窗口关闭()
		延迟(1000)		
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 2")--测试有效
		延迟(2000)
		点击指定时刻("时刻 1")--测试有效
		延迟(2000)
		点击指定时刻("时刻 2")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 2" then
			输出信息("========时刻 2========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
		钢铁开时刻2()	
	end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
end
function 钢铁开时刻3()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 3" then
			输出信息("========时刻 3========")
			break
		end		
		关闭时刻解锁提示()
		延迟(2000)
		时刻卡牌选择窗口关闭(1)
		延迟(1000)
		时刻混乱窗口关闭()
		延迟(1000)		
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 3")--测试有效
		延迟(2000)
		点击指定时刻("时刻 2")--测试有效
		延迟(2000)
		点击指定时刻("时刻 3")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 3" then
			输出信息("========时刻 3========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)	
		钢铁开时刻3()		
	end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
end
function 钢铁开时刻4()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 4" then
			输出信息("========时刻 4========")
			break
		end		
		关闭时刻解锁提示()
		延迟(2000)
		时刻卡牌选择窗口关闭(1)
		延迟(1000)
		时刻混乱窗口关闭()
		延迟(1000)		
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 4")--测试有效
		延迟(2000)
		点击指定时刻("时刻 3")--测试有效
		延迟(2000)
		点击指定时刻("时刻 4")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 4" then
			输出信息("========时刻 4========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)	
		钢铁开时刻4()		
	end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
end
function 钢铁开时刻5()
	避难所()
	延迟(2000)
	按键(0x44) --按键D
	延迟(5000)
    通用接口XCallback("XCallback.Mystery.CloseNewCardTip")
    延迟(1000)	
	选择异界地区("钢铁炼境")
	延迟(3000)	
	while  true do	
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		if 取当前时刻() == "时刻 5" then
			输出信息("========时刻 5========")
			break
		end		
		关闭时刻解锁提示()
		延迟(2000)
		点击时刻选择按钮()--测试有效
		延迟(1000)
		点击指定时刻("时刻 5")--测试有效
		延迟(2000)
		点击指定时刻("时刻 4")--测试有效
		延迟(2000)
		点击指定时刻("时刻 5")--测试有效
		延迟(3000)
		if 取当前时刻() == "时刻 5" then
			输出信息("========时刻 5========")
			break
		end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
		钢铁开时刻5()	
	end	
		延迟(1000)
		按键加强("spacebar")--按空格关闭所有界面		
		延迟(5000)		
end
function checkBackpack()
    local hasFlag1 = false
    local hasFlag2 = false
	取背包分页("其他页")
	local num=取元素数量("背包物品")
	--输出信息(num)
	local i=0;
	while true do
		if i < num then
			local name,部位,装备等级,背包格子号,背包页号,stDesc1=取容器元素信息("背包",i)
			if name..stDesc1 == "冰封寒渊的信标1 阶信标" then
				hasFlag1 = true
				--break
			elseif name..stDesc1 == "沸涌炎海的信标1 阶信标" then
				hasFlag2 = true
				--break
			end
		else
			break
		end
		i=i+1;
	end	
    if hasFlag1 then
        冰封测试()
		return
    elseif hasFlag2 then
        沸涌测试()
		return
	else
		兑换信标(1)
    end
end
function checkBackpack1()
    local hasFlag1 = false
    local hasFlag2 = false
	local hasFlag3 = false
	取背包分页("其他页")
	local num=取元素数量("背包物品")
	local i=0;
	while true do
		if i < num then
			local name,部位,装备等级,背包格子号,背包页号,stDesc1=取容器元素信息("背包",i)
			if name..stDesc1 == "钢铁炼境的信标1 阶信标" then
				输出信息("钢铁炼境的信标1 阶信标")
                hasFlag1 = true
               --break
            elseif name..stDesc1 == "冰封寒渊的信标1 阶信标" then
				输出信息("冰封寒渊的信标1 阶信标")
				hasFlag2 = true
				--break
            elseif name..stDesc1 == "沸涌炎海的信标1 阶信标" then
				输出信息("沸涌炎海的信标1 阶信标")
				hasFlag3 = true
				--break
			end
		else
			break
		end
		i=i+1;
	end	
    
    if hasFlag1 then
        钢铁测试()
	elseif	hasFlag2 then 
		冰封测试()
	elseif	hasFlag3 then 
		沸涌测试()	
	else
		兑换信标(4)
   end
end	

function 时刻2checkBackpack()
    local hasFlag1 = false
    local hasFlag2 = false
	取背包分页("其他页")
	local num=取元素数量("背包物品")
	--输出信息(num)
	local i=0;
	while true do
		if i < num then
			local name,部位,装备等级,背包格子号,背包页号,stDesc1=取容器元素信息("背包",i)
			if name..stDesc1 == "钢铁炼境的信标2 阶信标" then			
				hasFlag1 = true
				--break
			elseif name..stDesc1 == "冰封寒渊的信标2 阶信标" then
				hasFlag2 = true
				--break
			end
		else
			break
		end
		i=i+1;
	end	
    if hasFlag1 then
        钢铁测试()
		return
    elseif hasFlag2 then 
        冰封测试()
		return
	else
		兑换信标(8)
    end
end
function 时刻5checkBackpack()
    local hasFlag1 = false
    local hasFlag2 = false
	取背包分页("其他页")
	local num=取元素数量("背包物品")
	--输出信息(num)
	local i=0;
	while true do
		if i < num then
			local name,部位,装备等级,背包格子号,背包页号,stDesc1=取容器元素信息("背包",i)
			if name..stDesc1 == "雷鸣废土的信标3 阶信标" then			
				hasFlag1 = true
				--break
			elseif name..stDesc1 == "钢铁炼境的信标3 阶信标" then
				hasFlag2 = true
				--break
			end
		else
			break
		end
		i=i+1;
	end	
    if hasFlag1 then
        雷鸣测试()
		return
    elseif hasFlag2 then 
		钢铁测试()
		return
	else
		兑换信标(14)
    end
end
function test()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		checkBackpack()
		if hasFlag3 == 1 then
			break
		end	
	end
end	
function test1()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		checkBackpack1()
		if steelFlag == 1 then
			break
		end	
	end
end	
function test2()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		时刻2checkBackpack()
		if steelFlag == 1 then
			break
		end	
	end
end	
function test3()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)
		if playerLevel > 80 then
			Level = 1
		end			
		时刻2checkBackpack()
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)
		if playerLevel > 82 then
			break
		end	
	end
end	

function test4()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)
		if playerLevel > 80 then
			Level = 1
		end			
		时刻5checkBackpack()
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)
		if playerLevel > 90 then
			break--开时刻
		end	
	end
end	


任务地图表={
    {地图名="崩毁的精神幻境",fun=开始},
	{地图名="余烬之息",fun=前往避难所},
	{地图名="远古通道",fun=觉醒者},
	{地图名="上古战场",fun=上古战场},
	{地图名="对龙巨墙",fun=巨墙尽头},
	{地图名="龙骨山脊",fun=龙骨山脊},
	{地图名="龙骨平原",fun=龙骨平原},
	{地图名="失落矿洞",fun=失落矿洞},
	{地图名="国王甬道",fun=国王甬道},
	{地图名="卡兹萨恩之心",fun=卡兹萨恩之心},
	{地图名="荒芜山道",fun=荒芜山道},
	{地图名="马内拉雨林",fun=马内拉雨林},
	{地图名="溪地虫谷",fun=溪地虫谷},
	{地图名="阴翳之地",fun=阴翳之地},
	{地图名="荣耀广场",fun=荣耀广场},
	{地图名="教堂前厅",fun=教堂前厅},
	{地图名="火种圣殿",fun=火种圣殿},
	{地图名="教区庭院",fun=教区庭院1},------注意这个地图名
	{地图名="信徒街巷",fun=信徒街巷},
	{地图名="禁忌高墙",fun=禁忌高墙},
	{地图名="意志高墙",fun=意志高墙},
	{地图名="群狼街巷",fun=群狼街巷},
	{地图名="银焰街巷",fun=银焰街巷},
	{地图名="教区庭院",fun=教区庭院},
	{地图名="圣德兰修道院",fun=圣德兰修道院},
	{地图名="遗忘秘殿",fun=遗忘秘殿},
	{地图名="觉醒秘殿",fun=觉醒秘殿},
	{地图名="升华秘殿",fun=升华秘殿},
	{地图名="边陲之地",fun=边陲之地},
	{地图名="沉没沙丘",fun=沉没沙丘},
	{地图名="坠星集市",fun=坠星集市},
	{地图名="女神裙摆",fun=女神裙摆},
	{地图名="遮风壁障",fun=遮风壁障},
	{地图名="伊吉聚落",fun=伊吉聚落},
	{地图名="雄狮之心",fun=雄狮之心},
	{地图名="预言圣地",fun=预言圣地},
	{地图名="永恒广场",fun=永恒广场},
	{地图名="皓月之路",fun=皓月之路},
	{地图名="繁星之路",fun=繁星之路},
	{地图名="太阳斗场",fun=太阳斗场},
	{地图名="梳洗大厅",fun=梳洗大厅},
	{地图名="太阳王庭",fun=太阳王庭},
	{地图名="亵渎御座",fun=亵渎御座},
	{地图名="锈蚀深渊",fun=锈蚀深渊},
	{地图名="荒野山地",fun=荒野山地},
	{地图名="蛮荒古道",fun=蛮荒古道},
	{地图名="泣血高原",fun=泣血高原},
	{地图名="埋骨林地",fun=埋骨林地},
	{地图名="狮鹫之巢",fun=狮鹫之巢},
	{地图名="深渊矿洞",fun=深渊矿洞},
	{地图名="熔铁之核",fun=熔铁之核},
	{地图名="荒废洞窟",fun=荒废洞窟},
	{地图名="觐见密道",fun=觐见密道},
	{地图名="尘封铸台",fun=尘封铸台},
	{地图名="遗世教区",fun=遗世教区},
	{地图名="教徒聚落",fun=教徒聚落},
	{地图名="祈祷庭院",fun=祈祷庭院},
	{地图名="狂信圣殿",fun=狂信圣殿},
	{地图名="异教王庭",fun=异教王庭},
	{地图名="孤烟营地",fun=孤烟营地},
	{地图名="沙漠边境",fun=沙漠边境},
	{地图名="无人沙丘",fun=无人沙丘},
	{地图名="荒漠绿洲",fun=荒漠绿洲},
	{地图名="迷沙屏障",fun=迷沙屏障},
	{地图名="狮王谷地",fun=狮王谷地},
	{地图名="金色阶梯",fun=金色阶梯},
	{地图名="古国遗迹",fun=古国遗迹},
	{地图名="破碎大厅",fun=破碎大厅},
	{地图名="日曜之城",fun=日曜之城},
	{地图名="流金王座",fun=流金王座},
	{地图名="隐秘丛林",fun=隐秘丛林},
	{地图名="巨木之森",fun=巨木之森},
	{地图名="毒瘴幽谷",fun=毒瘴幽谷},
	{地图名="异变秘殿",fun=异变秘殿},
	{地图名="幻影地宫",fun=幻影地宫},
}

function 主线任务循环()

	local 配置里的地图名=取配置中的地图名()
    local map_count =#任务地图表;
	local i = 0;--记录循环的次数

	while i < map_count  do
	    i = i + 1;  --“i+1”在 if外面是为了能继续查找下一个数组
		输出信息("主循环次数："..i);
		
		if 取停止挂机命令()==1 then
			输出信息("主线任务循环退出挂机流程")
			return
		end		
		--输出信息("-----------------");
		--输出信息(配置里的地图名);
		--输出信息(任务地图表[i].地图名);
		--输出信息("-++++++++++++++++--");
		dungeon=取地图名()
		if dungeon == 任务地图表[i].地图名 then
			输出信息("进来了1111111");
			输出信息("开始执行："..任务地图表[i].地图名.."函数");
			任务地图表[i].fun()
			延迟(1000)
			current=取地图名()
			延迟(1000)
			输出信息(current);
			while  true do	
				延迟(2000)
				if current == dungeon then
					延迟(3000)
					按键(0x44) --按键D
					延迟(2000)
					等待过图()
					延迟(2000)
					跳过动画()	
					延迟(6000)	
					延迟(2000)
					current=取地图名()
				end		
				if	current ~= dungeon then
					break
				end			
				if 取停止挂机命令()==1 then
					return
				end	
			end
		end
    end
	输出信息("循环结束"..i);

end
--增加回到起点的函数()
自动拾取(1)
local _, playerLevel, _, _, _, _ = 取角色信息()
输出信息(playerLevel)
if playerLevel <= 57 then
	主线任务循环()
end	


math.randomseed(os.time())
function 自动时刻练级70()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)			
		if playerLevel >= 70 then
			break
		end	
		输出信息("进来了70");		
		test()--冰封寒渊时刻1
		test()--冰封寒渊时刻2
		test()--冰封寒渊时刻2	
		开冰封寒渊时刻2()--开启冰封冰封寒渊时刻2
	end	
end
function 自动时刻练级75()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end		
		--test1()
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)		
		if playerLevel >= 75 then
			break
		end		
		输出信息("进来了75");		
		钢铁开时刻2()
		test1()
	end
end	
function 自动时刻练级80()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)		
		if playerLevel >= 80 then
			break
		end		
		输出信息("进来了80");		
		开冰封寒渊时刻3()
		钢铁开时刻3()
		test2()
		test2()
	end	
end	
function 自动时刻练级85()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)		
		if playerLevel >= 85 then
			break
		end		
		输出信息("进来了85");	
		钢铁开时刻4()
		开冰封寒渊时刻4()
		test2()
		test3()--循环到78
	end	
end	
function 自动时刻练级90()
	while true do
		if 取停止挂机命令()==1 then
			输出信息("脚本退出挂机流程")
			return
		end	
		local _, playerLevel, _, _, _, _ = 取角色信息()
		输出信息(playerLevel)		
		if playerLevel >= 90 then
			break
		end			
		输出信息("进来了90");
		开冰封寒渊时刻5()
		钢铁开时刻5()
		test4()
	end		
end	
自动时刻练级70()
自动时刻练级75()
自动时刻练级80()
自动时刻练级85()
自动时刻练级90()
